#Область ПрограммныйИнтерфейс

Процедура РедакторОбъекта(Ссылка, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментРедакторОбъекта();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылка);
	
КонецПроцедуры

Процедура НайтиСсылкиНаОбъект(Ссылка, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментПоискСсылокНаОбъект();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылка);
	
КонецПроцедуры

Процедура ИзмененияНаУзлах(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментЗафиксироватьИзмененияНаУзлах();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура ПоискИЗаменаСсылок(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментПоискИЗаменаСсылок();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура ЖурналРегистрации(Ссылки, ПараметрыВыполнения) Экспорт
	
	Параметры = Новый Структура;
	
	Если ТипЗнч(Ссылки) = Тип("Массив") Тогда
		
		Данные = Новый СписокЗначений;
		Данные.ЗагрузитьЗначения(Ссылки);
		
	Иначе
		Данные = Ссылки;
	КонецЕсли;
	Параметры.Вставить("Данные", Данные);
	
	ИТК_ФормаКлиент.ОткрытьЖурналРегистрации(Параметры);
	
КонецПроцедуры

Процедура ПодпискиНаСобытия(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментПодпискиНаСобытия();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура СвойстваМетаданныхОбъекта(Ссылка, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментМетаданные();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылка);
	
КонецПроцедуры

Процедура СтруктураХраненияОбъекта(Ссылка, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментСтруктураХранения();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылка);
	
КонецПроцедуры

Процедура АнализПравДоступа(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментАнализПравДоступа();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура СравнениеОбъектов(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментСравнениеОбъектов();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура ОбработкаВКонсолиКода(Ссылки, ПараметрыВыполнения) Экспорт
	
	Инструмент = ИТК_Перечисления.ИнструментОбработкаВКонсолиКода();
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Инструмент, Ссылки);
	
КонецПроцедуры

Процедура МенеджерФормы(Ссылка, ПараметрыВыполнения) Экспорт
	
	АктивноеОкно = АктивноеОкно();
	ОсновнаяФорма = АктивноеОкно.Содержимое[0];
	
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(
		ИТК_Перечисления.ИнструментМенеджерФормы(), ОсновнаяФорма.УникальныйИдентификатор);
	
КонецПроцедуры

#КонецОбласти
