#Область ПрограммныйИнтерфейс

Процедура ОбработкаКомандыОткрытиеСтандартнойОбработки(Идентификатор, ПараметрКоманды = Неопределено, ПараметрыВыполненияКоманды = Неопределено) Экспорт
	
	ПолноеИмяФормы = ИТК_БСП.ПолноеИмяФормыСтандартнойОбработки(Идентификатор);
	
	Если НЕ ЗначениеЗаполнено(ПолноеИмяФормы) Тогда
		
		ИдентификаторАнглийский = ИТК_БСПКлиентСерверПовтИсп.АнглийскийИдентификаторСтандартнойОбработки(Идентификатор);
		ШаблонТекста = НСтр("ru = 'Отсутствует стандартная обработка %1 (%2) (БСП)';
							|en = 'Missing standard processing %2 (%1) (SSL)'");
		Текст = СтрШаблон(ШаблонТекста, Идентификатор, ИдентификаторАнглийский);
		Заголовок = ИТК_ТуллкитКлиентСервер.Представление();
		ПоказатьПредупреждение( , Текст, , Заголовок);
		
		Возврат; 
		
	КонецЕсли;
	
	Если ПараметрыВыполненияКоманды = Неопределено Тогда
		ОткрытьФорму(ПолноеИмяФормы);
	Иначе
		ОткрытьФорму(ПолноеИмяФормы, , ПараметрыВыполненияКоманды.Источник,	ПараметрыВыполненияКоманды.Уникальность,
								ПараметрыВыполненияКоманды.Окно, ПараметрыВыполненияКоманды.НавигационнаяСсылка);
	КонецЕсли;
	
КонецПроцедуры

Процедура ОткрытьПользователяБСП(УникальныйИдентификатор) Экспорт
	
	ПользовательСсылка = ИТК_БСП.НайтиПользователяПоУникальномуИдентификатору(УникальныйИдентификатор);
	Если НЕ ЗначениеЗаполнено(ПользовательСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение( , ПользовательСсылка);
	
КонецПроцедуры

#КонецОбласти
