
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция АктивныеСтатусы() Экспорт
	
	РезультатМетода = Новый Массив;
	
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Выполняется);
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Подготовлен);
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ЗавершенныеСтатусы() Экспорт
	
	РезультатМетода = Новый Массив;
	
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Выполнен);
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Завершён);
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Отменен);
	РезультатМетода.Добавить(Перечисления.ОДМ_СтатусыЗадач.Ошибка);
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ЭтоАктивныйСтатус(Знач Статус) Экспорт
	
	Статусы = АктивныеСтатусы();
	Найден = НЕ (Статусы.Найти(Статус) = Неопределено);
	
	Возврат Найден;
	
КонецФункции

Функция ЭтоЗавершенныйСтатус(Знач Статус) Экспорт
	
	Статусы = ЗавершенныеСтатусы();
	Найден = НЕ (Статусы.Найти(Статус) = Неопределено);
	
	Возврат Найден;
	
КонецФункции


#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли