
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОчиститьПовторноИспользуемыеЗначения(Команда)
	
	ОбновитьПовторноИспользуемыеЗначения();
	ЗаполнитьДатуПоследнейОчистки();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНумерациюВсехОбъектов(Команда)
	
	ОбновитьНумерациюВсехОбъектовНаСервере();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьДатуПоследнейОчистки()
	
	ДатаПоследнейОчисткиПовторноИспользуемыхЗначений = ТекущаяДатаСеанса();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьНумерациюВсехОбъектовНаСервере()
	
	ОбновитьНумерациюОбъектов();
	ДатаПоследнегоОбновленияНумерацииВсехОбъектов = ТекущаяДатаСеанса();
	
КонецПроцедуры

#КонецОбласти
