#Область ПрограммныйИнтерфейс

Функция ДоступноРасширениеПоиска() Экспорт
	
	ПроверяемыеРоли = Новый Массив;
	
	ПроверяемыеРоли.Добавить(Метаданные.Роли.ИТК_ПолныеПрава.Имя);
	ПроверяемыеРоли.Добавить(Метаданные.Роли.ИТК_РасширениеГлобальногоПоиска.Имя);
	
	ИмяРоли = "АдминистраторСистемы";
	Если Метаданные.Роли.Найти(ИмяРоли) <> Неопределено Тогда
		ПроверяемыеРоли.Добавить(ИмяРоли);
	КонецЕсли;
	
	ИмяРоли = "SystemAdministrator";
	Если Метаданные.Роли.Найти(ИмяРоли) <> Неопределено Тогда
		ПроверяемыеРоли.Добавить(ИмяРоли);
	КонецЕсли;
	
	Для Каждого ИмяРоли Из ПроверяемыеРоли Цикл 
		
		Если РольДоступна(ИмяРоли) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
