
#Область ПрограммныйИнтерфейс

Функция БазовыйФайлРедакторJSON() Экспорт
	
	БазовыйКаталог      = КаталогВременныхФайлов();
	КаталогКомпоненты    = СтрШаблон("%1JSONEditor", БазовыйКаталог);
	ПутьЗапускаКомпоненты  = СтрШаблон("%1\index.html", КаталогКомпоненты);
	
	СтартовыйФайл = Новый Файл(ПутьЗапускаКомпоненты);
	Если НЕ СтартовыйФайл.Существует() Тогда
		ДвоичныеДанные = ОДМ_ВнутренниеМетоды_ВызовСервера.ОбщийМакет("ОДМ_JsonEditor");
		Чтение = Новый ЧтениеДанных(ДвоичныеДанные);
		Файл = Новый ЧтениеZipФайла(Чтение.ИсходныйПоток());
		Файл.ИзвлечьВсе(КаталогКомпоненты);
	КонецЕсли;
	
	Возврат ПутьЗапускаКомпоненты;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс
