#Область ПрограммныйИнтерфейс

Процедура Открыть(Инструмент = Неопределено)  Экспорт
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Инструмент", Инструмент);
	
	АктивноеОкно = АктивноеОкно();
	Для Каждого ОткрытоеОкно Из ПолучитьОкна() Цикл 
		
		Если АктивноеОкно = Неопределено И ОткрытоеОкно.НачальнаяСтраница Тогда
			АктивноеОкно = ОткрытоеОкно;
		КонецЕсли;
		
	КонецЦикла;
	
	ДанныеАнализаФормы = АнализАктивныхДанныхФормы(АктивноеОкно);
	Если ЗначениеЗаполнено(ДанныеАнализаФормы) Тогда
		
		Для Каждого КлючИЗначение Из ДанныеАнализаФормы Цикл 
			ПараметрыФормы.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	ОткрытьФорму("Обработка.ИТК_ГлобальноеМеню.Форма", ПараметрыФормы);
	
КонецПроцедуры

Процедура АнализАктивныхДанныхФормы_ДобавлениеДанныхТаблицыФормы(Объекты, Элемент, ИмяПоля = Неопределено) Экспорт
	
	ТекущаяСтрока = Элемент.ТекущаяСтрока;
	Если ТекущаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекущаяКолонка = Элемент.ТекущийЭлемент;
	ИмяКоллекцииТекущиеДанные = ИТК_ОбщийКлиентСервер.ИмяКоллекцииТекущиеДанные();
	
	Если ТипЗнч(ТекущаяСтрока) = Тип("Число") Тогда
		
		Если ИмяПоля = Неопределено Тогда
			
			Родитель = ИТК_ФормаКлиент.КоллекцияРодитель(ТекущаяКолонка);
			ИмяРодителя = Родитель.Имя;
			
			ИмяПоля = ТекущаяКолонка.Имя;
			Если СтрНачинаетсяС(ИмяПоля, ИмяРодителя) Тогда
				ИмяПоля = Сред(ИмяПоля, СтрДлина(ИмяРодителя) + 1);
			КонецЕсли;
		
		КонецЕсли;
		
		ДобавитьПолеКоллекцииОбъектаСПопыткой(Объекты, Элемент, ИмяПоля, ИмяКоллекцииТекущиеДанные);
		
	Иначе
		
		// Динамический список
		ВыделенныеСтроки = Элемент.ВыделенныеСтроки;
		ВыделеноНесколькоСтрок = (ВыделенныеСтроки.Количество() > 1);
		Если ВыделеноНесколькоСтрок Тогда
			ПолеОбъекта = ВыделенныеСтроки;
		Иначе
			
			ПолеОбъекта = ТекущаяСтрока;
			Если ТипЗнч(ПолеОбъекта) = Тип("СтрокаГруппировкиДинамическогоСписка") Тогда
				ПолеОбъекта = ПолеОбъекта.Ключ;
			КонецЕсли;
			
		КонецЕсли;
		
		Если ИТК_МетаданныеКлиентСервер.ОбъектКлючЗаписиНезависимогоРегистраСведений(ПолеОбъекта)
				ИЛИ НЕ ИТК_МетаданныеКлиентСервер.ОбъектКлючЗаписиРегистра(ПолеОбъекта) Тогда
			Объекты.Добавить(ПолеОбъекта);
		КонецЕсли;
		
		Если НЕ ВыделеноНесколькоСтрок Тогда
			ДобавитьПолеКоллекцииОбъектаСПопыткой(Объекты, Элемент, ТекущаяКолонка.Имя, ИмяКоллекцииТекущиеДанные);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция АнализАктивныхДанныхФормы(АктивноеОкно)
	
	Если АктивноеОкно = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Объекты = Новый Массив;
	Формы = Новый Массив;
	НавигационнаяСсылка = АктивноеОкно.ПолучитьНавигационнуюСсылку();
	
	Для Каждого ОкноКлиентскогоПриложения Из АктивноеОкно.Содержимое Цикл 
		
		АнализАктивныхДанныхФормы_ДобавитьФорму(Формы, АктивноеОкно, ОкноКлиентскогоПриложения);
		
		ТекущийЭлемент = ОкноКлиентскогоПриложения.ТекущийЭлемент;
		
		// Шаблон отчета на СКД в БСП
		Если ОкноКлиентскогоПриложения.ИмяФормы = ИТК_БСПКлиентСерверПовтИсп.ПолноеИмяФормыШаблонаОтчетаНаСКД()
				И ЗначениеЗаполнено(НавигационнаяСсылка) Тогда
			
			ДанныеФормыОтчетаНаСКД = ИТК_БСП.ДанныеФормыШаблонаОтчетаНаСКД(НавигационнаяСсылка);
			
			Если ЗначениеЗаполнено(ДанныеФормыОтчетаНаСКД) Тогда
				
				НавигационнаяСсылка = ДанныеФормыОтчетаНаСКД.НавигационнаяСсылка;
				ДобавитьОбъект(Объекты, ДанныеФормыОтчетаНаСКД.ВариантОтчета);
				
			КонецЕсли;
			
		КонецЕсли;
		
		// Анализ соджержимого
		Если ТипЗнч(ТекущийЭлемент) = Тип("ПолеФормы") Тогда
			АнализАктивныхДанныхФормы_ДобавлениеДанныхПоля(Объекты, ОкноКлиентскогоПриложения, ТекущийЭлемент);
		ИначеЕсли ТипЗнч(ТекущийЭлемент) = Тип("ТаблицаФормы") Тогда
			АнализАктивныхДанныхФормы_ДобавлениеДанныхТаблицыФормы(Объекты, ТекущийЭлемент)
		КонецЕсли;
		
		// Дополнение анализа активных данных
		АнализАктивныхДанныхФормы_ДополнениеДобавленияДанных(Объекты, ОкноКлиентскогоПриложения, ТекущийЭлемент);
		
	КонецЦикла;
	
	Результат = Новый Структура;
	Результат.Вставить("Формы", Формы);
	Результат.Вставить("Объекты", Объекты);
	Результат.Вставить("НавигационнаяСсылка", НавигационнаяСсылка);
	Возврат Результат;
	
КонецФункции

Процедура АнализАктивныхДанныхФормы_ДобавитьФорму(Формы, АктивноеОкно, ПодчиненноеОкно)
	
	ОписаниеФормы = Новый Структура;
	ОписаниеФормы.Вставить("Значение", ПодчиненноеОкно.УникальныйИдентификатор);
	
	ПредставлениеФормы = ИТК_ИнструментМенеджерФормыКлиент.ПредставлениеФормы(АктивноеОкно, ПодчиненноеОкно);
	ОписаниеФормы.Вставить("Представление", ПредставлениеФормы);
	
	Формы.Добавить(ОписаниеФормы);
	
КонецПроцедуры

Процедура АнализАктивныхДанныхФормы_ДобавлениеДанныхПоля(Объекты, ОкноКлиентскогоПриложения, Элемент)
	
	ВидПоля = Элемент.Вид;
	Если ВидПоля = ВидПоляФормы.ПолеВвода
			ИЛИ ВидПоля = ВидПоляФормы.ПолеНадписи Тогда
			
		ИмяРеквизитаОбъект = ИТК_ОбщийКлиентСервер.ИмяРеквизитаФормыОбъект();
		ДобавленоПолеОбъекта = ДобавитьПолеКоллекцииОбъектаСПопыткой(Объекты, ОкноКлиентскогоПриложения, Элемент.Имя, ИмяРеквизитаОбъект);
		Если НЕ ДобавленоПолеОбъекта Тогда
			ДобавитьПолеКоллекцииОбъектаСПопыткой(Объекты, ОкноКлиентскогоПриложения, Элемент.Имя);
		КонецЕсли;
		
	ИначеЕсли ВидПоля = ВидПоляФормы.ПолеТабличногоДокумента Тогда // Ячейки табличного документа
		
		Попытка
			ТабличныйДокумент = ОкноКлиентскогоПриложения[Элемент.Имя];
		Исключение
			Возврат;
		КонецПопытки;
		
		Попытка
			
			ИмяРеквизитаРасшифровкиОтчета = ИТК_ОбщийКлиентСервер.ИмяРеквизитаРасшифровкиОтчета();
			АдресДанныхРасшифровки = ОкноКлиентскогоПриложения[ИмяРеквизитаРасшифровкиОтчета]; 
			
		Исключение
			АдресДанныхРасшифровки = Неопределено;
		КонецПопытки;
		
		ДоступныДанныеРасшифровки = (АдресДанныхРасшифровки <> Неопределено);
		ЗначенияРасшифровки = ИТК_ТабличныйДокументКлиент.ЗначенияРасшифровокВыделенныхОбластей(ТабличныйДокумент, Элемент, ДоступныДанныеРасшифровки);
		
		Если ДоступныДанныеРасшифровки Тогда
			ЗначенияРасшифровки = ИТК_ТабличныйДокумент.ЗначенияРасшифровокСЗаполнениеРасшифровокСКД(ЗначенияРасшифровки, АдресДанныхРасшифровки);
		КонецЕсли;
		
		// Выделенные области
		Если ЗначенияРасшифровки.Количество() = 1 Тогда
			
			ПервоеЗначение = ЗначенияРасшифровки[0];
			ДобавитьОбъект(Объекты, ПервоеЗначение);
			
		Иначе
			ДобавитьОбъект(Объекты, ЗначенияРасшифровки);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура АнализАктивныхДанныхФормы_ДополнениеДобавленияДанных(Объекты, ОкноКлиентскогоПриложения, Элемент)
	
	Попытка
		ДополнениеАнализа = Вычислить("ОкноКлиентскогоПриложения.ИТК_ВзаимодействиеАнализАктивныхДанных(Элемент)");
	Исключение
		Возврат;
	КонецПопытки;
	
	Для Каждого ДополнительныйОбъект Из ДополнениеАнализа.Объекты Цикл 
		ДобавитьОбъект(Объекты, ДополнительныйОбъект);
	КонецЦикла;
	
КонецПроцедуры

Функция ДобавитьПолеКоллекцииОбъектаСПопыткой(Объекты, Владелец, Имя, ИмяКоллекцииОбъекта = Неопределено)
	
	Попытка
		
		Если ИмяКоллекцииОбъекта = Неопределено Тогда
			Поле = Владелец[Имя];
		Иначе
			
			Попытка
				Поле = Владелец[ИмяКоллекцииОбъекта][Имя];
			Исключение
				
				ДругоеИмя = ИТК_Строки.УдалитьПрефикс(Имя, Владелец.Имя);
				Поле = Владелец[ИмяКоллекцииОбъекта][ДругоеИмя];
				
			КонецПопытки;
			
		КонецЕсли;
		
		Результат = Истина;
		
	Исключение
		
		Поле = Неопределено;
		Результат = Ложь;
		
	КонецПопытки;
	
	ДобавитьОбъект(Объекты, Поле);
	
	Возврат Результат;

КонецФункции

Процедура ДобавитьОбъект(Объекты, Поле)
	
	Если НЕ (ИТК_ТипыКлиентСервер.ЭтоСсылочный(ТипЗнч(Поле))
				ИЛИ ТипЗнч(Поле) = Тип("Массив")) Тогда
		Возврат;
	КонецЕсли;
	
	Попытка 
		ЗначениеЗаполнено = ЗначениеЗаполнено(Поле);
	Исключение
		ЗначениеЗаполнено = Ложь;
	КонецПопытки;
	
	Если НЕ ЗначениеЗаполнено Тогда
		Возврат;
	КонецЕсли;
	
	Если Объекты.Найти(Поле) <> Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Объекты.Добавить(Поле);
	
КонецПроцедуры

#КонецОбласти
