#Область ПрограммныйИнтерфейс

Процедура РезультатПоиска(Параметры, АдресРезультата) Экспорт

	ИменаВТерминахСУБД = (Параметры.ИменаВБазеДанныхВТерминах = "СУБД");
	СтруктураХранения = ПолучитьСтруктуруХраненияБазыДанных( , ИменаВТерминахСУБД);
	
	КонтекстПоиска = Новый Структура;
	
	СтрокаПоиска = НРег(Параметры.Поиск);
	КонтекстПоиска.Вставить("СтрокаПоиска", СтрокаПоиска);
	
	Результат = Новый ДеревоЗначений;
	Результат.Колонки.Добавить("Метаданные", ИТК_ТипыКлиентСервер.ОписаниеКоллекцияИИмяМетаданных());
	Результат.Колонки.Добавить("Таблица", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Поле", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Индекс", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Порядок", ИТК_ТипыКлиентСервер.ОписаниеЧисло());
	КонтекстПоиска.Вставить("Результат", Результат);
	
	ОписанияХранения = ИТК_СтруктураХраненияБазыДанныхПовтИсп.ОписанияХранения();
	ПоляТаблицыХранения = ОписанияХранения.ПоляТаблицы;
	КонтекстПоиска.Вставить("ОписанияХранения", ОписанияХранения);
	
	Для Каждого Строка Из СтруктураХранения Цикл 
		
		Назначение = Строка[ПоляТаблицыХранения.Назначение];
		ИмяТаблицыХранения = Строка[ПоляТаблицыХранения.ИмяТаблицыХранения];
		Таблица = ПредставлениеТаблицы(ИмяТаблицыХранения, Назначение);
		
		Если СтрНайти(НРег(ИмяТаблицыХранения), СтрокаПоиска)
				ИЛИ СтрНайти(НРег(Строка.Метаданные), СтрокаПоиска) Тогда
			ДобавлениеВРезультатПоискаТаблицу(Результат, ИмяТаблицыХранения, Назначение, Строка[ПоляТаблицыХранения.Метаданные]);
		КонецЕсли;
		
		ДобавлениеПолейВРезультатПоиска(КонтекстПоиска, Таблица, Строка[ПоляТаблицыХранения.Поля]);
		ДобавлениеИндексовВРезультатПоиска(КонтекстПоиска, Таблица, Строка[ПоляТаблицыХранения.Индексы]);
		
		Если Результат.Строки.Количество() > МаксимумОтображаемыхСтрок() + 1 Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	Результат.Строки.Сортировать("Порядок");

	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

Функция МаксимумОтображаемыхСтрок() Экспорт
	Возврат 50;
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ДобавлениеВРезультатПоискаТаблицу(Родитель, ИмяТаблицыХранения, Назначение, Метаданные)
	
	НоваяСтрока = Родитель.Строки.Добавить();
	
	Таблица = ПредставлениеТаблицы(ИмяТаблицыХранения, Назначение);
	НоваяСтрока.Таблица = Таблица;
	
	НоваяСтрока.Метаданные = Метаданные;
	
	// Порядок результатов поиска
	ПорядокПоНазначению = ПорядокПоНазначению();
	Порядок = ПорядокПоНазначению.Получить(Назначение);
	Если Порядок = Неопределено Тогда
		Порядок = 100;
	КонецЕсли;
	НоваяСтрока.Порядок = Порядок;
	
	Возврат НоваяСтрока;
	
КонецФункции

Функция ПорядокПоНазначению()
	
	Результат = Новый Соответствие;
	Результат.Вставить("Основная", 10);
	Результат.Вставить("Константа", 20);

	Возврат Результат;

КонецФункции

Функция ДобавлениеВРезультатПоискаПоле(Родитель, Таблица, Поле = Неопределено, Индекс = Неопределено, Метаданные = Неопределено)
	
	НоваяСтрока = Родитель.Строки.Добавить();
	НоваяСтрока.Таблица = Таблица;
	
	Если Поле = Неопределено Тогда
		Поле = "<...>";
	КонецЕсли;
	НоваяСтрока.Поле = Поле;
	
	НоваяСтрока.Индекс = Индекс;
	НоваяСтрока.Метаданные = Метаданные;
	
	Возврат НоваяСтрока;
	
КонецФункции

Процедура ДобавлениеПолейВРезультатПоиска(КонтекстПоиска, Таблица, Поля, Индекс = Неопределено)
	
	ПоляПоля = КонтекстПоиска.ОписанияХранения.ПоляПоля;
	Для Каждого Поле Из Поля Цикл 
		
		ИмяПоляХранения = Поле[ПоляПоля.ИмяПоляХранения];
		Если СтрНайти(НРег(ИмяПоляХранения), КонтекстПоиска.СтрокаПоиска) Тогда
			ДобавлениеВРезультатПоискаПоле(КонтекстПоиска.Результат, Таблица, ИмяПоляХранения, Индекс, Поле[ПоляПоля.Метаданные]);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ДобавлениеИндексовВРезультатПоиска(КонтекстПоиска, Таблица, Индексы);
	
	ПоляИндекса = КонтекстПоиска.ОписанияХранения.ПоляИндекса;
	Для Каждого ПолеИндекса Из Индексы Цикл 
		
		ИмяИндекса = ПолеИндекса[ПоляИндекса.ИмяИндексаХранения];
		Если СтрНайти(НРег(ИмяИндекса), КонтекстПоиска.СтрокаПоиска) Тогда
			ДобавлениеВРезультатПоискаПоле(КонтекстПоиска.Результат, Таблица, , ИмяИндекса);
		КонецЕсли;
		
		ДобавлениеПолейВРезультатПоиска(КонтекстПоиска, Таблица, ПолеИндекса[ПоляИндекса.Поля], ИмяИндекса);
		
	КонецЦикла;
	
КонецПроцедуры

Функция ПредставлениеТаблицы(ИмяТаблицыХранения, Назначение)
	
	Если ЗначениеЗаполнено(Назначение) Тогда
		Результат = СтрШаблон("%1 (%2)", ИмяТаблицыХранения, Назначение);
	Иначе
		Результат = ИмяТаблицыХранения;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

#КонецОбласти
