
#Область ПрограммныйИнтерфейс

Процедура ПолучитьНастройкиОбменаДляТипаОбъекта(Знач МетаданныеИмя, НастройкиОбмена) Экспорт
	
	//Попытка
	//	
	//	//FIXME: костыли, описание 
	//	Если Метаданные.РегистрыСведений.Найти("ПЛ_ДополнительныеКонстанты") <> Неопределено Тогда
	//		
	//		УстановитьПривилегированныйРежим(Истина);
	//		
	//		Запрос = Новый Запрос;
	//		Запрос.Текст = "выбрать ПЕРВЫЕ 1 т.Значение из РегистрСведений.ПЛ_ДополнительныеКонстанты как т
	//						|где т.Имя = &ИмяПараметра";
	//		Запрос.УстановитьПараметр("ИмяПараметра", СтрШаблон("БазыОбмен_%1", МетаданныеИмя));
	//		
	//		Выборка = Запрос.Выполнить().Выбрать();
	//		Если Выборка.Следующий() Тогда
	//			ИменаБаз = СтрРазделить(Выборка.Значение, ",", Ложь);
	//			Для Каждого ЭлементКоллекции Из ИменаБаз Цикл
	//				НоваяСтрока = НастройкиОбмена.Добавить();
	//				НоваяСтрока.БазаДанных = ЭлементКоллекции;
	//				НоваяСтрока.ВыгружатьПриЗаписи = Истина;
	//			КонецЦикла;
	//		КонецЕсли;
	//		
	//	КонецЕсли;
	//	
	//Исключение
	//	ТекстОшибки = ОписаниеОшибки();
	//	ТекстОшибки = СтрШаблон("При получении расширенных настроек для '%1' произошла ошибка:
	//							|%2", МетаданныеИмя, ТекстОшибки);
	//	ЗаписьЖурналаРегистрации("ОДМ_ОбменДанными.ОбщиеНастройки", УровеньЖурналаРегистрации.Ошибка, , , ТекстОшибки);
	//КонецПопытки;
	
КонецПроцедуры

Процедура ПриОбработкеОбъекта(ОбъектДанных) Экспорт
	
	Временно_ДопискиПоДокументам(ОбъектДанных);
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#Область ВсякаяВременнаяШляпаЧтоБыНеЛомалаОсновнуюФункциональность

Процедура Временно_ДопискиПоДокументам(ОбъектДанных)
	
	Попытка
		ОМ_СчетаУчетаВДокументах = ОДМ_ОбщегоНазначения.ОбщийМодуль("СчетаУчетаВДокументах");
		ОМ_БухгалтерскийУчетПереопределяемый = ОДМ_ОбщегоНазначения.ОбщийМодуль("БухгалтерскийУчетПереопределяемый");
	Исключение
		//если нет нужных модулей - то не работает так в этой конфе
		Возврат;
	КонецПопытки;
	
	Если ТипЗнч(ОбъектДанных) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг") Тогда
		
		ОМ_СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаРасчетов(ОбъектДанных);
		
		Для Каждого СтрокаТЧ Из ОбъектДанных.Услуги Цикл
			СчетаУчета = ОМ_БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ОбъектДанных.Организация, СтрокаТЧ.Номенклатура);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СчетаУчета);
			СтрокаТЧ.СчетУчетаНДС = СчетаУчета.СчетУчетаНДС;
			СтрокаТЧ.СчетЗатрат = СчетаУчета.СчетУчета;
			СтрокаТЧ.СчетЗатратНУ = СчетаУчета.СчетУчета;
			СтрокаТЧ.ПодразделениеЗатрат = ОбъектДанных.ПодразделениеОрганизации;
			СтрокаТЧ.СпособУчетаНДС = Перечисления.СпособыУчетаНДС.ПринимаетсяКВычету;
			СтрокаТЧ.Содержание = СтрокаТЧ.Номенклатура.Наименование;
		КонецЦикла;
		
	ИначеЕсли ТипЗнч(ОбъектДанных) = Тип("ДокументОбъект.РеализацияТоваровУслуг") Тогда
		
		ОМ_СчетаУчетаВДокументах.ЗаполнитьСчетаУчетаРасчетов(ОбъектДанных);
		ОбъектДанных.ВидЭлектронногоДокумента = Документы.РеализацияТоваровУслуг.ВидЭлектронногоДокумента(ОбъектДанных);
		
		// Заполняем счета учета и субконто в табличной части
		Для Каждого СтрокаТЧ Из ОбъектДанных.Услуги Цикл
			СчетаУчета = ОМ_БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаНоменклатуры(ОбъектДанных.Организация, СтрокаТЧ.Номенклатура);
			ЗаполнитьЗначенияСвойств(СтрокаТЧ, СчетаУчета);
			СтрокаТЧ.СчетУчетаНДСПоРеализации = СчетаУчета.СчетУчетаНДСПродажи;
			СтрокаТЧ.ПодразделениеОрганизации = ОбъектДанных.ПодразделениеОрганизации;
			НоменклатурнаяГруппаТовара = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(СтрокаТЧ.Номенклатура, "НоменклатурнаяГруппа");
			СтрокаТЧ.Содержание = СтрокаТЧ.Номенклатура.Наименование;
			
			СтрокаТЧ.Субконто = ?(ЗначениеЗаполнено(НоменклатурнаяГруппаТовара), НоменклатурнаяГруппаТовара, Неопределено);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ВсякаяВременнаяШляпаЧтоБыНеЛомалаОсновнуюФункциональность

#Область ТакПисатьНеНадо_Временно

// Функция формирует структуру описания объекта для передачи в другую базу данных.
// Поддерживает справочники и документы, включая ПоступлениеНаРасчетныйСчет и СписаниеСРасчетногоСчета.
// Параметры:
//   ОбъектСсылка - Ссылка на объект (справочник или документ).
//   БазаДанных - Строка, идентификатор базы данных (например, "WebServERP" или "БП").
// Возвращаемое значение:
//   Структура - Описание объекта для передачи.
Функция СформироватьОписание(Знач ОбъектСсылка, Знач БазаДанных) Экспорт
	
	Перем РезультатМетода;
	
	Если ТипЗнч(ОбъектСсылка.Ссылка) = Тип("СправочникСсылка.СтатьиЗатрат") Тогда
		
		// Проверяем, отправляем ли в ERP
		Если Строка(БазаДанных) = "WebServERP" Тогда
			// Логика для ПланВидовХарактеристик.СтатьиРасходов (ERP)
			// Заглушка по отправке
			Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
				Если НЕ ОбъектСсылка.АктуальнаяСтатьяСписания Тогда
					РезультатМетода = Неопределено;
					Возврат РезультатМетода;
				КонецЕсли;
			КонецЕсли;
		
			РезультатМетода = ?(ОбъектСсылка.ЭтоГруппа, 
			Новый Структура("Ссылка, Наименование, Код, Родитель, ЭтоГруппа"),
			Новый Структура("Ссылка, Наименование, Код, Родитель, ТипРасходов, ВариантРаспределенияРасходовУпр, ВариантРаспределенияРасходовРегл, ВариантРаспределенияРасходовНУ, АктуальнаяСтатьяСписания, ОграничитьИспользование, ЭтоГруппа"));
			
			РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
			"ПланВидовХарактеристикСсылка.СтатьиРасходов", 
			Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор()));
			РезультатМетода.Наименование = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Наименование);
			РезультатМетода.Код = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Код);
			РезультатМетода.ЭтоГруппа = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ЭтоГруппа);
			
			Если ЗначениеЗаполнено(ОбъектСсылка.Родитель) Тогда
				РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство(
				"ПланВидовХарактеристикСсылка.СтатьиРасходов", 
				Строка(ОбъектСсылка.Родитель.УникальныйИдентификатор()));
			Иначе
				РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство(
				"ПланВидовХарактеристикСсылка.СтатьиРасходов", "");
			КонецЕсли;
			
			Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
				ТипРасходов = "ПрочиеРасходы";
				РезультатМетода.ТипРасходов = ОДМ_ОбменДанными.УстановитьСвойство(
				"ПеречислениеСсылка.ТипыРасходов", 
				ТипРасходов);
				РезультатМетода.АктуальнаяСтатьяСписания = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.АктуальнаяСтатьяСписания);
				РезультатМетода.ОграничитьИспользование = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.АктуальнаяСтатьяСписания);
				
				Если ОбъектСсылка.АктуальнаяСтатьяСписания Тогда
					РезультатМетода.ВариантРаспределенияРасходовУпр = ОДМ_ОбменДанными.УстановитьСвойство("ПеречислениеСсылка.ВариантыРаспределенияРасходов","НеРаспределять");
					РезультатМетода.ВариантРаспределенияРасходовРегл = ОДМ_ОбменДанными.УстановитьСвойство("ПеречислениеСсылка.ВариантыРаспределенияРасходов","НеРаспределять");
					РезультатМетода.ВариантРаспределенияРасходовНУ = ОДМ_ОбменДанными.УстановитьСвойство("ПеречислениеСсылка.ВариантыРаспределенияРасходов","НеРаспределять");
				КонецЕсли;
				
			КонецЕсли;
			
		Иначе
			// Логика для Справочник.СтатьиЗатрат (БП)
			// Заглушка по отправке
			Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
				Если НЕ ОбъектСсылка.АктуальнаяСтатьяСписания Тогда
					РезультатМетода = Неопределено;
					Возврат РезультатМетода;
				КонецЕсли;
			КонецЕсли;
			
			РезультатМетода = ?(ОбъектСсылка.ЭтоГруппа, 
			Новый Структура("Ссылка, Наименование, Код, Родитель, ЭтоГруппа"),
			Новый Структура("Ссылка, Наименование, Код, Родитель, ВидДеятельностиДляНалоговогоУчетаЗатрат, ВидРасходовНУ, ЭтоГруппа, ИмяПредопределенныхДанных"));
			
			РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.СтатьиЗатрат", 
			Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор()));
			РезультатМетода.Наименование = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Наименование);
			РезультатМетода.Код = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Код);
			РезультатМетода.ЭтоГруппа = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ЭтоГруппа);
			
			Если ЗначениеЗаполнено(ОбъектСсылка.Родитель) Тогда
				РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.СтатьиЗатрат", 
				Строка(ОбъектСсылка.Родитель.УникальныйИдентификатор()));
			Иначе
				РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.СтатьиЗатрат", "");
			КонецЕсли;
			
			Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
				Если ЗначениеЗаполнено(ОбъектСсылка.ВидДеятельностиДляНалоговогоУчетаЗатрат) Тогда
					ИмяЗначения = ПолучитьИмяЗначенияПеречисления(ОбъектСсылка.ВидДеятельностиДляНалоговогоУчетаЗатрат);
					РезультатМетода.ВидДеятельностиДляНалоговогоУчетаЗатрат = ОДМ_ОбменДанными.УстановитьСвойство(
					"ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат", ИмяЗначения);
				Иначе
					РезультатМетода.ВидДеятельностиДляНалоговогоУчетаЗатрат = ОДМ_ОбменДанными.УстановитьСвойство(
					"ПеречислениеСсылка.ВидыДеятельностиДляНалоговогоУчетаЗатрат", "");
				КонецЕсли;
				
				РезультатМетода.ИмяПредопределенныхДанных = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.ИмяПредопределенныхДанных);
				
				Если ЗначениеЗаполнено(ОбъектСсылка.ВидРасходовНУ) Тогда
					ИмяЗначения = ПолучитьИмяЗначенияПеречисления(ОбъектСсылка.ВидРасходовНУ);
					РезультатМетода.ВидРасходовНУ = ОДМ_ОбменДанными.УстановитьСвойство(
					"ПеречислениеСсылка.ВидыРасходовНУ", ИмяЗначения);
				Иначе
					РезультатМетода.ВидРасходовНУ = ОДМ_ОбменДанными.УстановитьСвойство(
					"ПеречислениеСсылка.ВидыРасходовНУ", "");
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
		// Проверяем, что передан контрагент и база данных - 1С БП
	ИначеЕсли ТипЗнч(ОбъектСсылка.Ссылка) = Тип("СправочникСсылка.Контрагенты") Тогда
		
		РезультатМетода = ?(ОбъектСсылка.ЭтоГруппа, 
		Новый Структура("Ссылка, Наименование, Родитель, ЭтоГруппа"),
		Новый Структура("Ссылка, Наименование, Родитель, 
		|ИНН, КПП, НаименованиеПолное, ЭтоГруппа, 
		|Комментарий, ИндивидуальныйПредприниматель,
		|ГосударственныйОрган, КодПоОКПО,
		|ОбособленноеПодразделение,ЮридическоеФизическоеЛицо"));
		
		РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
		"СправочникСсылка.Контрагенты", 
		Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор()));
		РезультатМетода.Наименование = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Наименование);
		РезультатМетода.ЭтоГруппа = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ЭтоГруппа);
		
		Если ЗначениеЗаполнено(ОбъектСсылка.Родитель) Тогда
			РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Контрагенты", 
			Строка(ОбъектСсылка.Родитель.УникальныйИдентификатор()));
		КонецЕсли;
		
		Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
			РезультатМетода.ИНН = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.ИНН);
			РезультатМетода.КПП = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.КПП);
			РезультатМетода.НаименованиеПолное = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.НаименованиеПолное);
			РезультатМетода.Комментарий = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Комментарий);

			РезультатМетода.ИндивидуальныйПредприниматель = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ИндивидуальныйПредприниматель);
			РезультатМетода.ГосударственныйОрган = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ГосударственныйОрган);
			РезультатМетода.КодПоОКПО = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.КодПоОКПО);
			РезультатМетода.ОбособленноеПодразделение = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ОбособленноеПодразделение);
			РезультатМетода.ЮридическоеФизическоеЛицо = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ЮридическоеФизическоеЛицо);
			
			ИмяЗначения = ПолучитьИмяЗначенияПеречисления(ОбъектСсылка.ЮридическоеФизическоеЛицо);
			РезультатМетода.ЮридическоеФизическоеЛицо = ОДМ_ОбменДанными.УстановитьСвойство(
			"ПеречислениеСсылка.ЮридическоеФизическоеЛицо", ИмяЗначения);
			ИспользуемаяИБ = ОДМ_ОбменДанными.ВернутьДополнительнуюКонстанту("MRS_DataExchange_Base_" + БазаДанных);
			
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Ссылка);
			
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
				РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.Контрагенты", СоответствиеВнешнейБазы);
			Иначе
				ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Наименование, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных);
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектСсылка.Ссылка) = Тип("СправочникСсылка.СтатьиДвиженияДенежныхСредств") Тогда
		
		Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
			Если НЕ ОбъектСсылка.MRS_Используется Тогда
				РезультатМетода = Неопределено;
				Возврат РезультатМетода;
			КонецЕсли;
		КонецЕсли;
		
		РезультатМетода = ?(ОбъектСсылка.ЭтоГруппа, 
		Новый Структура("Ссылка, Наименование, Код, Родитель, ЭтоГруппа"),
		Новый Структура("Ссылка, Наименование, Код, Родитель, ЭтоГруппа, ВидДвиженияДенежныхСредств"));
		
		РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
		"СправочникСсылка.СтатьиДвиженияДенежныхСредств", 
		Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор()));
		РезультатМетода.Наименование = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Наименование);
		РезультатМетода.Код = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Код);
		РезультатМетода.ЭтоГруппа = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ЭтоГруппа);
		
		Если ЗначениеЗаполнено(ОбъектСсылка.Родитель) Тогда
			РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.СтатьиДвиженияДенежныхСредств", 
			Строка(ОбъектСсылка.Родитель.УникальныйИдентификатор()));
		Иначе
			РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.СтатьиДвиженияДенежныхСредств", "");
		КонецЕсли;
		
		Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
			
			Если ЗначениеЗаполнено(ОбъектСсылка.ВидДвиженияДенежныхСредств) Тогда
				ИмяЗначения = ПолучитьИмяЗначенияПеречисления(ОбъектСсылка.ВидДвиженияДенежныхСредств);
				РезультатМетода.ВидДвиженияДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
				"ПеречислениеСсылка.ВидыДвиженийДенежныхСредств", ИмяЗначения);
			КонецЕсли;
			
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектСсылка.Ссылка) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
		
		ИспользуемаяИБ = ОДМ_ОбменДанными.ВернутьДополнительнуюКонстанту("MRS_DataExchange_Base_" + БазаДанных);
		
		РезультатМетода = ?(ОбъектСсылка.ЭтоГруппа, 
		Новый Структура("Ссылка, Наименование, ЭтоГруппа"),
		Новый Структура("Ссылка, Наименование, 
		|Номер, Дата, ЭтоГруппа, 
		|Комментарий, Организация, ВидДоговора,
		|Владелец"));
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Ссылка);
		
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ДоговорыКонтрагентов", СоответствиеВнешнейБазы);;
		Иначе
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Наименование, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных);
			Возврат Неопределено;
		КонецЕсли;
		
		РезультатМетода.Наименование = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Наименование);
		
		РезультатМетода.ЭтоГруппа = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ЭтоГруппа);
		
		Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
			РезультатМетода.Номер = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Номер);
			РезультатМетода.Дата = ОДМ_ОбменДанными.УстановитьСвойство("Дата", ОбъектСсылка.Дата);

			РезультатМетода.Комментарий = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Комментарий);
			
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Организация);
			
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
				РезультатМетода.Организация = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.Организации", СоответствиеВнешнейБазы);;
			Иначе
				РезультатМетода.Организация = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Организация.ИНН);
			КонецЕсли;
			
			ИмяЗначения = ПолучитьИмяЗначенияПеречисления(ОбъектСсылка.ВидДоговора);
			РезультатМетода.ВидДоговора = ОДМ_ОбменДанными.УстановитьСвойство(
				"ПеречислениеСсылка.ВидыДоговоровКонтрагентов", ИмяЗначения);
			
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Владелец);
			
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
				РезультатМетода.Владелец = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.Контрагенты", СоответствиеВнешнейБазы);
			Иначе
				ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Наименование, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных);
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектСсылка.Ссылка) = Тип("СправочникСсылка.Банки") Тогда
		
		РезультатМетода = ?(ОбъектСсылка.ЭтоГруппа,
		Новый Структура("Ссылка, Наименование, Код, Родитель, ЭтоГруппа"),
		Новый Структура("Ссылка, Наименование, Код, Родитель, ЭтоГруппа, КоррСчет, Город, Страна"));
		
		РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
		"СправочникСсылка.Банки",
		Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор()));
		РезультатМетода.Наименование = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Наименование);
		РезультатМетода.Код = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Код);
		РезультатМетода.ЭтоГруппа = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ЭтоГруппа);
		
		Если ЗначениеЗаполнено(ОбъектСсылка.Родитель) Тогда
			РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Банки",
			Строка(ОбъектСсылка.Родитель.УникальныйИдентификатор()));
		Иначе
			РезультатМетода.Родитель = ОДМ_ОбменДанными.УстановитьСвойство("СправочникСсылка.Банки", "");
		КонецЕсли;
		
		Если НЕ ОбъектСсылка.ЭтоГруппа Тогда
			РезультатМетода.КоррСчет = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.КоррСчет);
			РезультатМетода.Город = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Город);
			
			Если ЗначениеЗаполнено(ОбъектСсылка.Страна) Тогда
				СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Страна);
				Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
					РезультатМетода.Страна = ОДМ_ОбменДанными.УстановитьСвойство(
					"СправочникСсылка.СтраныМира", СоответствиеВнешнейБазы);
				Иначе
					РезультатМетода.Страна = ОДМ_ОбменДанными.УстановитьСвойство(
					"СправочникСсылка.СтраныМира",
					Строка(ОбъектСсылка.Страна.УникальныйИдентификатор()));
				КонецЕсли;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектСсылка.Ссылка) = Тип("СправочникСсылка.БанковскиеСчета") Тогда
		
		ИспользуемаяИБ = ОДМ_ОбменДанными.ВернутьДополнительнуюКонстанту("MRS_DataExchange_Base_" + БазаДанных);
		
		РезультатМетода = Новый Структура(
			"Ссылка, Наименование, Код, Владелец, Банк, НомерСчета, ВалютаДенежныхСредств, ВидСчета");
		РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
		"СправочникСсылка.БанковскиеСчета",
		Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор()));
		РезультатМетода.Наименование = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Наименование);
		РезультатМетода.Код = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.Код);
		РезультатМетода.НомерСчета = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.НомерСчета);
		РезультатМетода.ВидСчета = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.ВидСчета);
		
		Если ЗначениеЗаполнено(ОбъектСсылка.Банк) Тогда
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Банк);
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
				РезультатМетода.Банк = ОДМ_ОбменДанными.УстановитьСвойство("СправочникСсылка.Банки", СоответствиеВнешнейБазы);
			Иначе
				РезультатМетода.Банк = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.Банки",
				Строка(ОбъектСсылка.Банк.УникальныйИдентификатор()));
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектСсылка.ВалютаДенежныхСредств) Тогда
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.ВалютаДенежныхСредств);
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
				РезультатМетода.ВалютаДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.Валюты", СоответствиеВнешнейБазы);
			Иначе
				РезультатМетода.ВалютаДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.Валюты",
				Строка(ОбъектСсылка.ВалютаДенежныхСредств.УникальныйИдентификатор()));
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектСсылка.Владелец) Тогда
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Владелец);
			Если НЕ ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
				ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Наименование, ТипЗнч(ОбъектСсылка.Владелец), БазаДанных);
				Возврат Неопределено;
			КонецЕсли;
			
			Если ТипЗнч(ОбъектСсылка.Владелец) = Тип("СправочникСсылка.Контрагенты") Тогда
				РезультатМетода.Владелец = ОДМ_ОбменДанными.УстановитьСвойство("СправочникСсылка.Контрагенты", СоответствиеВнешнейБазы);
			ИначеЕсли ТипЗнч(ОбъектСсылка.Владелец) = Тип("СправочникСсылка.Организации") Тогда
				РезультатМетода.Владелец = ОДМ_ОбменДанными.УстановитьСвойство("СправочникСсылка.Организации", СоответствиеВнешнейБазы);
			ИначеЕсли ТипЗнч(ОбъектСсылка.Владелец) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
				РезультатМетода.Владелец = ОДМ_ОбменДанными.УстановитьСвойство("СправочникСсылка.ФизическиеЛица", СоответствиеВнешнейБазы);
			Иначе
				ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Наименование, ТипЗнч(ОбъектСсылка.Владелец), БазаДанных);
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
	ИначеЕсли ТипЗнч(ОбъектСсылка.Ссылка) = Тип("ДокументСсылка.ПоступлениеНаРасчетныйСчет") Тогда
		
		НаименованиеБазыДанных = БазаДанных.Наименование;
		НаименованиеБазыДанныхКонстанты = ОДМ_ОбменДанными.ВернутьДополнительнуюКонстанту("БазаБПИНН-" + ОбъектСсылка.Организация.ИНН);
		
		Если НаименованиеБазыДанных <> НаименованиеБазыДанныхКонстанты Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Логика для документа ПоступлениеНаРасчетныйСчет
		РезультатМетода = Новый Структура("Ссылка, Дата, Организация, ВидОперации, СчетОрганизации, СчетБанк, Контрагент, СчетКонтрагента, 
		|СуммаДокумента, НомерВходящегоДокумента, ДатаВходящегоДокумента, СчетУчетаРасчетовСКонтрагентом, СтатьяДвиженияДенежныхСредств, 
		| НазначениеПлатежа, Комментарий, ДоговорКонтрагента, ВалютаДокумента, РасшифровкаПлатежа, СубконтоКт1, ПометкаУдаления, СуммаУслуг, 
		| ПодразделениеОрганизации, Ответственный, ПодразделениеКт");
		
		РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
		"ДокументСсылка.ПоступлениеНаРасчетныйСчет", 
		Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор()));
		
		ИспользуемаяИБ = ОДМ_ОбменДанными.ВернутьДополнительнуюКонстанту("MRS_DataExchange_Base_" + БазаДанных);
		
		// Организация (ГУИД из регистра соответствия)
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Организация);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.Организация = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Организации", СоответствиеВнешнейБазы);
		Иначе
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Номер, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, ОбъектСсылка.Организация);
			Возврат Неопределено;
		КонецЕсли;
		
		//<<ДеевС 26.11.2025 CPM-323 Обязательные реквизиты: Подразделение, ЦФО, Статья ДДС
		// Если не заполнены, документ не отправляем в обмен
		// Подразделение
		Если Не ЗначениеЗаполнено(ОбъектСсылка.ПодразделениеОрганизации) Тогда
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнено Подразделение");
			Возврат Неопределено;
		КонецЕсли;
		
		// ЦФО
		//Если Не ЗначениеЗаполнено(ОбъектСсылка.ЦФО) Тогда
		//	ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнено ЦФО");
		//	Возврат Неопределено;
		//КонецЕсли;
		
		// Статья ДДС
		Если Не ЗначениеЗаполнено(ОбъектСсылка.СтатьяДвиженияДенежныхСредств) Тогда
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнена статья ДДС");
			Возврат Неопределено;
		КонецЕсли;
		//>>ДеевС 26.11.2025
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.ПодразделениеОрганизации);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.ПодразделениеОрганизации = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ПодразделенияОрганизаций", СоответствиеВнешнейБазы);
			РезультатМетода.ПодразделениеКт = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ПодразделенияОрганизаций", СоответствиеВнешнейБазы);
		КонецЕсли;
		
		// ВидОперации
		ИмяЗначения = ПолучитьИмяЗначенияПеречисления(ОбъектСсылка.ВидОперации);
		РезультатМетода.ВидОперации = ОДМ_ОбменДанными.УстановитьСвойство(
		"ПеречислениеСсылка.ВидыОперацийПоступлениеДенежныхСредств", ИмяЗначения);
		
		// СчетОрганизации
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СчетОрганизации);
		Если НЕ ЗначениеЗаполнено(СоответствиеВнешнейБазы) И ЗначениеЗаполнено(ОбъектСсылка.СчетОрганизации) Тогда
			ОбеспечитьСоответствиеБанковскогоСчета(ОбъектСсылка.СчетОрганизации, БазаДанных);
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СчетОрганизации);
		КонецЕсли;
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.СчетОрганизации = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.БанковскиеСчета", СоответствиеВнешнейБазы);
		Иначе
			РезультатМетода.СчетОрганизации = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.БанковскиеСчета", Строка(ОбъектСсылка.СчетОрганизации.УникальныйИдентификатор()));
		КонецЕсли;
		
		// СчетБанк
		РезультатМетода.СчетБанк = ОДМ_ОбменДанными.УстановитьСвойство(
		"ПланСчетовСсылка.Хозрасчетный", ОбъектСсылка.СчетБанк.Код);
		
		//<<ДеевС 24.11.2025 CPM-331 Передача ответственного
		Если ЗначениеЗаполнено(ОбъектСсылка.Ответственный) Тогда
			РезультатМетода.Ответственный = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Пользователи", ОбъектСсылка.Ответственный.Наименование);
		КонецЕсли;
		//>>ДеевС
		
		// Контрагент (может быть Контрагенты или ФизическиеЛица, ГУИД из регистра)
		Если ЗначениеЗаполнено(ОбъектСсылка.Контрагент) Тогда
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Контрагент);
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) ИЛИ ТипЗнч(ОбъектСсылка.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица")Тогда
				Если ТипЗнч(ОбъектСсылка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
					РезультатМетода.Контрагент = ОДМ_ОбменДанными.УстановитьСвойство(
					"СправочникСсылка.Контрагенты", СоответствиеВнешнейБазы);
				ИначеЕсли ТипЗнч(ОбъектСсылка.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
					//Если нет прямого сопоставления то ищем по ГУИДу ЗУПа
					Если НЕ ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
						ИспользуемаяИБЗУП = Справочники.ВнешниеИнформационныеБазы.НайтиПоКоду("00000007");//1С ЗУП
						СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБЗУП, ОбъектСсылка.Контрагент);
					КонецЕсли;
					
					// Если соответствие так и не нашли, формируем описание физлица "как есть"
					Если НЕ ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
						// Передаем ссылку на физлицо из УХ (GUID уже синхронизирован с ЗУП)
						РезультатМетода.Контрагент = ОДМ_ОбменДанными.УстановитьСвойство(
						"СправочникСсылка.ФизическиеЛица", Строка(ОбъектСсылка.Контрагент.УникальныйИдентификатор()));
					Иначе
						РезультатМетода.Контрагент = ОДМ_ОбменДанными.УстановитьСвойство(
						"СправочникСсылка.ФизическиеЛица", СоответствиеВнешнейБазы);
					КонецЕсли;
				КонецЕсли;
				
				//Если ТипЗнч(ОбъектСсылка.СубконтоДт1) = Тип("СправочникСсылка.Контрагенты") Тогда
				//	РезультатМетода.СубконтоДт1 = ОДМ_ОбменДанными.УстановитьСвойство(
				//	"СправочникСсылка.Контрагенты", СоответствиеВнешнейБазы);
				//КонецЕсли;
			Иначе
				
				ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Номер, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, ОбъектСсылка.Контрагент);
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		// СчетКонтрагента
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СчетКонтрагента);
		Если НЕ ЗначениеЗаполнено(СоответствиеВнешнейБазы) И ЗначениеЗаполнено(ОбъектСсылка.СчетКонтрагента) Тогда
			ОбеспечитьСоответствиеБанковскогоСчета(ОбъектСсылка.СчетКонтрагента, БазаДанных);
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СчетКонтрагента);
		КонецЕсли;
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.СчетКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.БанковскиеСчета", СоответствиеВнешнейБазы);
		Иначе
			РезультатМетода.СчетКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.БанковскиеСчета", Строка(ОбъектСсылка.СчетКонтрагента.УникальныйИдентификатор()));
		КонецЕсли;
		
		// СуммаДокумента
		РезультатМетода.СуммаДокумента = ОДМ_ОбменДанными.УстановитьСвойство("Число", ОбъектСсылка.СуммаДокумента);
		
		РезультатМетода.СуммаУслуг = ОДМ_ОбменДанными.УстановитьСвойство("Число", ОбъектСсылка.СуммаУслуг);
		
		РезультатМетода.НомерВходящегоДокумента = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.НомерВходящегоДокумента);

		// ДатаВходящегоДокумента
		РезультатМетода.ДатаВходящегоДокумента = ОДМ_ОбменДанными.УстановитьСвойство("Дата", ОбъектСсылка.ДатаВходящегоДокумента);
		
		РезультатМетода.Дата = ОДМ_ОбменДанными.УстановитьСвойство("Дата", ОбъектСсылка.Дата);
		// СчетУчетаРасчетовСКонтрагентом
		РезультатМетода.СчетУчетаРасчетовСКонтрагентом = ОДМ_ОбменДанными.УстановитьСвойство(
		"ПланСчетовСсылка.Хозрасчетный", ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом.Код); 
		
		// Логика для СубконтоКт1: если счет в группе 91, заполняем из справочника ПрочиеДоходыИРасходы
		Если ЗначениеЗаполнено(ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом) Тогда
			Если ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом.Код = "91.01" 
				ИЛИ ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом.Код = "91.02" Тогда
				
				Если ЗначениеЗаполнено(ОбъектСсылка.СубконтоКт1) Тогда
					// Использование субконто справочника "ПрочиеДоходыИРасходы"
					РезультатМетода.СубконтоКт1 = ОДМ_ОбменДанными.УстановитьСвойство(
					"СправочникСсылка.ПрочиеДоходыИРасходы", 
					ОбъектСсылка.СубконтоКт1.Наименование
					);
				Иначе
					ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнена статья прочих доходов и расходов");
					Возврат Неопределено;
				КонецЕсли;
			КонецЕсли;
		Иначе
			РезультатМетода.СубконтоКт1 = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектСсылка.СубконтоКт1) Тогда
			ЭтоСчет91 = ЗначениеЗаполнено(ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом)
				И (ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом.Код = "91.01"
				ИЛИ ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом.Код = "91.02");
			Если НЕ ЭтоСчет91 Тогда
				ЗаполнитьСубконтоДляОбмена(
					РезультатМетода,
					"СубконтоКт1",
					ОбъектСсылка.СубконтоКт1,
					ИспользуемаяИБ,
					БазаДанных);
			КонецЕсли;
		КонецЕсли;
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.ДоговорКонтрагента);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.ДоговорКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ДоговорыКонтрагентов", СоответствиеВнешнейБазы);
		Иначе
			РезультатМетода.ДоговорКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ДоговорыКонтрагентов", Строка(ОбъектСсылка.ДоговорКонтрагента.УникальныйИдентификатор()));
		КонецЕсли;
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.ВалютаДокумента);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.ВалютаДокумента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Валюты", СоответствиеВнешнейБазы);
		Иначе
			РезультатМетода.ВалютаДокумента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Валюты", Строка(ОбъектСсылка.ВалютаДокумента.УникальныйИдентификатор()));
		КонецЕсли;
		
		РезультатМетода.СтатьяДвиженияДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
		"СправочникСсылка.СтатьиДвиженияДенежныхСредств", 
		Строка(ОбъектСсылка.СтатьяДвиженияДенежныхСредств.Ссылка.УникальныйИдентификатор()));
		
		РасшифровкаПлатежа = Новый Массив;
		
		Для Каждого СтрокаПлатежа из ОбъектСсылка.РасшифровкаПлатежа Цикл
			
		СтрокаРасшифровкиПлатежа = Новый Структура("ДоговорКонтрагента, СтавкаНДС, СуммаПлатежа, СуммаНДС,
														|СпособПогашенияЗадолженности, СтатьяДвиженияДенежныхСредств,
														|КурсВзаиморасчетов, СуммаВзаиморасчетов,
														|СчетУчетаРасчетовПоАвансам, СчетУчетаРасчетовСКонтрагентом,
														|СуммаУслуг");
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, СтрокаПлатежа.ДоговорКонтрагента);
		
		//<<ДеевС 26.11.2025 CPM-323 Обязательные реквизиты: Подразделение, ЦФО, Статья ДДС
		Если Не ЗначениеЗаполнено(СтрокаПлатежа.ЦФО) Тогда
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнено ЦФО");
			Возврат Неопределено;
		КонецЕсли;
		
		// Статья ДДС
		Если Не ЗначениеЗаполнено(СтрокаПлатежа.СтатьяДвиженияДенежныхСредств) Тогда
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнена статья ДДС");
			Возврат Неопределено;
		КонецЕсли;
		//>>ДеевС 26.11.2025
		
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			СтрокаРасшифровкиПлатежа.ДоговорКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ДоговорыКонтрагентов", СоответствиеВнешнейБазы);
		Иначе
			СтрокаРасшифровкиПлатежа.ДоговорКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ДоговорыКонтрагентов", Строка(ОбъектСсылка.ДоговорКонтрагента.УникальныйИдентификатор()));
		КонецЕсли;
		
		Если ЗначениеЗаполнено(СтрокаПлатежа.СпособПогашенияЗадолженности) Тогда
			СтрокаРасшифровкиПлатежа.СпособПогашенияЗадолженности = ОДМ_ОбменДанными.УстановитьСвойство(
			"ПеречислениеСсылка.СпособыПогашенияЗадолженности", 
			СтрокаПлатежа.СпособПогашенияЗадолженности);
		КонецЕсли;
		
		СтрокаРасшифровкиПлатежа.СуммаПлатежа = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.СуммаПлатежа);
		СтрокаРасшифровкиПлатежа.СуммаУслуг = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.СуммаУслуг);
		СтрокаРасшифровкиПлатежа.СуммаНДС = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.СуммаНДС);
		
		СтрокаРасшифровкиПлатежа.КурсВзаиморасчетов = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.КурсВзаиморасчетов);
		СтрокаРасшифровкиПлатежа.СуммаВзаиморасчетов = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.СуммаВзаиморасчетов);
		
		Если ЗначениеЗаполнено(СтрокаПлатежа.СтавкаНДС) Тогда
			СтрокаРасшифровкиПлатежа.СтавкаНДС = ОДМ_ОбменДанными.УстановитьСвойство(
			"ПеречислениеСсылка.СтавкиНДС", 
			СтрокаПлатежа.СтавкаНДС);
		КонецЕсли;
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, СтрокаПлатежа.СтатьяДвиженияДенежныхСредств);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			СтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.СтатьиДвиженияДенежныхСредств", СоответствиеВнешнейБазы);
		Иначе
			СтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.СтатьиДвиженияДенежныхСредств", Строка(СтрокаПлатежа.СтатьяДвиженияДенежныхСредств.Ссылка.УникальныйИдентификатор()));
		КонецЕсли;
		
		СтрокаРасшифровкиПлатежа.СчетУчетаРасчетовПоАвансам = ОДМ_ОбменДанными.УстановитьСвойство(
		"ПланСчетовСсылка.Хозрасчетный", СтрокаПлатежа.СчетУчетаРасчетовПоАвансам.Код);
		
		СтрокаРасшифровкиПлатежа.СчетУчетаРасчетовСКонтрагентом = ОДМ_ОбменДанными.УстановитьСвойство(
		"ПланСчетовСсылка.Хозрасчетный", СтрокаПлатежа.СчетУчетаРасчетовСКонтрагентом.Код);

		// Добавляем строку в табличную часть
		РасшифровкаПлатежа.Добавить(СтрокаРасшифровкиПлатежа);
	КонецЦикла;
	
	// Устанавливаем табличную часть в результат
	РезультатМетода.РасшифровкаПлатежа = РасшифровкаПлатежа;

		
		// НазначениеПлатежа
		РезультатМетода.НазначениеПлатежа = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.НазначениеПлатежа);
		
		// Комментарий (с префиксом)
		РезультатМетода.Комментарий = ОДМ_ОбменДанными.УстановитьСвойство("Строка", "Синхронизация 1С УХ-БП / " + ОбъектСсылка.Комментарий);
		
		РезультатМетода.ПометкаУдаления = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ПометкаУдаления);
		
	ИначеЕсли ТипЗнч(ОбъектСсылка.Ссылка) = Тип("ДокументСсылка.СписаниеСРасчетногоСчета") Тогда
		
		НаименованиеБазыДанных = БазаДанных.Наименование;
		НаименованиеБазыДанныхКонстанты = ОДМ_ОбменДанными.ВернутьДополнительнуюКонстанту("БазаБПИНН-" + ОбъектСсылка.Организация.ИНН);
		
		Если НаименованиеБазыДанных <> НаименованиеБазыДанныхКонстанты Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		// Логика для документа СписаниеСРасчетногоСчета
		РезультатМетода = Новый Структура("Ссылка, Дата, Организация, ВидОперации, СчетОрганизации, СчетБанк, Контрагент, СчетКонтрагента, 
		|СуммаДокумента, НомерВходящегоДокумента, ДатаВходящегоДокумента, СчетУчетаРасчетовСКонтрагентом, СтатьяДвиженияДенежныхСредств, 
		| НазначениеПлатежа, Комментарий, ДоговорКонтрагента, ВалютаДокумента, РасшифровкаПлатежа, ПометкаУдаления, Налог, ПодразделениеОрганизации,
		| Ответственный, ПодразделениеДт, СубконтоДт1, СубконтоДт2");
		
		РезультатМетода.Ссылка = ОДМ_ОбменДанными.УстановитьСвойство(
		"ДокументСсылка.СписаниеСРасчетногоСчета", 
		Строка(ОбъектСсылка.Ссылка.УникальныйИдентификатор()));
		
		ИспользуемаяИБ = ОДМ_ОбменДанными.ВернутьДополнительнуюКонстанту("MRS_DataExchange_Base_" + БазаДанных);
		
		// Организация (ГУИД из регистра соответствия)
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Организация);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.Организация = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Организации", СоответствиеВнешнейБазы);
		Иначе
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Номер, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, ОбъектСсылка.Организация);
			Возврат Неопределено;
		КонецЕсли;
		
		//<<ДеевС 26.11.2025 CPM-323 Обязательные реквизиты: Подразделение, ЦФО, Статья ДДС
		// Если не заполнены, документ не отправляем в обмен
		// Подразделение
		Если Не ЗначениеЗаполнено(ОбъектСсылка.ПодразделениеОрганизации) Тогда
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнено Подразделение");
			Возврат Неопределено;
		КонецЕсли;
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.ПодразделениеОрганизации);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.ПодразделениеОрганизации = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ПодразделенияОрганизаций", СоответствиеВнешнейБазы);
			РезультатМетода.ПодразделениеДт = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ПодразделенияОрганизаций", СоответствиеВнешнейБазы);
		КонецЕсли;
		
		// ЦФО
		//Если Не ЗначениеЗаполнено(ОбъектСсылка.ЦФО) Тогда
		//	ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнено ЦФО");
		//	Возврат Неопределено;
		//КонецЕсли;
		
		// Статья ДДС
		Если Не ЗначениеЗаполнено(ОбъектСсылка.СтатьяДвиженияДенежныхСредств) Тогда
			ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнена статья ДДС");
			Возврат Неопределено;
		КонецЕсли;
		//>>ДеевС 26.11.2025
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.ПодразделениеОрганизации);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.ПодразделениеОрганизации = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ПодразделенияОрганизаций", СоответствиеВнешнейБазы);
		КонецЕсли;
		
		// ВидОперации (исправлено на правильное перечисление)
		ИмяЗначения = ПолучитьИмяЗначенияПеречисления(ОбъектСсылка.ВидОперации);
		РезультатМетода.ВидОперации = ОДМ_ОбменДанными.УстановитьСвойство(
		"ПеречислениеСсылка.ВидыОперацийСписаниеДенежныхСредств", ИмяЗначения);
		
		// СчетОрганизации
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СчетОрганизации);

		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.СчетОрганизации = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.БанковскиеСчета", СоответствиеВнешнейБазы);
		Иначе
			РезультатМетода.СчетОрганизации = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.БанковскиеСчета", Строка(ОбъектСсылка.СчетОрганизации.УникальныйИдентификатор()));
		КонецЕсли;
		
		// СчетБанк
		РезультатМетода.СчетБанк = ОДМ_ОбменДанными.УстановитьСвойство(
		"ПланСчетовСсылка.Хозрасчетный", ОбъектСсылка.СчетБанк.Код);
		
		//<<ДеевС 24.11.2025 CPM-331 Передача данных по налогу
		Если ЗначениеЗаполнено(ОбъектСсылка.Налог) Тогда
			РезультатМетода.Налог = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ВидыНалоговИПлатежейВБюджет", ОбъектСсылка.Налог.Наименование);
		КонецЕсли;
		//>>ДеевС
		
		//<<ДеевС 24.11.2025 CPM-331 Передача ответственного
		Если ЗначениеЗаполнено(ОбъектСсылка.Ответственный) Тогда
			РезультатМетода.Ответственный = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Пользователи", ОбъектСсылка.Ответственный.Наименование);
		КонецЕсли;
		//>>ДеевС
		
		// Контрагент (может быть Контрагенты или ФизическиеЛица, ГУИД из регистра)
		Если ЗначениеЗаполнено(ОбъектСсылка.Контрагент) Тогда
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.Контрагент);
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) ИЛИ ТипЗнч(ОбъектСсылка.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица")Тогда
				Если ТипЗнч(ОбъектСсылка.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
					РезультатМетода.Контрагент = ОДМ_ОбменДанными.УстановитьСвойство(
					"СправочникСсылка.Контрагенты", СоответствиеВнешнейБазы);
				ИначеЕсли ТипЗнч(ОбъектСсылка.Контрагент) = Тип("СправочникСсылка.ФизическиеЛица") Тогда
					//Если нет прямого сопоставления то ищем по ГУИДу ЗУПа
					Если НЕ ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
						ИспользуемаяИБЗУП = Справочники.ВнешниеИнформационныеБазы.НайтиПоКоду("00000007");//1С ЗУП
						СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБЗУП, ОбъектСсылка.Контрагент);
					КонецЕсли;
					
					// Если соответствие так и не нашли, формируем описание физлица "как есть"
					Если НЕ ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
						РезультатМетода.Контрагент = ОДМ_ОбменДанными.УстановитьСвойство(
						"СправочникСсылка.ФизическиеЛица", Строка(ОбъектСсылка.Контрагент.УникальныйИдентификатор()));
					Иначе
						РезультатМетода.Контрагент = ОДМ_ОбменДанными.УстановитьСвойство(
						"СправочникСсылка.ФизическиеЛица", СоответствиеВнешнейБазы);
					КонецЕсли;
				КонецЕсли;
				
				Если ТипЗнч(ОбъектСсылка.СубконтоДт1) = Тип("СправочникСсылка.Контрагенты") Тогда
					РезультатМетода.СубконтоДт1 = ОДМ_ОбменДанными.УстановитьСвойство(
					"СправочникСсылка.Контрагенты", СоответствиеВнешнейБазы);
				КонецЕсли;
			Иначе
				
				ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка.Номер, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, ОбъектСсылка.Контрагент);
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом) Тогда
			Если ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом.Код = "91.02" Тогда
				
				Если ЗначениеЗаполнено(ОбъектСсылка.СубконтоДт1) Тогда
					// Использование субконто справочника "ПрочиеДоходыИРасходы"
					РезультатМетода.СубконтоДт1 = ОДМ_ОбменДанными.УстановитьСвойство(
					"СправочникСсылка.ПрочиеДоходыИРасходы", 
					ОбъектСсылка.СубконтоДт1.Наименование
					);
				Иначе
					//ЗаписатьСобытиеВЖурналРегистрации(ОбъектСсылка, ТипЗнч(ОбъектСсылка.Ссылка), БазаДанных, , "Не заполнена статья прочих доходов и расходов");
					//Возврат Неопределено;
					РезультатМетода.СубконтоДт1 = Неопределено;
				КонецЕсли;
			КонецЕсли;
		Иначе
			РезультатМетода.СубконтоДт1 = Неопределено;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектСсылка.СубконтоДт1) Тогда
			ЭтоСчет9102 = ЗначениеЗаполнено(ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом)
				И ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом.Код = "91.02";
			Если НЕ ЭтоСчет9102 Тогда
				ЗаполнитьСубконтоДляОбмена(
					РезультатМетода,
					"СубконтоДт1",
					ОбъектСсылка.СубконтоДт1,
					ИспользуемаяИБ,
					БазаДанных);
			КонецЕсли;
		КонецЕсли;
		
		// СчетКонтрагента
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СчетКонтрагента);
		Если НЕ ЗначениеЗаполнено(СоответствиеВнешнейБазы) И ЗначениеЗаполнено(ОбъектСсылка.СчетКонтрагента) Тогда
			ОбеспечитьСоответствиеБанковскогоСчета(ОбъектСсылка.СчетКонтрагента, БазаДанных);
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СчетКонтрагента);
		КонецЕсли;
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.СчетКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.БанковскиеСчета", СоответствиеВнешнейБазы);
		Иначе
			РезультатМетода.СчетКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.БанковскиеСчета", Строка(ОбъектСсылка.СчетКонтрагента.УникальныйИдентификатор()));
		КонецЕсли;
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.ДоговорКонтрагента);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.ДоговорКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ДоговорыКонтрагентов", СоответствиеВнешнейБазы);
			//Если ТипЗнч(ОбъектСсылка.СубконтоДт2) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			//	РезультатМетода.СубконтоДт2 = ОДМ_ОбменДанными.УстановитьСвойство(
			//	"СправочникСсылка.ДоговорыКонтрагентов", СоответствиеВнешнейБазы);
			//КонецЕсли;
		Иначе
			РезультатМетода.ДоговорКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.ДоговорыКонтрагентов", Строка(ОбъектСсылка.ДоговорКонтрагента.УникальныйИдентификатор()));
			//Если ТипЗнч(ОбъектСсылка.СубконтоДт2) = Тип("СправочникСсылка.ДоговорыКонтрагентов") Тогда
			//	РезультатМетода.СубконтоДт2 = ОДМ_ОбменДанными.УстановитьСвойство(
			//	"СправочникСсылка.ДоговорыКонтрагентов", Строка(ОбъектСсылка.ДоговорКонтрагента.УникальныйИдентификатор()));
			//КонецЕсли;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОбъектСсылка.СубконтоДт2) Тогда
			ЗаполнитьСубконтоДляОбмена(
				РезультатМетода,
				"СубконтоДт2",
				ОбъектСсылка.СубконтоДт2,
				ИспользуемаяИБ,
				БазаДанных);
		КонецЕсли;
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.ВалютаДокумента);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.ВалютаДокумента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Валюты", СоответствиеВнешнейБазы);
		Иначе
			РезультатМетода.ВалютаДокумента = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.Валюты", Строка(ОбъектСсылка.ВалютаДокумента.УникальныйИдентификатор()));
		КонецЕсли;
		
		// СуммаДокумента
		РезультатМетода.СуммаДокумента = ОДМ_ОбменДанными.УстановитьСвойство("Число", ОбъектСсылка.СуммаДокумента);
		
		// НомерВходящегоДокумента
		РезультатМетода.НомерВходящегоДокумента = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.НомерВходящегоДокумента);
		
		// ДатаВходящегоДокумента
		РезультатМетода.ДатаВходящегоДокумента = ОДМ_ОбменДанными.УстановитьСвойство("Дата", ОбъектСсылка.ДатаВходящегоДокумента);
		
		РезультатМетода.Дата = ОДМ_ОбменДанными.УстановитьСвойство("Дата", ОбъектСсылка.Дата);
		
		РасшифровкаПлатежа = Новый Массив;
		
		Для Каждого СтрокаПлатежа из ОбъектСсылка.РасшифровкаПлатежа Цикл
			
			СтрокаРасшифровкиПлатежа = Новый Структура("ДоговорКонтрагента, СтавкаНДС, СуммаПлатежа, СуммаНДС,
			|СпособПогашенияЗадолженности, СтатьяДвиженияДенежныхСредств,
			|КурсВзаиморасчетов, СуммаВзаиморасчетов,
			|СчетУчетаРасчетовПоАвансам, СчетУчетаРасчетовСКонтрагентом");
			
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, СтрокаПлатежа.ДоговорКонтрагента);
			
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
				СтрокаРасшифровкиПлатежа.ДоговорКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.ДоговорыКонтрагентов", СоответствиеВнешнейБазы);
			Иначе
				СтрокаРасшифровкиПлатежа.ДоговорКонтрагента = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.ДоговорыКонтрагентов", Строка(ОбъектСсылка.ДоговорКонтрагента.УникальныйИдентификатор()));
			КонецЕсли;
			
			СтрокаРасшифровкиПлатежа.СпособПогашенияЗадолженности = ОДМ_ОбменДанными.УстановитьСвойство(
			"ПеречислениеСсылка.СпособыПогашенияЗадолженности", 
			СтрокаПлатежа.СпособПогашенияЗадолженности);
			СтрокаРасшифровкиПлатежа.СуммаПлатежа = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.СуммаПлатежа);
			СтрокаРасшифровкиПлатежа.СуммаНДС = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.СуммаНДС);
			
			СтрокаРасшифровкиПлатежа.КурсВзаиморасчетов = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.КурсВзаиморасчетов);
			СтрокаРасшифровкиПлатежа.СуммаВзаиморасчетов = ОДМ_ОбменДанными.УстановитьСвойство("Число", СтрокаПлатежа.СуммаВзаиморасчетов);
			
			СтрокаРасшифровкиПлатежа.СтавкаНДС = ОДМ_ОбменДанными.УстановитьСвойство(
			"ПеречислениеСсылка.СтавкиНДС", 
			СтрокаПлатежа.СтавкаНДС);
			
			СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, СтрокаПлатежа.СтатьяДвиженияДенежныхСредств);
			Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
				СтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.СтатьиДвиженияДенежныхСредств", СоответствиеВнешнейБазы);
			Иначе
				СтрокаРасшифровкиПлатежа.СтатьяДвиженияДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
				"СправочникСсылка.СтатьиДвиженияДенежныхСредств", Строка(СтрокаПлатежа.СтатьяДвиженияДенежныхСредств.Ссылка.УникальныйИдентификатор()));
			КонецЕсли;
			
			СтрокаРасшифровкиПлатежа.СчетУчетаРасчетовПоАвансам = ОДМ_ОбменДанными.УстановитьСвойство(
			"ПланСчетовСсылка.Хозрасчетный", СтрокаПлатежа.СчетУчетаРасчетовПоАвансам.Код);
			
			СтрокаРасшифровкиПлатежа.СчетУчетаРасчетовСКонтрагентом = ОДМ_ОбменДанными.УстановитьСвойство(
			"ПланСчетовСсылка.Хозрасчетный", СтрокаПлатежа.СчетУчетаРасчетовСКонтрагентом.Код);
			
			// Добавляем строку в табличную часть
			РасшифровкаПлатежа.Добавить(СтрокаРасшифровкиПлатежа);
		КонецЦикла;
		
		// Устанавливаем табличную часть в результат
		РезультатМетода.РасшифровкаПлатежа = РасшифровкаПлатежа;
		
		
		// СчетУчетаРасчетовСКонтрагентом
		РезультатМетода.СчетУчетаРасчетовСКонтрагентом = ОДМ_ОбменДанными.УстановитьСвойство(
		"ПланСчетовСсылка.Хозрасчетный", ОбъектСсылка.СчетУчетаРасчетовСКонтрагентом.Код);
		
		СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СтатьяДвиженияДенежныхСредств);
		Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
			РезультатМетода.СтатьяДвиженияДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.СтатьиДвиженияДенежныхСредств", СоответствиеВнешнейБазы);
		Иначе
			РезультатМетода.СтатьяДвиженияДенежныхСредств = ОДМ_ОбменДанными.УстановитьСвойство(
			"СправочникСсылка.СтатьиДвиженияДенежныхСредств", Строка(ОбъектСсылка.СтатьяДвиженияДенежныхСредств.Ссылка.УникальныйИдентификатор()));
		КонецЕсли;
		
		//Если ЗначениеЗаполнено(ОбъектСсылка.СтатьяДвиженияДенежныхСредствЗачисление) Тогда
		//	СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектСсылка.СтатьяДвиженияДенежныхСредствЗачисление);
		//	Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
		//		РезультатМетода.СтатьяДвиженияДенежныхСредствЗачисление = ОДМ_ОбменДанными.УстановитьСвойство(
		//		"СправочникСсылка.СтатьиДвиженияДенежныхСредств", СоответствиеВнешнейБазы);
		//	Иначе
		//		РезультатМетода.СтатьяДвиженияДенежныхСредствЗачисление = ОДМ_ОбменДанными.УстановитьСвойство(
		//		"СправочникСсылка.СтатьиДвиженияДенежныхСредств", Строка(ОбъектСсылка.СтатьяДвиженияДенежныхСредствЗачисление.Ссылка.УникальныйИдентификатор()));
		//	КонецЕсли;
		//КонецЕсли;
		
		// НазначениеПлатежа
		РезультатМетода.НазначениеПлатежа = ОДМ_ОбменДанными.УстановитьСвойство("Строка", ОбъектСсылка.НазначениеПлатежа);
		
		// Комментарий (с префиксом)
		РезультатМетода.Комментарий = ОДМ_ОбменДанными.УстановитьСвойство("Строка", "Синхронизация 1С УХ-БП / " + ОбъектСсылка.Комментарий);
		
		РезультатМетода.ПометкаУдаления = ОДМ_ОбменДанными.УстановитьСвойство("Булево", ОбъектСсылка.ПометкаУдаления);
		
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

// Вспомогательная функция для получения имени значения перечисления
Функция ПолучитьИмяЗначенияПеречисления(ЗначениеПеречисления)
	
	Если Не ЗначениеЗаполнено(ЗначениеПеречисления) Тогда
		Возврат "";
	КонецЕсли;
	
	// Получаем метаданные перечисления
	МетаданныеПеречисления = ЗначениеПеречисления.Метаданные();
	ИмяПеречисления = МетаданныеПеречисления.Имя;
	
	// Находим индекс значения в перечислении
	ИндексЗначения = Перечисления[ИмяПеречисления].Индекс(ЗначениеПеречисления);
	
	// Получаем имя значения по индексу
	ИмяЗначения = МетаданныеПеречисления.ЗначенияПеречисления[ИндексЗначения].Имя;
	
	Возврат ИмяЗначения;
	
КонецФункции

// Вспомогательная функция для получения имени значения перечисления
Функция ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ОбъектТекущейИБ)
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"
	|ВЫБРАТЬ
	|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектВнешнейИБ КАК ОбъектВнешнейИБ,
	|	СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ КАК ИспользуемаяИБ
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
	|ГДЕ
	|	СоответствиеОбъектовТекущейИВнешнихИБ.ОбъектТекущейИБ = &ОбъектТекущейИБ
	|	И СоответствиеОбъектовТекущейИВнешнихИБ.ИспользуемаяИБ = &ИспользуемаяИБ
	|";
	
	Запрос.УстановитьПараметр("ИспользуемаяИБ", ИспользуемаяИБ);
	Запрос.УстановитьПараметр("ОбъектТекущейИБ", ОбъектТекущейИБ);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ОбъектВнешнейИБ;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаполнитьСубконтоДляОбмена(РезультатМетода, ИмяПоля, ЗначениеСубконто, ИспользуемаяИБ, БазаДанных)
	
	Если НЕ ЗначениеЗаполнено(ЗначениеСубконто) Тогда
		Возврат;
	КонецЕсли;
	
	ТипСубконто = ТипЗнч(ЗначениеСубконто);
	ТипСубконтоСтрокой = Строка(ТипСубконто);
	
	ЭтоСсылочныйТип = Лев(ТипСубконтоСтрокой, 16) = "СправочникСсылка"
		ИЛИ Лев(ТипСубконтоСтрокой, 14) = "ДокументСсылка"
		ИЛИ Лев(ТипСубконтоСтрокой, 27) = "ПланВидовХарактеристикСсылка";
	
	Если НЕ ЭтоСсылочныйТип Тогда
		Возврат;
	КонецЕсли;
	
	СоответствиеВнешнейБазы = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, ЗначениеСубконто);
	Если ЗначениеЗаполнено(СоответствиеВнешнейБазы) Тогда
		РезультатМетода[ИмяПоля] = ОДМ_ОбменДанными.УстановитьСвойство(ТипСубконтоСтрокой, СоответствиеВнешнейБазы);
		Возврат;
	КонецЕсли;
	
	Если ТипСубконтоСтрокой = "СправочникСсылка.ПрочиеДоходыИРасходы"
		ИЛИ ТипСубконтоСтрокой = "СправочникСсылка.ВидыНалоговИПлатежейВБюджет"
		ИЛИ ТипСубконтоСтрокой = "СправочникСсылка.Пользователи" Тогда
		РезультатМетода[ИмяПоля] = ОДМ_ОбменДанными.УстановитьСвойство(ТипСубконтоСтрокой, ЗначениеСубконто.Наименование);
		Возврат;
	КонецЕсли;
	
	РезультатМетода[ИмяПоля] = ОДМ_ОбменДанными.УстановитьСвойство(
		ТипСубконтоСтрокой,
		Строка(ЗначениеСубконто.УникальныйИдентификатор()));
	
	ЗаписатьСобытиеВЖурналРегистрации(ТипСубконтоСтрокой, ТипСубконто, БазаДанных, ЗначениеСубконто);
	
КонецПроцедуры

Функция ОбеспечитьСоответствиеБанковскогоСчета(Счет, БазаДанных)
	
	Если Не ЗначениеЗаполнено(Счет) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ИспользуемаяИБ = ОДМ_ОбменДанными.ВернутьДополнительнуюКонстанту("MRS_DataExchange_Base_" + БазаДанных);
	СоответствиеСчета = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, Счет);
	Если ЗначениеЗаполнено(СоответствиеСчета) Тогда
		Возврат Истина;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Счет.Банк) Тогда
		Банк = Счет.Банк;
		СоответствиеБанка = ПолучитьСоответствиеВнешнейБазы(ИспользуемаяИБ, Банк);
		Если НЕ ЗначениеЗаполнено(СоответствиеБанка) Тогда
			ИдентификаторБанка = НайтиИдентификаторБанкаВоВнешнейБазе(Банк, БазаДанных);
			Если НЕ ЗначениеЗаполнено(ИдентификаторБанка) Тогда
				ИдентификаторБанка = ОтправитьОбъектВоВнешнююБазу(Банк, БазаДанных);
			КонецЕсли;
			
			Если ЗначениеЗаполнено(ИдентификаторБанка) Тогда
				ЗаписатьСоответствиеОбъекта(Банк, ИспользуемаяИБ, БазаДанных, ИдентификаторБанка, "Банки");
			Иначе
				Возврат Ложь;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	ИдентификаторСчета = ОтправитьОбъектВоВнешнююБазу(Счет, БазаДанных);
	Если НЕ ЗначениеЗаполнено(ИдентификаторСчета) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ЗаписатьСоответствиеОбъекта(Счет, ИспользуемаяИБ, БазаДанных, ИдентификаторСчета, "БанковскиеСчета");
	Возврат Истина;
	
КонецФункции

Функция НайтиИдентификаторБанкаВоВнешнейБазе(Банк, БазаДанных)
	
	Если НЕ ЗначениеЗаполнено(Банк) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОписаниеЗапроса = ОДМ_ОбменДанными.Конструктор_ОписаниеЗапросаВнешнейБазы();
	ВнешнийИнтерфейс = ОДМ_ОбменДанными.Конструктор_ВнешнийИнтерфейс();
	ВнешнийИнтерфейс.ЗаполнитьПараметрыПодключения(БазаДанных);
	
	Если ЗначениеЗаполнено(Банк.Наименование) Тогда
		ОписаниеЗапроса.ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Банки.Ссылка)) КАК ГУИД
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	НЕ Банки.ПометкаУдаления
		|	И Банки.Наименование = &Наименование";
		ОписаниеЗапроса.Параметры.Вставить("Наименование", Банк.Наименование);
		
		Данные = ВнешнийИнтерфейс.ОтправитьЗапросНаСервер(ОписаниеЗапроса, Ложь);
		Если Данные <> Неопределено И Данные.Количество() > 0 Тогда
			Возврат Строка(Данные[0].ГУИД);
		КонецЕсли;
		
		ОписаниеЗапроса.Параметры.Очистить();
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Банк.Код) Тогда
		ОписаниеЗапроса.ТекстЗапроса =
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	ПРЕДСТАВЛЕНИЕ(УНИКАЛЬНЫЙИДЕНТИФИКАТОР(Банки.Ссылка)) КАК ГУИД
		|ИЗ
		|	Справочник.Банки КАК Банки
		|ГДЕ
		|	НЕ Банки.ПометкаУдаления
		|	И Банки.Код = &Код";
		ОписаниеЗапроса.Параметры.Вставить("Код", Банк.Код);
		
		Данные = ВнешнийИнтерфейс.ОтправитьЗапросНаСервер(ОписаниеЗапроса, Ложь);
		Если Данные <> Неопределено И Данные.Количество() > 0 Тогда
			Возврат Строка(Данные[0].ГУИД);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Функция ОтправитьОбъектВоВнешнююБазу(СсылкаОбъекта, БазаДанных)
	
	ОписаниеИсточника = СформироватьОписание(СсылкаОбъекта, БазаДанных);
	Если ОписаниеИсточника = Неопределено Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОтправляемыйПакет = ОДМ_ОбменДанными.Конструктор_ОписаниеПакетаЗаписиОбъекта();
	ОтправляемыйПакет.ОчищатьТабличнуюЧасть = ОДМ_ОбменДанными.УстановитьСвойство("Булево", Истина);
	ОтправляемыйПакет.ВключитьОбменДанными = ОДМ_ОбменДанными.УстановитьСвойство("Булево", Истина);
	ОтправляемыйПакет.Данные = ОписаниеИсточника;
	
	ВнешнийИнтерфейс = ОДМ_ОбменДанными.Конструктор_ВнешнийИнтерфейс();
	ВнешнийИнтерфейс.ЗаполнитьПараметрыПодключения(БазаДанных);
	РезультатМетода = ВнешнийИнтерфейс.ОтправитьОбъектНаСервер(ОтправляемыйПакет, Ложь);
	
	Если РезультатМетода <> Неопределено
		И ТипЗнч(РезультатМетода) = Тип("Структура")
		И РезультатМетода.Свойство("Идентификатор") Тогда
		Возврат РезультатМетода.Идентификатор;
	КонецЕсли;
	
	Возврат Неопределено;
	
КонецФункции

Процедура ЗаписатьСоответствиеОбъекта(ОбъектТекущейИБ, ИспользуемаяИБ, БазаДанных, ИдентификаторБП, ИмяОбъектаМетаданных)
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	СоответствиеВнешнимИБ.Ссылка КАК Ссылка
	|ИЗ
	|	Справочник.СоответствиеВнешнимИБ КАК СоответствиеВнешнимИБ
	|ГДЕ
	|	СоответствиеВнешнимИБ.Владелец = &Владелец
	|	И СоответствиеВнешнимИБ.ИмяОбъектаМетаданных = &ИмяОбъектаМетаданных";
	
	Запрос.УстановитьПараметр("Владелец", ИспользуемаяИБ.ТипБД);
	Запрос.УстановитьПараметр("ИмяОбъектаМетаданных", ИмяОбъектаМетаданных);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Если НЕ Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	НастройкаСоответствия = Выборка.Ссылка;
	
	УстановитьПривилегированныйРежим(Истина);
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Соответствие.ОбъектТекущейИБ КАК ОбъектТекущейИБ,
	|	Соответствие.НастройкаСоответствия КАК НастройкаСоответствия,
	|	Соответствие.ИспользуемаяИБ КАК ИспользуемаяИБ
	|ИЗ
	|	РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК Соответствие
	|ГДЕ
	|	Соответствие.ИспользуемаяИБ = &ИспользуемаяИБ
	|	И Соответствие.НастройкаСоответствия = &НастройкаСоответствия
	|	И Соответствие.ОбъектТекущейИБ = &ОбъектТекущейИБ";
	
	Запрос.УстановитьПараметр("ИспользуемаяИБ", ИспользуемаяИБ);
	Запрос.УстановитьПараметр("НастройкаСоответствия", НастройкаСоответствия);
	Запрос.УстановитьПараметр("ОбъектТекущейИБ", ОбъектТекущейИБ);
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	МенеджерЗаписи = РегистрыСведений.СоответствиеОбъектовТекущейИВнешнихИБ.СоздатьМенеджерЗаписи();
	Если Выборка.Следующий() Тогда
		МенеджерЗаписи.ОбъектТекущейИБ = Выборка.ОбъектТекущейИБ;
		МенеджерЗаписи.НастройкаСоответствия = Выборка.НастройкаСоответствия;
		МенеджерЗаписи.ИспользуемаяИБ = Выборка.ИспользуемаяИБ;
	Иначе
		МенеджерЗаписи.ОбъектТекущейИБ = ОбъектТекущейИБ;
		МенеджерЗаписи.ИспользуемаяИБ = ИспользуемаяИБ;
		МенеджерЗаписи.НастройкаСоответствия = НастройкаСоответствия;
	КонецЕсли;
	
	МенеджерЗаписи.ОбъектВнешнейИБ = Строка(ИдентификаторБП);
	МенеджерЗаписи.НаименованиеОбъектаВнешнейИБ = ОбъектТекущейИБ.Наименование;
	МенеджерЗаписи.НастройкаСоответствияНаименование = НастройкаСоответствия.Наименование;
	МенеджерЗаписи.ТипОбъектаТекущейИБ = ИмяОбъектаМетаданных;
	МенеджерЗаписи.ТипОбъектаВнешнейИБ = ИмяОбъектаМетаданных;
	МенеджерЗаписи.ИмяОбъектаТекущейИБ = ОбъектТекущейИБ.Метаданные().ПолноеИмя();
	МенеджерЗаписи.ИмяОбъектаВнешнейИБ = "Справочник." + ИмяОбъектаМетаданных;
	МенеджерЗаписи.GUIDОбъектаТекущейИБ = Строка(ОбъектТекущейИБ.УникальныйИдентификатор());
	МенеджерЗаписи.Выгружено = Истина;
	МенеджерЗаписи.Записать();
	
	УстановитьПривилегированныйРежим(Ложь);
	
КонецПроцедуры

Процедура ЗаписатьСобытиеВЖурналРегистрации(НаименованиеОбъекта, ТипСправочника = "", БазаДанных = "",ЭлементПоиска = "", ОшибкаВыгрузки = "")
	
	СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий,ДатаСобытия");
	
	СтруктураСобытий.ИмяСобытия 		 = "ОДМ_Обмен";
	СтруктураСобытий.ПредставлениеУровня = "Ошибка";	
	
	Если ЗначениеЗаполнено(ОшибкаВыгрузки) Тогда
		ТекстСообщения = "Не выгружен " + НаименованиеОбъекта+ "в базу " + БазаДанных + ". Ошибка: " + ОшибкаВыгрузки;
	Иначе
		ТекстСообщения = "Нет связи для " + ТипСправочника +" " + НаименованиеОбъекта+ " для базы " + БазаДанных + " элемент " + ЭлементПоиска;
	КонецЕсли;
	
	СтруктураСобытий.Комментарий = ТекстСообщения;
	СобытияДляЖурналаРегистрации = Новый СписокЗначений();
	СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
	
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
	
	ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
	
КонецПроцедуры

#КонецОбласти // ТакПисатьНеНадо_Временно
