
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, Замещение)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДатаСоздания = ТекущаяДатаСеанса();
	
	Для каждого СтрокаНабора Из ЭтотОбъект Цикл
		Если СтрокаНабора.ДатаСоздания = '00010101' Тогда
			СтрокаНабора.ДатаСоздания = ДатаСоздания;
		КонецЕсли;
		
		СтрокаНабора.РазмерПараметры = ОДМ_ВнутренниеМетоды.РазмерХранилищаЗначений(СтрокаНабора.Параметры);
		СтрокаНабора.РазмерРезультат = ОДМ_ВнутренниеМетоды.РазмерХранилищаЗначений(СтрокаНабора.Результат);
		
		ФоновоеЗадание = ФоновыеЗадания.НайтиПоУникальномуИдентификатору(СтрокаНабора.Идентификатор);
		Если Не ФоновоеЗадание = Неопределено Тогда
			Сообщения = ФоновоеЗадание.ПолучитьСообщенияПользователю(Истина);
			Если Сообщения.Количество() > 0 Тогда
				СообщенияСтрокой = СтрСоединить(Сообщения, Символы.ПС);
				СтрокаНабора.ЖурналСообщений = СообщенияСтрокой + Символы.ПС + СтрокаНабора.ЖурналСообщений;
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
