
#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьНастройкиОбменаДляТипаОбъекта(Знач МетаданныеИмя) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если МетаданныеИмя = Неопределено Тогда
		ОбновитьПовторноИспользуемыеЗначения();
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	т.Ссылка КАК База,
	                      |	М.ИмяОбъекта КАК ИмяОбъекта,
	                      |	М.КешироватьЗначения КАК КешироватьЗначения,
	                      |	М.РегистрироватьВУзлеОбмена КАК РегистрироватьВУзлеОбмена,
	                      |	М.ВыгружатьПриЗаписи КАК ВыгружатьПриЗаписи
	                      |ИЗ
	                      |	Справочник.ОДМ_БазыДанных КАК т
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ОДМ_БазыДанных.Метаданные КАК М
	                      |		ПО т.Ссылка = М.Ссылка
	                      |ГДЕ
	                      |	т.ПометкаУдаления = ЛОЖЬ
	                      |	И М.ИмяОбъекта = &МетаданныеИмя
	                      |	И М.Активность = ИСТИНА");
	
	Запрос.УстановитьПараметр("МетаданныеИмя", МетаданныеИмя);
	
	НастройкиОбмена = Запрос.Выполнить().Выгрузить();
	
	ОДМ_ОбменДанными_Переопределяемый.ПолучитьНастройкиОбменаДляТипаОбъекта(МетаданныеИмя, НастройкиОбмена);
	
	Возврат НастройкиОбмена;
	
КонецФункции

Функция ОписаниеТипаВсеСсылкиОбмена() Экспорт
	
	//скопипащено из СтандартныеПодсистемыПовтИсп.ОписаниеТипаВсеСсылки() и упрощено под подсистему обмена
	
	ВсеСсылки = Новый ОписаниеТипов(
					Новый ОписаниеТипов(
						Новый ОписаниеТипов(
							Новый ОписаниеТипов(Справочники.ТипВсеСсылки(), Документы.ТипВсеСсылки().Типы()),
							Перечисления.ТипВсеСсылки().Типы()),
						ПланыВидовХарактеристик.ТипВсеСсылки().Типы()),
					ПланыСчетов.ТипВсеСсылки().Типы()
	);
	
	Возврат ВсеСсылки;
	
КонецФункции

Функция ОписаниеТипаВсеТипыОбмена() Экспорт
	
	КвСтроки = Новый КвалификаторыСтроки(250);
	КвЧисла = Новый КвалификаторыЧисла(20, 5, ДопустимыйЗнак.Любой);
	КвДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	
	ОписаниеТипов = Новый ОписаниеТипов(ОписаниеТипаВсеСсылкиОбмена(), ПримитивныеТипы(), , КвЧисла, КвСтроки, КвДаты);
	
	Возврат ОписаниеТипов;
	
КонецФункции

Функция ПримитивныеТипы() Экспорт
	
	РезультатМетода = Новый Массив;
	
	РезультатМетода.Добавить(Тип("Число"));
	РезультатМетода.Добавить(Тип("Строка"));
	РезультатМетода.Добавить(Тип("Дата"));
	РезультатМетода.Добавить(Тип("Булево"));
	РезультатМетода.Добавить(Тип("Null"));
	
	Возврат РезультатМетода;
	
КонецФункции

// Функция: ПолучитьПараметрыСервера
// Назначение: Возвращает информацию о сервере и конфигурации.
// Возвращаемое значение:
//   Структура - Информация о сервере, платформе, конфигурации и т.д.
Функция ПолучитьПараметрыСервера() Экспорт
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	
	СтруктураПараметры = Новый Структура;
	СтруктураПараметры.Вставить("ТипИсточника",			"Конфигурация 1с");
	СтруктураПараметры.Вставить("Платформа", 			Строка(СистемнаяИнформация.ТипПлатформы));
	СтруктураПараметры.Вставить("Конфигурация", 		Метаданные.Представление());
	СтруктураПараметры.Вставить("ВерсияКонфигурации",	Метаданные.Версия);
	СтруктураПараметры.Вставить("ОперационнаяСистема",	СистемнаяИнформация.ВерсияОС);
	СтруктураПараметры.Вставить("Память",				СистемнаяИнформация.ОперативнаяПамять);
	СтруктураПараметры.Вставить("Процессор",			СистемнаяИнформация.Процессор);
	СтруктураПараметры.Вставить("ИдентификаторКлиента",	Строка(СистемнаяИнформация.ИдентификаторКлиента));
	СтруктураПараметры.Вставить("ВерсияПриложения",		СистемнаяИнформация.ВерсияПриложения);
	СтруктураПараметры.Вставить("СтрокаСоединенияИБ",	СтрокаСоединенияИнформационнойБазы());
	
	СтруктураПараметры.Вставить("ПодсистемаОбмена",		ОДМ_ОбменДанными_ПовтИсп.ОписаниеПодсистемы());
	
	Возврат СтруктураПараметры;
	
КонецФункции

Функция ОписаниеПодсистемы() Экспорт
	
	РезультатМетода = Новый Структура("Версия, УникальныйИдентификатор, ХешСумма", "-", "-");
	
	УстановитьПривилегированныйРежим(Истина);
	
	Отбор = Новый Структура("Имя", "ОДМ_xchg");
	Расширения = РасширенияКонфигурации.Получить(Отбор);
	Если Расширения.Количество() = 1 Тогда
		
		РезультатМетода.Версия					= Расширения[0].Версия;
		РезультатМетода.УникальныйИдентификатор	= Строка(Расширения[0].УникальныйИдентификатор);
		РезультатМетода.ХешСумма				= СтрЗаменить(Расширения[0].ХешСумма, " ", "");
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат РезультатМетода;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

// для расширение ничего не должно знать об объктах корневой базы

#Область МетодыКоторымТутНичегоДелать

Функция ВернутьДополнительнуюКонстанту(Знач Имя) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Параметры.Вставить("Имя", Имя);
	
	мТекст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПЛ_ДополнительныеКонстанты.Имя КАК Имя,
	|	ПЛ_ДополнительныеКонстанты.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ПЛ_ДополнительныеКонстанты КАК ПЛ_ДополнительныеКонстанты
	|ГДЕ
	|	ПЛ_ДополнительныеКонстанты.Имя = &Имя";
	
	Если ТипЗнч(Имя) = Тип("Массив") Тогда
		мТекст = СтрЗаменить(мТекст, "= &Имя", "В (&Имя)");
		Имя = СтрСоединить(Имя, ",");
	КонецЕсли;
	
	СтруктураОтвета = Новый Структура(СтрСоединить(Имя, ","));
	
	Запрос.Текст = мТекст;
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		СтруктураОтвета[Выборка.Имя] = Выборка.Значение;
	КонецЦикла;
	
	Возврат ?(СтруктураОтвета.Количество() = 1, СтруктураОтвета[Имя], СтруктураОтвета);
	
КонецФункции

#КонецОбласти // УстаревшиеМетоды
