
#Область ПрограммныйИнтерфейс

Функция ИнициализацияРедактораJSON_ПриСозданииНаСервере(Форма, СписокПолейJSON) Экспорт
	
	ДобавляемыеРеквизиты = Новый Массив;
	
	НовыйРеквизит = Новый РеквизитФормы("_ОДМ_РедакторыJSON", Новый ОписаниеТипов("СписокЗначений"));
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	
	Для Каждого элК Из СписокПолейJSON Цикл
		ИмяНовогоРеквизита = СтрШаблон("_ОДМ_%1", элК);
		НовыйРеквизит = Новый РеквизитФормы(ИмяНовогоРеквизита, ОДМ_ОбщегоНазначения.ОписаниеТипаСтрока(1000));
		ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);
	КонецЦикла;
	
	//можно подумать для кнопок управления видом просмотра через редакторJSON.setMode(view|code|tree)
	
	Форма.ИзменитьРеквизиты(ДобавляемыеРеквизиты);
	
	Для Каждого элК Из СписокПолейJSON Цикл
		ЭлементФормы = Форма.Элементы[элК];
		
		НовыйЭлемент = СкопироватьЭлементФормы(Форма, ЭлементФормы, ЭлементФормы.Родитель);
		НовыйЭлемент.Вид = ВидПоляФормы.ПолеHTMLДокумента;
		НовыйЭлемент.ПутьКДанным = НовыйЭлемент.Имя;
		
		ЭлементФормы.Видимость = Ложь;
		
		Форма._ОДМ_РедакторыJSON.Добавить(НовыйЭлемент.Имя, элК);
	КонецЦикла;
	
КонецФункции

Функция СкопироватьЭлементФормы(Форма, Знач Оригинал, Знач РодительКопии, Знач ШаблонИмениЭлементаКопии = "_ОДМ_%1") Экспорт

	ТипЭлемента = ТипЗнч(Оригинал);
	
	ИмяЭлементаКопии = СтрШаблон(ШаблонИмениЭлементаКопии, Оригинал.Имя);
	
	Копия = Форма.Элементы.Вставить(ИмяЭлементаКопии, ТипЭлемента, РодительКопии, Оригинал);
	
	Копия.Вид       = Оригинал.Вид;
	Копия.Видимость = Оригинал.Видимость;
	
	Копия.Высота = Оригинал.Высота;
	Копия.Ширина = Оригинал.Ширина;
	Копия.ГоризонтальноеПоложениеВГруппе = Оригинал.ГоризонтальноеПоложениеВГруппе;
	Копия.ВертикальноеПоложениеВГруппе = Оригинал.ВертикальноеПоложениеВГруппе;

	Копия.Доступность                = Оригинал.Доступность;
	Копия.Заголовок                  = Оригинал.Заголовок;
	Копия.ОтображениеПодсказки       = Оригинал.ОтображениеПодсказки;
	
	Если НЕ ТипЭлемента = Тип("КнопкаФормы") Тогда
		Копия.Подсказка			= Оригинал.Подсказка;
	КонецЕсли;
	
	Копия.РастягиватьПоВертикали     = Оригинал.РастягиватьПоВертикали;
	Копия.РастягиватьПоГоризонтали   = Оригинал.РастягиватьПоГоризонтали;

	Если ТипЭлемента = Тип("ГруппаФормы") Тогда

		Если Оригинал.Вид = ВидГруппыФормы.Страницы Тогда
			Копия.ОтображениеСтраниц = Оригинал.ОтображениеСтраниц;
		Иначе
			Копия.ГоризонтальноеПоложениеПодчиненных  = Оригинал.ГоризонтальноеПоложениеПодчиненных;
			Копия.ВертикальноеПоложениеПодчиненных    = Оригинал.ВертикальноеПоложениеПодчиненных;
			Копия.ЦветТекстаЗаголовка   = Оригинал.ЦветТекстаЗаголовка;
			Копия.ШрифтЗаголовка   = Оригинал.ШрифтЗаголовка;
			Копия.ТолькоПросмотр   = Оригинал.ТолькоПросмотр;
			Копия.ЦветФона   = Оригинал.ЦветФона;
			Копия.ОтображатьЗаголовок = Оригинал.ОтображатьЗаголовок;
			Копия.Группировка = Оригинал.Группировка;
			Если Не Оригинал.Вид = ВидГруппыФормы.Страница Тогда
				Копия.Объединенная = Оригинал.Объединенная;
				Копия.СквозноеВыравнивание = Оригинал.СквозноеВыравнивание;
			КонецЕсли;
		КонецЕсли;
		
		Если ОбщегоНазначенияКлиентСервер.ЕстьРеквизитИлиСвойствоОбъекта(Оригинал, "Поведение") и Оригинал.Поведение = ПоведениеОбычнойГруппы.Свертываемая Тогда
			Копия.Поведение = ПоведениеОбычнойГруппы.Свертываемая;
			Копия.ЗаголовокСвернутогоОтображения = Оригинал.ЗаголовокСвернутогоОтображения;
			Копия.ОтображениеУправления = Оригинал.ОтображениеУправления;
		КонецЕсли;

		Для каждого ПодчиненныйЭлемент Из Оригинал.ПодчиненныеЭлементы Цикл
			СкопироватьЭлементФормы(Форма, ПодчиненныйЭлемент, Копия);
		КонецЦикла;

	ИначеЕсли ТипЭлемента = Тип("ПолеФормы") Тогда

		Копия.ЦветТекстаЗаголовка   = Оригинал.ЦветТекстаЗаголовка;
		Копия.ЦветФонаЗаголовка     = Оригинал.ЦветФонаЗаголовка;
		Копия.ШрифтЗаголовка        = Оригинал.ШрифтЗаголовка;
		Копия.ТолькоПросмотр        = Оригинал.ТолькоПросмотр;

		Копия.ГоризонтальноеПоложение  = Оригинал.ГоризонтальноеПоложение;
		Копия.ВертикальноеПоложение    = Оригинал.ВертикальноеПоложение;
		//Копия.ПутьКДанным              = СтрШаблон("%1_%2", Оригинал.ПутьКДанным, Постфикс);
		Копия.ВысотаЗаголовка          = Оригинал.ВысотаЗаголовка;
		Копия.ПоложениеЗаголовка       = Оригинал.ПоложениеЗаголовка;

		Копия.АвтоМаксимальнаяВысота = Оригинал.АвтоМаксимальнаяВысота;
		Копия.МаксимальнаяВысота     = Оригинал.МаксимальнаяВысота;

		Копия.АвтоМаксимальнаяШирина = Оригинал.АвтоМаксимальнаяШирина;
		Копия.МаксимальнаяШирина     = Оригинал.МаксимальнаяШирина;

		Копия.ПоложениеЗаголовка	= Оригинал.ПоложениеЗаголовка;
		Копия.МногострочныйРежим	= Оригинал.МногострочныйРежим;

		Если Не Оригинал.Вид = ВидПоляФормы.ПолеДиаграммы Тогда
			Копия.ЦветРамки           = Оригинал.ЦветРамки;
		КонецЕсли;

		Если Оригинал.Вид = ВидПоляФормы.ПолеНадписи Тогда
			Копия.Шрифт               = Оригинал.Шрифт;
			Копия.ШрифтЗаголовка      = Оригинал.ШрифтЗаголовка;
			Копия.ЦветФона            = Копия.ЦветФона;
			Копия.ЦветТекста          = Копия.ЦветТекста;
		КонецЕсли;
		
		Если Оригинал.Вид = ВидПоляФормы.ПолеВвода Тогда
			СкопироватьДействиеСОригинала(Копия, Оригинал, "ОбработкаВыбора");
		КонецЕсли;

		Если Оригинал.Вид = ВидПоляФормы.ПолеНадписи Или Оригинал.Вид = ВидПоляФормы.ПолеКартинки Тогда
			Копия.Гиперссылка         = Оригинал.Гиперссылка;
			СкопироватьДействиеСОригинала(Копия, Оригинал, "Нажатие");
		ИначеЕсли Оригинал.Вид = ВидПоляФормы.ПолеHTMLДокумента Тогда 
			СкопироватьДействиеСОригинала(Копия, Оригинал, "ПриНажатии");
		КонецЕсли;

		Если Оригинал.Вид = ВидПоляФормы.ПолеДиаграммы Тогда
			СкопироватьДействиеСОригинала(Копия, Оригинал, "Выбор");
			СкопироватьДействиеСОригинала(Копия, Оригинал, "ОбработкаРасшифровки");
			СкопироватьДействиеСОригинала(Копия, Оригинал, "ПриАктивизации");
			
		КонецЕсли;
		
		Если Оригинал.Вид = ВидПоляФормы.ПолеТабличногоДокумента Тогда
			СкопироватьДействиеСОригинала(Копия, Оригинал, "Выбор");
			СкопироватьДействиеСОригинала(Копия, Оригинал, "ПриАктивизации");
			СкопироватьДействиеСОригинала(Копия, Оригинал, "ОбработкаРасшифровки");
			СкопироватьДействиеСОригинала(Копия, Оригинал, "ОбработкаДополнительнойРасшифровки");
		КонецЕсли;

	ИначеЕсли ТипЭлемента = Тип("ДекорацияФормы") Тогда

		Если Оригинал.Вид = ВидДекорацииФормы.Картинка Тогда
			Копия.Картинка       = Оригинал.Картинка;
			Копия.РазмерКартинки = Оригинал.РазмерКартинки;
			Копия.Гиперссылка         = Оригинал.Гиперссылка;
		Иначе
			Копия.ГоризонтальноеПоложение = Оригинал.ГоризонтальноеПоложение;
			Копия.ВертикальноеПоложение   = Оригинал.ВертикальноеПоложение;
			Копия.ВысотаЗаголовка         = Оригинал.ВысотаЗаголовка;
			Копия.ЦветФона                = Оригинал.ЦветФона;
		КонецЕсли;

		Копия.АвтоМаксимальнаяВысота = Оригинал.АвтоМаксимальнаяВысота;
		Копия.МаксимальнаяВысота     = Оригинал.МаксимальнаяВысота;

		Копия.АвтоМаксимальнаяШирина = Оригинал.АвтоМаксимальнаяШирина;
		Копия.МаксимальнаяШирина     = Оригинал.МаксимальнаяШирина;

		Копия.ЦветРамки      = Оригинал.ЦветРамки;
		Копия.Рамка          = Оригинал.Рамка;
		Копия.ЦветТекста     = Оригинал.ЦветТекста;
		Копия.Шрифт          = Оригинал.Шрифт;
		Копия.Гиперссылка    = Оригинал.Гиперссылка;

		СкопироватьДействиеСОригинала(Копия, Оригинал, "Нажатие");
		СкопироватьДействиеСОригинала(Копия, Оригинал, "ОбработкаНавигационнойСсылки");
		
	ИначеЕсли ТипЭлемента = Тип("КнопкаФормы") Тогда
		
		Копия.Фигура			= Оригинал.Фигура;
		Копия.ОтображениеФигуры	= Оригинал.ОтображениеФигуры;
		Копия.Отображение		= Оригинал.Отображение;
		Копия.Картинка			= Оригинал.Картинка;
		
		Копия.ИмяКоманды		= Оригинал.ИмяКоманды;
		
	КонецЕсли;

	Возврат Копия;

КонецФункции

Процедура СкопироватьДействиеСОригинала(Копия, Оригинал, Действие) Экспорт
	
	ИмяОбработчика = Оригинал.ПолучитьДействие(Действие);
	Если Не ПустаяСтрока(ИмяОбработчика) Тогда
		Копия.УстановитьДействие(Действие, ИмяОбработчика);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

