
#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПараметрыПодключения(Знач Отбор) Экспорт
	
	//TODO: подумать над архитектурой и написать. Это чисто шаблон про концепцию
	
	Если НЕ Метаданные.Справочники.Найти("БазыДанных") = Неопределено Тогда
		//подвязываем справочники типовых конфигурация
	Иначе
		ИнтерфейсБазДанных = Справочники.ОДМ_БазыДанных;
	КонецЕсли;
	
	ИнтерфейсБазДанных.ЗаполнитьПараметрыПодключения(ЭтотОбъект, Отбор);
	
КонецПроцедуры

Функция УстановитьХТТПСоединение() Экспорт
	
	РезультатМетода = Новый Структура("Успех, ДополнительнаяИнформация", Ложь, "");
	
	Попытка
		//TODO: проверка на наличие БСП
		//если есть, установка через него - тогда будет возможность блока/разрешения соединений в копиях.
		Соединение = Новый HTTPСоединение(АдресСервера, , Логин, Пароль);
		РезультатМетода.Успех = Истина;
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		РезультатМетода.ДополнительнаяИнформация = ОДМ_ОбменДанными.ПолноеОписаниеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат РезультатМетода;
	
КонецФункции

Функция Пинг() Экспорт
	
	Результат = Новый Структура("Успех, КодСостояния, ДополнительнаяИнформация", Ложь, Неопределено, "");
	
	АдресРесурса = СтрШаблон("/%1/hs/MRS_xchg/ping", ИмяБазы);
	Попытка
		ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса, Заголовки);
		ОтветHTTP = Соединение.Получить(ЗапросHTTP);
		
		ТелоОтвета = ОтветHTTP.ПолучитьТелоКакСтроку();
		
		Результат.Успех = Истина;
		Результат.КодСостояния = ОтветHTTP.КодСостояния;
		Результат.ДополнительнаяИнформация = ОДМ_ОбменДанными.ДесериализоватьJSON(ТелоОтвета);
	Исключение
		ИнформацияОбОшибке = ИнформацияОбОшибке();
		Результат.ДополнительнаяИнформация = ОДМ_ОбменДанными.ПолноеОписаниеОшибки(ИнформацияОбОшибке);
	КонецПопытки;
	
	Возврат Результат;
	
КонецФункции

Функция СостояниеЗадач(Знач Идентификаторы) Экспорт
	
	АдресРесурса = СтрШаблон("/%1/hs/MRS_xchg/job", ИмяБазы);
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	ЗапросHTTP.УстановитьТелоИзСтроки(ОДМ_ОбменДанными.СериализоватьJSON(Идентификаторы));
	ОтветHTTP = ВызватьHTTPМетод("GET", ЗапросHTTP);
	
	ТелоОтветаСтрокой = ОтветHTTP.ПолучитьТелоКакСтроку();
	ТелоОтвета = ОДМ_ОбменДанными.ДесериализоватьJSON(ТелоОтветаСтрокой);
	
	Возврат ТелоОтвета;
	
КонецФункции

Функция ОтправитьЗапросНаСервер(Знач ОписаниеЗапроса, Знач Асинхронно = Ложь) Экспорт
	
	АдресРесурса = СтрШаблон("%1/hs/MRS_xchg/query", ИмяБазы);
	ДополнитьАдресРесурса(АдресРесурса, Асинхронно);
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	ЗапросHTTP.УстановитьТелоИзСтроки(ОДМ_ОбменДанными.СериализоватьJSON(ОписаниеЗапроса));
	ОтветHTTP = ВызватьHTTPМетод("POST", ЗапросHTTP);
	
	ТелоОтветаСтрокой = ОтветHTTP.ПолучитьТелоКакСтроку();
	//<<ДеевС  25.11.2025 Временно, понять почему могут не выгружаться документы
		СтруктураСобытий = Новый Структура("ИмяСобытия, ПредставлениеУровня, Комментарий,ДатаСобытия");
				
				СтруктураСобытий.ИмяСобытия 		 = "ОДМ_Обмен";
				СтруктураСобытий.ПредставлениеУровня = "Информация";	
				СтруктураСобытий.Комментарий 		 = ТелоОтветаСтрокой;
				
				СобытияДляЖурналаРегистрации = Новый СписокЗначений();
				СобытияДляЖурналаРегистрации.Добавить(СтруктураСобытий);
				
				ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СобытияДляЖурналаРегистрации);
	//>>ДеевС
	
	ТелоОтвета = ОДМ_ОбменДанными.ДесериализоватьJSON(ТелоОтветаСтрокой);
		
	Если Асинхронно и ТипЗнч(ТелоОтвета) = Тип("Структура") и ТелоОтвета.Свойство("Идентификатор") Тогда
		РезультатМетода = ТелоОтвета;
	Иначе
		РезультатМетода = СкомпоноватьРезультатЗапроса(ОписаниеЗапроса, ТелоОтвета);
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

Функция РезультатЗапроса(Знач Идентификатор) Экспорт
	
	ДанныеЗадачи = СостояниеЗадач(Идентификатор);
	
	Для Каждого Задача Из ДанныеЗадачи Цикл
		Если Задача.Статус = "Выполнен" Тогда
			Задача.Результат = СкомпоноватьРезультатЗапроса(Задача.Параметры, Задача.Результат);
		КонецЕсли;
	КонецЦикла;
	
	Если ДанныеЗадачи.Количество()=1 Тогда
		Возврат ДанныеЗадачи[0];
	Иначе
		Возврат ДанныеЗадачи;
	КонецЕсли;
		
КонецФункции

Функция ОтправитьОбъектНаСервер(Знач ОписаниеОбъекта, Знач Асинхронно = Ложь) Экспорт
	
	АдресРесурса = СтрШаблон("%1/hs/MRS_xchg/object", ИмяБазы);
	ДополнитьАдресРесурса(АдресРесурса, Асинхронно);
	
	ЗапросHTTP = Новый HTTPЗапрос(АдресРесурса, Заголовки);
	ЗапросHTTP.УстановитьТелоИзСтроки(ОДМ_ОбменДанными.СериализоватьJSON(ОписаниеОбъекта));
	ОтветHTTP = ВызватьHTTPМетод("POST", ЗапросHTTP);
	
	ТелоОтветаСтрокой = ОтветHTTP.ПолучитьТелоКакСтроку();
	ТелоОтвета = ОДМ_ОбменДанными.ДесериализоватьJSON(ТелоОтветаСтрокой);
		
	Если Асинхронно и ТипЗнч(ТелоОтвета) = Тип("Структура") и ТелоОтвета.Свойство("Идентификатор") Тогда
		РезультатМетода = ТелоОтвета;
	Иначе
		//сюда гуид?
		РезультатМетода = ТелоОтвета;
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

#Область Конструкторы

Функция Конструктор_Заголовки() Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Заголовки;
	
КонецФункции

#КонецОбласти // Конструкторы

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

Процедура Инициализация() Экспорт
	
	Соединение = Неопределено;
	
	Порт							= 80;
	ИспользоватьАутентификациюОС	= Ложь;
	Заголовки						= Конструктор_Заголовки();
	
КонецПроцедуры

Функция ВызватьHTTPМетод(Знач ИмяМетода = "GET", ЗапросHTTP) Экспорт
	
	//Если Пинг().Успех = Ложь Тогда //TODO: почему-то рвет соединение при пинге :( надо поглядеть что на IIS
		УстановитьХТТПСоединение();
	//КонецЕсли;
	
	//FIXME: из СП: При использоватения метода GET тело запроса на сервер отправлено не будет.
	// поэтому пока так... надо разобраться
	//Если ИмяМетода = "GET" Тогда
	//	ОтветHTTP = Соединение.Получить(ЗапросHTTP);
	//Иначе
		ОтветHTTP = Соединение.ВызватьHTTPМетод(ИмяМетода, ЗапросHTTP);
	//КонецЕсли;
	
	//TODO: иногда, например при разном регистре символов при публикации, IIS перебрасывает на другую страницу - можно предусмотреть и удобно обойти
	//нужен подобный пример для отладки
	Если ОтветHTTP.КодСостояния = 302 Тогда
		ШаблонТекстаОшибки = "Ошибка %1 при выполнении запроса: %2";
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ОтветHTTP.КодСостояния, "обратитесь к разработчику.");
		ВызватьИсключение ТекстОшибки;
		
		//АдресДругойСтраницы = ОтветHTTP.Заголовки.Получить("Location");
		//
		//СтруктураАдреса = ОбщегоНазначенияКлиентСервер.СтруктураURI(АдресВебСервисаКонтактнойИнформации());
		//ПараметрыПодключения.Соединение		= Неопределено;
		//ПараметрыПодключения.АдресСервера	= СтруктураАдреса.Хост;
		//ПараметрыПодключения.Порт			= СтруктураАдреса.Порт;
		//
		//ОтветHTTP = ОтправитьЗапросНаСервер(ПараметрыПодключения, ОписаниеЗапроса, Асинхронно);
	ИначеЕсли НЕ ОтветHTTP.КодСостояния = 200 Тогда
		ШаблонТекстаОшибки = "Ошибка %1 при выполнении запроса: %2";
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ОтветHTTP.КодСостояния, ОтветHTTP.ПолучитьТелоКакСтроку());
		ВызватьИсключение ТекстОшибки;
	КонецЕсли;
	
	Возврат ОтветHTTP;
	
КонецФункции

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область СлужебныеПроцедурыИФункции

Функция СкомпоноватьРезультатЗапроса(ОписаниеЗапроса, Результат)
	
	Если ОДМ_ОбменДанными.ЭтоПакетныйЗапрос(ОписаниеЗапроса) Тогда
		РезультатМетода = Новый Структура;
		Для Каждого КлючИЗначение Из Результат Цикл
			РезультатМетода.Вставить(КлючИЗначение.Ключ, ОДМ_ОбменДанными.МассивСтруктурВТаблицуЗначений(КлючИЗначение.Значение));
		КонецЦикла;
	Иначе
		РезультатМетода = ОДМ_ОбменДанными.МассивСтруктурВТаблицуЗначений(Результат);
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

Процедура ДополнитьАдресРесурса(АдресРесурса, Знач Асинхронно) //TODO: костыль. подумать
	
	Инициатор = Новый Структура("connectionPath, userOS", СтрокаСоединенияИнформационнойБазы(), "R2D2"); //TODO: в повт_исп написать получения пользователя OS службы
	ИнициаторСтрокой = ОДМ_ОбменДанными.СериализоватьJSON(Инициатор);
	АдресРесурса = СтрШаблон("%1?initiator=%2", АдресРесурса, ИнициаторСтрокой);
	
	Если Асинхронно Тогда
		АдресРесурса = СтрШаблон("%1&async=%2", АдресРесурса, Новый УникальныйИдентификатор);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции
