
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ЗаполнитьПараметрыПодключения(ПараметрыПодключения, Знач Отбор) Экспорт
	
	//FIXME: ВСЕ ПЕРЕДЕЛАТЬ
	Если ТипЗнч(Отбор) = Тип("Строка") Тогда
		Отбор = Новый Структура("Наименование", Отбор);
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ первые 2
	                      |	т.Ссылка КАК Ссылка, т.СерверПубликации как АдресСервера, т.ИмяПубликации как ИмяБазы, т.Логин как Логин, т.Пароль как Пароль
	                      |ИЗ
	                      |	Справочник.ОДМ_БазыДанных КАК т
	                      |ГДЕ
	                      |	т.Наименование = &Наименование");
	Запрос.УстановитьПараметр("Наименование", Отбор.Наименование);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Количество() > 1 Тогда
		ВызватьИсключение "отбор по базам данных выдал больше 1го варианта";
	ИначеЕсли Выборка.Количество() = 1 Тогда
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(ПараметрыПодключения, Выборка);
		Возврат;
	КонецЕсли;
	
	//TODO: продумать и написать справочник
	Если Отбор.Наименование = "ERP-AViktorov" Тогда
		ПараметрыПодключения.АдресСервера		= "10.1.32.173";
		ПараметрыПодключения.ИмяБазы			= "ERP-AViktorov";
		ПараметрыПодключения.Логин				= "1С БП КОРП";
		ПараметрыПодключения.Пароль				= "tA7zacaj";		
	ИначеЕсли
		Отбор.Наименование = "owner_rus" Тогда
		ПараметрыПодключения.АдресСервера		= "opl-dc01-1c01";
		ПараметрыПодключения.ИмяБазы			= "owner_rus";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "Owner_Gorizont" Тогда
		ПараметрыПодключения.АдресСервера		= "opl-dc01-1c01";
		ПараметрыПодключения.ИмяБазы			= "Owner_Gorizont";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "WebServ_Mriya_BP" Тогда
		ПараметрыПодключения.АдресСервера		= "opl-dc01-1c01";
		ПараметрыПодключения.ИмяБазы			= "WebServ_Mriya_BP";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "WebServERP" Тогда
		ПараметрыПодключения.АдресСервера		= "opl-dc01-1capp";
		ПараметрыПодключения.ИмяБазы			= "WebServERP";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "Owner_Corp-Deev" Тогда
		ПараметрыПодключения.АдресСервера		= "10.1.32.173";
		ПараметрыПодключения.ИмяБазы			= "Owner_Corp-Deev";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "Owner_Gorizont_Deev" Тогда
		ПараметрыПодключения.АдресСервера		= "10.1.32.173";
		ПараметрыПодключения.ИмяБазы			= "Owner_Gorizont_Deev";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "Owner_Krylan" Тогда
		ПараметрыПодключения.АдресСервера		= "opl-dc01-1c01";
		ПараметрыПодключения.ИмяБазы			= "Owner_Krylan";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "Owner_Ekspresstur" Тогда
		ПараметрыПодключения.АдресСервера		= "opl-dc01-1c01";
		ПараметрыПодключения.ИмяБазы			= "Owner_Ekspresstur";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "OPLDC01-P-1C-Orbita" Тогда
		ПараметрыПодключения.АдресСервера		= "opl-dc01-1c01";
		ПараметрыПодключения.ИмяБазы			= "OPLDC01-P-1C-Orbita";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "UH_DEEV" Тогда
		ПараметрыПодключения.АдресСервера		= "10.1.32.173";
		ПараметрыПодключения.ИмяБазы			= "UH_DEEV";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	ИначеЕсли
		Отбор.Наименование = "UH" Тогда
		ПараметрыПодключения.АдресСервера		= "opl-dc01-1c01";
		ПараметрыПодключения.ИмяБазы			= "UH";
		ПараметрыПодключения.Логин				= "ObmenXchg";
		ПараметрыПодключения.Пароль				= "ObmenXchg123";
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли
