
#Область ПрограммныйИнтерфейс

Процедура ВыполнитьЗапрос(ОписаниеЗадачи) Экспорт
	
	ОписаниеЗадачи.Попытка = ОписаниеЗадачи.Попытка + 1;
	
	ОписаниеЗапроса = ОписаниеЗадачи.Параметры;
	
	Попытка
		
		//TODO: переделать на схему запроса
		Запрос = Новый Запрос(ОписаниеЗапроса.ТекстЗапроса);
		Для Каждого КлючИЗначениеПараметры Из ОписаниеЗапроса.Параметры Цикл
			ИмяПараметра = Строка(КлючИЗначениеПараметры.Ключ);
			ЗначениеПараметра = КлючИЗначениеПараметры.Значение;
			ТипЗначенияПараметра = ТипЗнч(ЗначениеПараметра);
			
			//TODO: значение параметров собирать через единый для всей подсистемы метод сериализации
			Если ИСТИНА
			И	ТипЗначенияПараметра = Тип("Массив")
			И	ЗначениеПараметра.Количество() > 0
			И	ТипЗнч(ЗначениеПараметра[0]) = Тип("Структура")
			Тогда
				ЗначениеПараметра = МассивСтруктурВТаблицуЗначений(ЗначениеПараметра);
			КонецЕсли;
				
			Запрос.Параметры.Вставить(ИмяПараметра, ЗначениеПараметра);
		КонецЦикла;
		
		#Область TODO
		//TODO: подумать нужна ли такая возможность и как экранировать от левых использований
		//АлгоритмВыполнения = "";
		//Если ИСТИНА
		//	И ПараметрыЗапроса.Свойство("ПередВыполнениемЗапроса", АлгоритмВыполнения)
		//	И НЕ ПустаяСтрока(АлгоритмВыполнения)
		//	Тогда
		//	
		//	Выполнить(АлгоритмВыполнения);
		//КонецЕсли;
		#КонецОбласти // TODO
		
		Если ОДМ_ОбменДанными.ЭтоПакетныйЗапрос(ОписаниеЗапроса) Тогда
			ОписаниеЗадачи.Результат = Новый Структура;
			ТаблицыРезультата = ОписаниеЗапроса.ТаблицыРезультата;
			РезультатЗапроса = Запрос.ВыполнитьПакет();
			
			Для Каждого КлючИЗначение Из ТаблицыРезультата Цикл
				ТаблицаЗначений = РезультатЗапроса[КлючИЗначение.Значение].Выгрузить();
				//ОписаниеЗадачи.Результат.Вставить(КлючИЗначение.Ключ, ОДМ_ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений));
				ОписаниеЗадачи.Результат.Вставить(КлючИЗначение.Ключ, ТаблицаЗначений);
			КонецЦикла;
		Иначе
			ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
			//ОписаниеЗадачи.Результат = ОДМ_ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений);
			ОписаниеЗадачи.Результат = ТаблицаЗначений;
		КонецЕсли;
		
		#Область TODO
		//TODO: подумать нужна ли такая возможность и как экранировать от левых использований
		//АлгоритмВыполнения = "";
		//Если ИСТИНА
		//	И ПараметрыЗапроса.Свойство("ПослеПолученияРезультатов", АлгоритмВыполнения)
		//	И НЕ ПустаяСтрока(АлгоритмВыполнения)
		//	Тогда
		//	
		//	Выполнить(АлгоритмВыполнения);
		//КонецЕсли;
		#КонецОбласти // TODO
		
		ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Выполнен;
		УстановитьМоментыДействий(ОписаниеЗадачи);
		РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОписаниеЗадачи.Ошибка = ОписаниеЗадачи.Ошибка + Символы.ПС + ТекстОшибки;
		ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Ошибка;
		РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
		
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

Процедура ЗаписатьОбъект(ОписаниеЗадачи) Экспорт
	
	Перем КэшЗначений;
	
	ОписаниеЗадачи.Результат = Новый Массив;
	ОписаниеЗадачи.Попытка = ОписаниеЗадачи.Попытка + 1;
	
	ОписаниеОбъекта = ОписаниеЗадачи.Параметры.Данные;
	
	Если ТипЗнч(ОписаниеОбъекта) = Тип("Массив") Тогда
		ДанныеКЗаписи = ОписаниеОбъекта;
	Иначе
		ДанныеКЗаписи = Новый Массив;
		ДанныеКЗаписи.Добавить(ОписаниеОбъекта);
	КонецЕсли;
	
	НачатьТранзакцию();
	Попытка
		Для Каждого ЭлементДанных Из ДанныеКЗаписи Цикл
			ОбъектДанных = ПолучитьОбъектПоСвойству(ЭлементДанных);
		
			Для Каждого КлючИЗначение Из ЭлементДанных Цикл
				Если ЛОЖЬ //FIXME: в метод с параметром по типу передплть
				ИЛИ	КлючИЗначение.Ключ = "Ссылка"
				ИЛИ КлючИЗначение.Ключ = "ЭтоГруппа"
				ИЛИ КлючИЗначение.Ключ = "ИмяПредопределенного"
				Тогда
					Продолжить;
				КонецЕсли;
				
				Если ТипЗнч(КлючИЗначение.Значение) = Тип("Массив") Тогда
					Если ОписаниеЗадачи.Параметры.ОчищатьТабличнуюЧасть Тогда
						ОбъектДанных[КлючИЗначение.Ключ].Очистить();
					КонецЕсли;
					Для Каждого СтрокаТабличнойЧасти Из КлючИЗначение.Значение Цикл
						НоваяСтрокаОбъекта = ОбъектДанных[КлючИЗначение.Ключ].Добавить();
						Для Каждого КолонкаТЧ Из СтрокаТабличнойЧасти Цикл
							НоваяСтрокаОбъекта[КолонкаТЧ.Ключ] = ПрочитатьЗначениеСвойства(КолонкаТЧ.Значение, КэшЗначений);
						КонецЦикла;
					КонецЦикла;
				Иначе
					ОбъектДанных[КлючИЗначение.Ключ] = ПрочитатьЗначениеСвойства(КлючИЗначение.Значение, КэшЗначений);
				КонецЕсли;
			КонецЦикла;
			
			ОДМ_ОбменДанными_Переопределяемый.ПриОбработкеОбъекта(ОбъектДанных);
			
			//<< ДеевС 20.11.2025 CPM-321 При интеграции выписок передавать признак проведения/пометка удаления
			//Если ОписаниеЗадачи.Параметры.Проводить Тогда
			//	ОбъектДанных.Записать(РежимЗаписиДокумента.Проведение);
			//ИначеЕсли ОписаниеЗадачи.Параметры.ВключитьОбменДанными Тогда
			//	ОбъектДанных.ОбменДанными.Загрузка = Истина;
			//	ОбъектДанных.Записать();
			//Иначе
			//	ОбъектДанных.Записать();
			//КонецЕсли;
			ЭтоДокумент = ОбщегоНазначения.ЭтоДокумент(ОбъектДанных.Метаданные());
			ЭтоСправочник = ОбщегоНазначения.ЭтоСправочник(ОбъектДанных.Метаданные());
			
			Если ЭтоСправочник Тогда
				// Для справочников простая запись с синхронизацией пометки удаления.
					Если ОписаниеЗадачи.Параметры.ВключитьОбменДанными Тогда
						ОбъектДанных.ОбменДанными.Загрузка = Истина;
						ОбъектДанных.Записать();
					Иначе
						ОбъектДанных.Записать();
					КонецЕсли;
				
			ИначеЕсли ЭтоДокумент Тогда
				// Для документов: синхронизация статусов с нормализацией состояний.
				Если ОписаниеЗадачи.Параметры.Проводить Тогда
					// Синхронизация проведённого статуса: снять пометку, отменить текущее проведение, провести.
					Если ОбъектДанных.ПометкаУдаления Тогда
						ОбъектДанных.ПометкаУдаления = Ложь;
					КонецЕсли;
					Если ОбъектДанных.Проведен Тогда
						ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					КонецЕсли;
					ОбъектДанных.Записать(РежимЗаписиДокумента.Проведение);
					
				Иначе
					// Синхронизация непроведённого статуса: отменить проведение если нужно, записать как есть.
					НужноОтменитьПроведение = ОбъектДанных.Проведен
						И (ОбъектДанных.ПометкаУдаления // Если пометка удаления, обязательно распроводить.
						ИЛИ Истина); // Для синхронизации: если в источнике не проведён, отменить в базе.
					Если НужноОтменитьПроведение Тогда
						ОбъектДанных.Записать(РежимЗаписиДокумента.ОтменаПроведения);
					Иначе
						ОбъектДанных.Записать();
					КонецЕсли;
					
				КонецЕсли;
				
			Иначе
				// Для других типов (регистры и т.д.): стандартная запись.
				ОбъектДанных.Записать();
				
			КонецЕсли;
			//>> ДеевС 20.11.2025
			
			РезультатДанных = Новый Структура("ОписаниеСсылки, Идентификатор", ЭлементДанных.Ссылка, ОбъектДанных.Ссылка.УникальныйИдентификатор());
			ОписаниеЗадачи.Результат.Добавить(РезультатДанных);
		КонецЦикла;
		
		Если ОписаниеЗадачи.Результат.Количество()=1 Тогда
			ОписаниеЗадачи.Результат = ОписаниеЗадачи.Результат[0];
		КонецЕсли;
		
		ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Выполнен;
		УстановитьМоментыДействий(ОписаниеЗадачи);
		РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
		
		ЗафиксироватьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		
		ТекстОшибки = ОписаниеОшибки();
		ОписаниеЗадачи.Ошибка = ОписаниеЗадачи.Ошибка + Символы.ПС + ТекстОшибки;
		ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Ошибка;
		РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
		
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

// Выполняет шаблон интеграции из справочника ОДМ_МетодыИнтеграции.
// Шаблон ищется по коду, переданному в ОписаниеЗадачи.Параметры["Шаблон"].
// Поведение определяется полем ТипШаблона элемента справочника:
//   ЗаписьОбъектов — необязательный BSL-код предобработки, затем ЗаписатьОбъект;
//   Запрос         — текст запроса из поля Шаблон, параметры из тела запроса;
//   Обработчик     — произвольный BSL-код или вызов экспортной процедуры базы.
//
// Параметры:
//   ОписаниеЗадачи - Структура - стандартная структура задачи обмена.
Процедура ВыполнитьПоШаблону(ОписаниеЗадачи) Экспорт
	
	ОписаниеЗадачи.Попытка = ОписаниеЗадачи.Попытка + 1;
	
	КодШаблона = "";
	Если НЕ ОписаниеЗадачи.Параметры.Свойство("Шаблон", КодШаблона)
		ИЛИ ПустаяСтрока(КодШаблона) Тогда
		ВызватьИсключение НСтр("ru='В параметрах вызова отсутствует или пуст ключ ""Шаблон""'");
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	т.Активен    КАК Активен,
	|	т.ТипШаблона КАК ТипШаблона,
	|	т.Шаблон     КАК Шаблон
	|ИЗ
	|	Справочник.ОДМ_МетодыИнтеграции КАК т
	|ГДЕ
	|	т.Код = &Код
	|	И НЕ т.ПометкаУдаления";
	Запрос.УстановитьПараметр("Код", КодШаблона);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='Шаблон интеграции с кодом ""%1"" не найден'"), КодШаблона);
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Выборка.Следующий();
	
	Если НЕ Выборка.Активен Тогда
		ВызватьИсключение СтрШаблон(НСтр("ru='Шаблон интеграции ""%1"" неактивен'"), КодШаблона);
	КонецЕсли;
	
	ТипШаблона   = Выборка.ТипШаблона;
	ТекстШаблона = Выборка.Шаблон;
	
	Попытка
		
		Если ТипШаблона = "ЗаписьОбъектов" Тогда
			
			Если НЕ ПустаяСтрока(ТекстШаблона) Тогда
				Выполнить(ТекстШаблона); // предобработка: маппинг входного JSON в Данные
			КонецЕсли;
			ЗаписатьОбъект(ОписаниеЗадачи);
			
		ИначеЕсли ТипШаблона = "Запрос" Тогда
			
			ОписаниеЗадачи.Параметры.Вставить("ТекстЗапроса", ТекстШаблона);
			ВыполнитьЗапрос(ОписаниеЗадачи);
			
		ИначеЕсли ТипШаблона = "Обработчик" Тогда
			
			Выполнить(ТекстШаблона);
			Если НЕ Перечисления.ОДМ_СтатусыЗадач.ЭтоЗавершенныйСтатус(ОписаниеЗадачи.Статус) Тогда
				ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Выполнен;
			КонецЕсли;
			УстановитьМоментыДействий(ОписаниеЗадачи);
			РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
			
		ИначеЕсли ТипШаблона = "Составной" Тогда
			ВызватьИсключение НСтр("ru='Тип шаблона ""Составной"" не реализован'");
			
		Иначе
			ВызватьИсключение СтрШаблон(НСтр("ru='Неизвестный тип шаблона: ""%1""'"), ТипШаблона);
		КонецЕсли;
		
	Исключение
		ТекстОшибки = ОписаниеОшибки();
		ОписаниеЗадачи.Ошибка = ОписаниеЗадачи.Ошибка + Символы.ПС + ТекстОшибки;
		Если ОписаниеЗадачи.Статус <> Перечисления.ОДМ_СтатусыЗадач.Ошибка Тогда
			ОписаниеЗадачи.Статус = Перечисления.ОДМ_СтатусыЗадач.Ошибка;
			РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
		КонецЕсли;
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
КонецПроцедуры

Функция СостояниеЗадач(Знач СтруктураОтбора) Экспорт
	
	РезультатМетода = Новый Массив;
	
	//TODO: подумать как более красиво обвязать и настроить считываение отборов
	Если ТипЗнч(СтруктураОтбора) = Тип("Строка") Тогда
		СтруктураОтбора = СтрРазделить(СтруктураОтбора, ",");
	КонецЕсли;
	Если ТипЗнч(СтруктураОтбора) = Тип("Массив") Тогда
		МассивИдентификаторов = Новый Массив;
		Для Каждого ЭлементМассива Из СтруктураОтбора Цикл
			МассивИдентификаторов.Добавить(ПолучитьGUIDИзДанных(ЭлементМассива));
		КонецЦикла;
		СтруктураОтбора = Новый Структура("Идентификаторы", МассивИдентификаторов);
	КонецЕсли;
	
	Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 1 РЕГИСТРСВЕДЕНИЙ.ОДМ_ЗадачиОбмена.* ГДЕ Идентификатор В (&Идентификаторы)"); //TODO: в менеджер регистра с переделкой на нормальную реализацию
	Запрос.Параметры.Вставить("Идентификаторы", СтруктураОтбора.Идентификаторы);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		ОписаниеЗадачи = ОДМ_ОбменДанными.Конструктор_ОписаниеЗадачи();
		ЗаполнитьЗначенияСвойств(ОписаниеЗадачи, Выборка, , "Параметры, Результат");
		ОписаниеЗадачи.Параметры = Выборка.Параметры.Получить();
		ОписаниеЗадачи.Результат = Выборка.Результат.Получить();
		
		РезультатМетода.Добавить(ОписаниеЗадачи);
	КонецЕсли;
		
	Возврат РезультатМетода;
	
КонецФункции

#Область Конструкторы

Функция Конструктор_ВнешнийИнтерфейс(Знач ИмяИнтерфейса = "ОДМ_xchg") Экспорт
	
	Попытка
		ВнешнийИнтерфейс = Обработки[ИмяИнтерфейса].Создать();
		ВнешнийИнтерфейс.Инициализация();
	Исключение
		//TODO: подумать а надо ли...
		ВнешнийИнтерфейс = Новый Структура;
		
		ВнешнийИнтерфейс.Вставить("Соединение",								Неопределено);
		ВнешнийИнтерфейс.Вставить("АдресСервера",							"");
		ВнешнийИнтерфейс.Вставить("Порт",									80);
		ВнешнийИнтерфейс.Вставить("ИмяБазы",									"");
		ВнешнийИнтерфейс.Вставить("Логин",									"");
		ВнешнийИнтерфейс.Вставить("Пароль",									"");
		ВнешнийИнтерфейс.Вставить("Токен",									"");
		ВнешнийИнтерфейс.Вставить("ИспользоватьАутентификациюОС",			Ложь);
		ВнешнийИнтерфейс.Вставить("ЗащищенноеСоединение",					Неопределено);
		ВнешнийИнтерфейс.Вставить("Заголовки",								Конструктор_Заголовки());
	КонецПопытки;
	
	Возврат ВнешнийИнтерфейс;
	
КонецФункции

// Конструктор структуры для параметра Запрос, который будет отправляться во внешнюю базу
//
// Возвращаемое значение:
//   Структура:
//     * ТекстЗапроса				- Строка							- текст запроса в нотации внешней базы
//     * Параметры					- Соответствие из КлючИЗначение		- параметры запроса
//       * Ключ							- Строка		- имя параметра
//       * Значение						- Произвольный	- сериализуемое значение
//     * ТаблицыРезультата			- Соответствие из КлючИЗначение		- пустое, если запрос не пакетный
//       * Ключ							- Строка	- имя таблицы
//       * Значение						- Число		- номер результата
//     * ПередВыполнениемЗапроса	- Строка							- выполнить блок кода перед выполнением запроса (TODO, возможно не будет)
//     * ПослеПолученияРезультатов	- Строка							- выполнить блок кода после получания результатов (TODO, возможно не будет)
//
Функция Конструктор_ОписаниеЗапросаВнешнейБазы() Экспорт
	
	ОписаниеЗапроса = Новый Структура;
	
	ОписаниеЗапроса.Вставить("ТекстЗапроса",				"");
	ОписаниеЗапроса.Вставить("Параметры",					Новый Соответствие);
	ОписаниеЗапроса.Вставить("ТаблицыРезультата",			Новый Структура); 		//ключ: номер результата, значение: имя / если не пакетный запрос, тогда пустое
	ОписаниеЗапроса.Вставить("ПередВыполнениемЗапроса",		"");
	ОписаниеЗапроса.Вставить("ПослеПолученияРезультатов",	"");
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

Функция Конструктор_ОписаниеПакетаЗаписиОбъекта() Экспорт
	
	ОписаниеЗапроса = Новый Структура;
	
	ОписаниеЗапроса.Вставить("ВключитьОбменДанными",	Ложь);
	ОписаниеЗапроса.Вставить("Данные",					Новый Соответствие);	//или массив соответствий(?)
	ОписаниеЗапроса.Вставить("ТаблицыРезультата",		Новый Структура); 		//ключ: номер результата, значение: имя / если не пакетный запрос, тогда пустое
	ОписаниеЗапроса.Вставить("ПередИнициализаций",		"");
	ОписаниеЗапроса.Вставить("ПослеЗаписи",				"");
	ОписаниеЗапроса.Вставить("Проводить",				Ложь);
	ОписаниеЗапроса.Вставить("ОчищатьТабличнуюЧасть",	Ложь);
	
	Возврат ОписаниеЗапроса;
	
КонецФункции

//пока не зафиксированная конструкция
Функция Конструктор_ОписаниеЗадачи(Знач Идентификатор = Неопределено) Экспорт
	
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		Идентификатор = ОДМ_ОбменДанными.ПолучитьGUIDИзДанных(Идентификатор);
	Иначе
		Идентификатор = Новый УникальныйИдентификатор;
	КонецЕсли;
	
	ОписаниеЗадачи = Новый Структура;
	
	ОписаниеЗадачи.Вставить("Идентификатор",	Идентификатор);
	ОписаниеЗадачи.Вставить("АсинхронныйВызов",	Ложь);
	ОписаниеЗадачи.Вставить("Метод",			"");
	ОписаниеЗадачи.Вставить("Статус",			"");
	ОписаниеЗадачи.Вставить("Попытка",			0);
	ОписаниеЗадачи.Вставить("Инициатор",		"");
	ОписаниеЗадачи.Вставить("Параметры",		Неопределено);
	ОписаниеЗадачи.Вставить("Результат",		"");
	ОписаниеЗадачи.Вставить("Ошибка",			"");
	ОписаниеЗадачи.Вставить("ДатаСоздания",	'0001-01-01');
	ОписаниеЗадачи.Вставить("МоментСтарта",	'0001-01-01');
	ОписаниеЗадачи.Вставить("МоментФиниша",	'0001-01-01');
	
	Возврат ОписаниеЗадачи;

КонецФункции

#КонецОбласти // Конструкторы

Функция УстановитьСвойство(Знач Тип, Знач Значение) Экспорт
	
	РезультатМетода = Новый Соответствие;
	
	РезультатМетода["Тип"]							= Тип;
	РезультатМетода["Значение"]						= Значение;
	
	Если ИСТИНА
	И ОДМ_ОбщегоНазначения.ЗначениеСсылочногоТипа(Значение)
	ТОГДА
		Попытка
			ИмяСтрокой = ОДМ_ОбщегоНазначения.ИмяТаблицыПоСсылке(Значение);
			Менеджер = ОДМ_ОбщегоНазначения.МенеджерОбъектаПоПолномуИмени(ИмяСтрокой);
			ИмяПредопределенныхДанных = Менеджер.ПолучитьИмяПредопределенного(Значение);
			Если Не ПустаяСтрока(ИмяПредопределенныхДанных) Тогда
				РезультатМетода["ИмяПредопределенныхДанных"] = ИмяПредопределенныхДанных;
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ВерсияПодсистемы() Экспорт
	
	Возврат "0.0.0.1";
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#Область СлужебныйПрограммныйИнтерфейс

Функция ЭтоПакетныйЗапрос(Знач ОписаниеЗапроса) Экспорт
	
	#Если Сервер И НЕ Сервер Тогда
		ОписаниеЗапроса = Новый Структура;
	#КонецЕсли
	
	РезультатМетода = Ложь;
	
	Если ИСТИНА
	И ОписаниеЗапроса.Свойство("ТаблицыРезультата")
	И ТипЗнч(ОписаниеЗапроса.ТаблицыРезультата) = Тип("Структура")
	И ОписаниеЗапроса.ТаблицыРезультата.Количество() > 0
	Тогда
		
		РезультатМетода = Истина;
		
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

// Сериализует объект в формат JSON.
// Входные параметры:
//   Значение - Произвольный - Объект для сериализации.
// Возвращаемое значение:
//   Строка - JSON-строка, представляющая объект.
Функция СериализоватьJSON(Знач Значение) Экспорт
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Значение, , "ПреобразованиеJSON", Вычислить("ОДМ_ОбменДанными"));
	Исключение
		ПутьОшибки = Неопределено;
		ЗначениеОшибочное = ЗаписатьJSON_НайтиПутьОшибочногоЗначения(Значение, ПутьОшибки);
		
		ШаблонТекстаОшибки = "Не смогли выгрузить значение: %1, по пути: %2";
		ТекстОшибки = СтрШаблон(ШаблонТекстаОшибки, ?(ЗначениеОшибочное = Null, "Null", ЗначениеОшибочное), ПутьОшибки);
		
		ВызватьИсключение ТекстОшибки;
	КонецПопытки;
	
	Возврат ЗаписьJSON.Закрыть();
	
КонецФункции

// Десериализует объект в формат JSON
// Входные параметры:
//   Значение - Строка - строка JSON
// Возвращаемое значение:
//   Структура или Соответствие
Функция ДесериализоватьJSON(Знач Значение, Знач ПрочитатьВСоответствие = Ложь) Экспорт
	
	ЧтениеJSONДанных = Новый ЧтениеJSON;
	ЧтениеJSONДанных.УстановитьСтроку(Значение);
	
	РезультатМетода = ПрочитатьJSON(ЧтениеJSONДанных, ПрочитатьВСоответствие, , , "ВосстановлениеJSON", Вычислить("ОДМ_ОбменДанными"));
	
	ЧтениеJSONДанных.Закрыть();
	
	Возврат РезультатМетода;
	
КонецФункции

// Возвращает полное описание ошибки, включая вложенные причины.
// Входные параметры:
//   ИнформацияОбОшибке - ИнформацияОбОшибке - Объект с информацией об ошибке.
// Возвращаемое значение:
//   Строка - Полное описание ошибки.
Функция ПолноеОписаниеОшибки(ИнформацияОбОшибке) Экспорт
	
	Описание = ИнформацияОбОшибке.Описание;
	Если ЗначениеЗаполнено(ИнформацияОбОшибке.НомерСтроки) Тогда
		Описание = СтрШаблон("%1 {%2: %3}", ИнформацияОбОшибке.ИмяМодуля, ИнформацияОбОшибке.НомерСтроки);
	КонецЕсли;
	
	Если ИнформацияОбОшибке.Причина <> Неопределено Тогда
		Описание = СтрШаблон("%1
							|%2", Описание, ПолноеОписаниеОшибки(ИнформацияОбОшибке.Причина));
	КонецЕсли;
	
	Возврат Описание;
	
КонецФункции

// Преобразует массив структур в таблицу значений. Обратная функция ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаЗначений)
//
// Входные параметры:
//   МассивСтруктур - Массив из Структура - Объект для проверки
//     * Ключ							- Строка		- имя колонки
//     * Значение						- Произвольный	- значение
//
// Возвращаемое значение:
//   ТаблицаЗначений - Ошибочное значение или Неопределено, если ошибок нет
//
Функция МассивСтруктурВТаблицуЗначений(МассивСтруктур, Знач СтрогаяТипизация = Истина) Экспорт
	
	РезультатМетода = Новый ТаблицаЗначений;
	
	ТипыКолонок = Новый Соответствие;
	
	Если СтрогаяТипизация Тогда
		Для Каждого ЭлементКоллекции Из МассивСтруктур Цикл
			Для Каждого КлючИЗначение Из ЭлементКоллекции Цикл
				Если ТипыКолонок[КлючИЗначение.Ключ] = Неопределено Тогда
					ТипыКолонок[КлючИЗначение.Ключ] = Новый Массив;
				КонецЕсли;
				
				ТипЗначения = ТипЗнч(КлючИЗначение.Значение);
				Если ТипыКолонок[КлючИЗначение.Ключ].Найти(ТипЗначения) = Неопределено Тогда
					ТипыКолонок[КлючИЗначение.Ключ].Добавить(ТипЗначения);
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЕсли;
	
	Для Каждого ЭлементКоллекции Из МассивСтруктур Цикл
		
		НоваяСтрока = РезультатМетода.Добавить();
		
		Для Каждого КлючИЗначение Из ЭлементКоллекции Цикл
			Если РезультатМетода.Колонки.Найти(КлючИЗначение.Ключ) = Неопределено Тогда
				ТипыКолонки = ТипыКолонок[КлючИЗначение.Ключ];
				Если ТипыКолонки = Неопределено Тогда
					ОписаниеТипаКолонки = ОДМ_ОбменДанными_ПовтИсп.ОписаниеТипаВсеТипыОбмена();
				Иначе
					ОписаниеТипаКолонки = ОписаниеТипаПоМассивуТипов(ТипыКолонки);
				КонецЕсли;
				РезультатМетода.Колонки.Добавить(КлючИЗначение.Ключ, ОписаниеТипаКолонки);
			КонецЕсли;
			//НоваяСтрока[КлючИЗначение.Ключ] = КлючИЗначение.Значение;
		КонецЦикла;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ЭлементКоллекции);
		
	КонецЦикла;
	
	Возврат РезультатМетода;
	
КонецФункции

// Для получения GUID из данных
// Входные параметры:
//   Значение - Произвольный - используется для вычисления УникальногоИдентификатора
Функция ПолучитьGUIDИзДанных(Знач Значение, Знач ВызыватьИсключение = Ложь) Экспорт
	
	ТипЗначения = ТипЗнч(Значение);
	
	Попытка
		Если ТипЗначения = Тип("Строка") Тогда
			Возврат Новый УникальныйИдентификатор(Значение);
		ИначеЕсли ТипЗначения = Тип("УникальныйИдентификатор") Тогда
			Возврат Значение;
		КонецЕсли;
	Исключение
		Если ВызыватьИсключение Тогда
			ВызватьИсключение;
		Иначе
			Возврат Неопределено;
		КонецЕсли;
	КонецПопытки;
	
КонецФункции

#Область Конструкторы

// Устарела
Функция Конструктор_ОписаниеНастроекОбмена() Экспорт
	
	РезультатМетода = Новый ТаблицаЗначений;
	
	РезультатМетода.Колонки.Добавить("БазаДанных");					//TODO: подумать связать регистр ПЛ_, УХ базы и БД расширения
	РезультатМетода.Колонки.Добавить("КешироватьЗначения",			Новый ОписаниеТипов("Булево"));
	РезультатМетода.Колонки.Добавить("РегистрироватьВУзлеОбмена",	Новый ОписаниеТипов("Булево"));
	РезультатМетода.Колонки.Добавить("ВыгружатьПриЗаписи",			Новый ОписаниеТипов("Булево"));
	
	Возврат РезультатМетода;
	
КонецФункции

Функция Конструктор_Заголовки() Экспорт
	
	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", "application/json");
	
	Возврат Заголовки;
	
КонецФункции

#КонецОбласти // Конструкторы

#КонецОбласти // СлужебныйПрограммныйИнтерфейс

#Область ОбработчикиСобытий

// Процедура: мВыгрузкаВJSONНайтиПутьОшибочногоЗначения
// Назначение: Создает задачу обмена для указанного источника и массива баз данных.
// Входные параметры:
//   Ссылка - СправочникСсылка - Ссылка на объект, для которого создается задача.
//   МассивБазДанных - Массив - Массив баз данных, в которые нужно отправить данные.
Процедура ДобавитьЗадачуОбменаПоИБ(Ссылка,МассивБазДанных) Экспорт
	
	СоздатьЗадачуОбмена(Ссылка, Ложь, МассивБазДанных); 

КонецПроцедуры

// Процедура: СоздатьЗадачуОбмена
// Назначение: Создает задачу обмена для указанного источника и массива баз данных.
// Входные параметры:
//   Источник - Произвольный - Объект, для которого создается задача.
//   Отказ - Булево - Флаг, указывающий на отказ от создания задачи.
//   МассивБазДанных - Массив - Массив баз данных, в которые нужно отправить данные.
Процедура СоздатьЗадачуОбмена(Источник, Отказ, МассивБазДанных = "")
	
	ТипИсточника = Источник.Метаданные().Имя;
	Если НЕ ЗначениеЗаполнено(МассивБазДанных) Тогда
		СтрокаБаз = ВернутьДополнительнуюКонстанту("БазыОбмен_" + ТипИсточника);
		Если НЕ ЗначениеЗаполнено(СтрокаБаз) Тогда
			Возврат;
		КонецЕсли;
		МассивБазДанных = СтрРазделить(СтрокаБаз, "|");
	КонецЕсли;
	
	ТекущаяПубликация = ВернутьДополнительнуюКонстанту("ТекущаяВебПубликация");
	ВебСервер = ВернутьДополнительнуюКонстанту("СерверВебПубликаций");
		
	НаборЗадач = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьНаборЗаписей();
	
	СоответствиеБаз = ПолучитьСоответствиеБазИспользования(МассивБазДанных);
	
	СоответствиеОбъектов = ПолучитьСоответствиеОбъектовПоБазам(СоответствиеБаз,Источник);
	
	Для Каждого МестоИспользования Из МассивБазДанных Цикл
		
		ИдентификаторЗадачи =  Новый УникальныйИдентификатор;
		
		Задача = НаборЗадач.Добавить();
		Задача.Идентификатор = ИдентификаторЗадачи;
		Задача.Инициатор =  Строка(Пользователи.ТекущийПользователь());
		Задача.Статус = Перечисления.ОДМ_СтатусыЗадач.Подготовлен;
		Задача.Метод = "Отправить";
		
		Данные = Новый Структура;	
		Инициатор = Новый Структура;
		Получатель = Новый Структура;
		
		Данные.Вставить("TaskID", Строка(ИдентификаторЗадачи)); 
		
		БазаОтправитель = Новый Структура;
		БазаОтправитель.Вставить("server", ВебСервер); 
		БазаОтправитель.Вставить("name", ТекущаяПубликация);     
		БазаОтправитель.Вставить("id", "");
		Инициатор.Вставить("base", БазаОтправитель);
		Инициатор.Вставить("user", Строка(Пользователи.ТекущийПользователь()));
		Инициатор.Вставить("idSettings", "");  
		Данные.Вставить("initiator", Инициатор);
		
		БазаПолучатель = Новый Структура;
		БазаПолучатель.Вставить("server", ВебСервер); 
		БазаПолучатель.Вставить("name", МестоИспользования);     
		БазаПолучатель.Вставить("id", "");
        Получатель.Вставить("base", БазаПолучатель);
		Получатель.Вставить("user", Строка(Пользователи.ТекущийПользователь()));
		Получатель.Вставить("idSettings", "");  
		Данные.Вставить("recipient", Получатель);
		
		Данные.Вставить("action", "object");
		
		ДанныеДляЗаписи = Новый Структура;
		
		ГУИДИсточника = ПолучитьГУИДИзРегистра(СоответствиеОбъектов, Источник.Ссылка, МестоИспользования);
		Если ГУИДИсточника = Неопределено Тогда
			ГУИДИсточника = Строка(Источник.Ссылка.УникальныйИдентификатор());
		КонецЕсли;
		ДанныеДляЗаписи.Вставить("ГУИД", ГУИДИсточника);
		
		ДанныеДляЗаписи.Вставить("Наименование", Источник.Наименование);
		ДанныеДляЗаписи.Вставить("Код", Источник.Код);
		ДанныеДляЗаписи.Вставить("Тип", ТипИсточника);
		
		Если ЗначениеЗаполнено(Источник.Ссылка.Родитель) Тогда
			Родитель = Источник.Ссылка.Родитель;
			
			ГУИДРодителя = ПолучитьГУИДИзРегистра(СоответствиеОбъектов, Родитель, МестоИспользования);
			Если ГУИДРодителя = Неопределено Тогда
				ГУИДРодителя = Строка(Родитель.УникальныйИдентификатор());
			КонецЕсли;
			ДанныеДляЗаписи.Вставить("РодительГУИД", ГУИДРодителя);
			
			ДанныеДляЗаписи.Вставить("РодительНаименование", Родитель.Наименование);
			ДанныеДляЗаписи.Вставить("РодительКод", Родитель.Код);
			ДанныеДляЗаписи.Вставить("РодительТип", Родитель.Метаданные().Имя);
			ДанныеДляЗаписи.Вставить("РодительЭтоГруппа", Родитель.ЭтоГруппа);
		КонецЕсли;
		
		Для Каждого Реквизит Из Источник.Метаданные().Реквизиты Цикл
			ДанныеДляЗаписи.Вставить(Реквизит.Имя, СокрЛП(Источник[Реквизит.Имя]));
		КонецЦикла;
		Данные.Вставить("data", ДанныеДляЗаписи);

		Задача.Параметры = Новый ХранилищеЗначения(Данные);
		
	КонецЦикла;
	
	Если НаборЗадач.Количество() > 0 Тогда
		НаборЗадач.Записать();
	КонецЕсли;
	
КонецПроцедуры

// Процедура: ОтправитьДанныеВБазыПолучателей
// Назначение: Отправляет данные в базы получателей на основе задач из регистра.
Процедура ОтправитьДанныеВБазыПолучателей() Экспорт

    НаборЗадач = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьНаборЗаписей();
    НаборЗадач.Отбор.Метод.Установить("Отправить");
    НаборЗадач.Прочитать();

    Если НаборЗадач.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    СоответствиеБазПолучателей = Новый Соответствие;
	
	//Для Каждого Задача Из НаборЗадач Цикл
	//	Задача.Статус = Перечисления.ОДМ_СтатусыЗадач.Выполняется;
	//	Задача.МоментСтарта = ТекущаяДата();
	//	Задача.Попытка = ?(НЕ ЗначениеЗаполнено(Задача.Попытка), 1, Задача.Попытка + 1);

	//КонецЦикла;
	//НаборЗадач.Записать();

	Для Каждого Задача Из НаборЗадач Цикл
		
		Если Задача.Статус <> Перечисления.ОДМ_СтатусыЗадач.Подготовлен Тогда
			 Продолжить;
		КонецЕсли;
		 
        Параметры = Задача.Параметры.Получить();
        БазаПолучатель = Параметры.recipient.base.name;
		ВебСервер = Параметры.recipient.base.server;
		
        Если СоответствиеБазПолучателей.Получить(БазаПолучатель) = Неопределено Тогда
            СоответствиеБазПолучателей.Вставить(БазаПолучатель, Новый Массив);
        КонецЕсли;

        МассивЗадач = СоответствиеБазПолучателей[БазаПолучатель];
        МассивЗадач.Добавить(Параметры);
	КонецЦикла;

    Для Каждого ЭлементСоответствия Из СоответствиеБазПолучателей Цикл
        БазаПолучатель = ЭлементСоответствия.Ключ;
        МассивЗадач = ЭлементСоответствия.Значение;

		Для Каждого Задача Из НаборЗадач Цикл
			ВнешнийИнтерфейс = ОДМ_ОбменДанными.Конструктор_ВнешнийИнтерфейс();
			ВнешнийИнтерфейс.АдресСервера = ВебСервер;
			ВнешнийИнтерфейс.ИмяБазы = БазаПолучатель;
		
			Если ВнешнийИнтерфейс.ОтправитьДанныеНаСервер(МассивЗадач) Тогда
            	Если Задача.Параметры.recipient.base = БазаПолучатель Тогда
            		Задача.Статус = Перечисления.ОДМ_СтатусыЗадач.Отправлен;
					Задача.МоментФиниша = ТекущаяДата();
            	КонецЕсли;
			КонецЕсли;
		КонецЦикла;
    КонецЦикла;

    НаборЗадач.Записать();

КонецПроцедуры

//// Функция: ОтправитьДанныеНаСервер
//// Назначение: Отправляет данные на сервер по указанному адресу.
//// Входные параметры:
////   ВебСервер - Строка - Адрес веб-сервера.
////   БазаПолучатель - Строка - Имя базы получателя.
////   МассивЗадач - Массив - Массив задач для отправки.
//// Возвращаемое значение:
////   Булево - Истина, если отправка прошла успешно, иначе Ложь.
//Функция ОтправитьДанныеНаСервер(ПараметрыПодключения, МассивЗадач)
//	
//	JSONСтрока = СериализоватьJSON(МассивЗадач);
//	
//	//ПараметрыПодключения = Конструктор_ПараметрыПодключенияВнешнейБазы(БазаПолучатель); //TODO: адрес,логин, пароль, .. - все должно считаться по базе к которой подключаемся - подумать
//	//ПараметрыПодключения.АдресСервера = ВебСервер;                                      //пока отдельно установим
//	УстановитьХТТПСоединение(ПараметрыПодключения);
//	
//	АдресСервиса = СтрШаблон("/%1/hs/ОДМ_xchg/object", ПараметрыПодключения.ИмяБазы);
//	HTTPЗапрос = Новый HTTPЗапрос(АдресСервиса, ПараметрыПодключения.Заголовки);
//	HTTPЗапрос.УстановитьТелоИзСтроки(JSONСтрока);
//	
//	ОтветHTTP = ПараметрыПодключения.Соединение.ОтправитьДляОбработки(HTTPЗапрос);
//	
//	//битОбмен.тсмЗаписьЛогаВходящегоЗапроса(ОтветHTTP, "Ответ_от_" + БазаПолучатель); //TODO  Логирование
//	
//	Если ОтветHTTP.КодСостояния = 200 Тогда
//		Возврат Истина;
//	Иначе
//		Возврат Ложь;
//	КонецЕсли;
//	
//КонецФункции

// Процедура: СоздатьЭлементыСправочникаИзЗадач
// Назначение: Создает элементы справочника на основе данных из задач обмена.
Процедура СоздатьЭлементыСправочникаИзЗадач() Экспорт

    НаборЗадач = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьНаборЗаписей();
    НаборЗадач.Отбор.Метод.Установить("Записать");
    НаборЗадач.Прочитать();

    Если НаборЗадач.Количество() = 0 Тогда
        Возврат;
    КонецЕсли;

    Для Каждого Задача Из НаборЗадач Цикл
        
        Если Задача.Статус <> Перечисления.ОДМ_СтатусыЗадач.Подготовлен Тогда
            Продолжить;
        КонецЕсли;
        
        Параметры = Задача.Параметры.Получить();
        Данные = Параметры.data;
        БазаОтправительСтрокой = Параметры.initiator.base.name;
		БазаОтправитель = ВернутьДополнительнуюКонстанту("ОДМ_DataExchange_Base_" + БазаОтправительСтрокой);

        ТипИсточника = Данные.Тип;

        Если Данные.Свойство("РодительГУИД") Тогда
            Если НЕ Данные.РодительЭтоГруппа Тогда
                РодительГУИД = ПолучитьGUIDИзДанных(Данные.РодительГУИД);
                РодительНаименование = Данные.РодительНаименование;
                РодительКод = Данные.РодительКод;
                РодительТип = Данные.РодительТип;

                Родитель = НайтиЭлементПоГУИД(РодительТип, РодительГУИД);
                Если ЭлементНеНайден(Родитель) Тогда
                    Родитель = НайтиЭлементПоКоду(РодительТип, РодительКод);
                КонецЕсли;
                Если НЕ ЗначениеЗаполнено(Родитель) Тогда
                    Родитель = НайтиЭлементПоНаименованию(РодительТип, РодительНаименование);
                КонецЕсли;
                Если НЕ ЗначениеЗаполнено(Родитель) Тогда
                    Родитель = Справочники[РодительТип].СоздатьЭлемент();
                    Родитель.Наименование = РодительНаименование;
                    Родитель.Код = РодительКод;
                    ПодменнаяСсылка = Справочники[РодительТип].ПолучитьСсылку(РодительГУИД);
                    Родитель.УстановитьСсылкуНового(ПодменнаяСсылка);
                    Родитель.ОбменДанными.Загрузка = Истина;
                    Родитель.Записать();
                    УстановитьGUIDДляЭлемента(Родитель, РодительГУИД);
                КонецЕсли;

                ЗаписатьСоответствиеОбъектов(Родитель, РодительГУИД, РодительТип, БазаОтправитель, Задача);

            Иначе
                Родитель = НайтиЭлементПоНаименованию(РодительТип, РодительНаименование);
                Если НЕ ЗначениеЗаполнено(Родитель) Тогда
                    Родитель = Справочники[РодительТип].СоздатьЭлемент();
                    Родитель.Наименование = РодительНаименование;
                    Родитель.ЭтоГруппа = ИСТИНА;
                    ПодменнаяСсылка = Справочники[РодительТип].ПолучитьСсылку(РодительГУИД);
                    Родитель.УстановитьСсылкуНового(ПодменнаяСсылка);
                    Родитель.ОбменДанными.Загрузка = Истина;
                    Родитель.Записать();
                КонецЕсли;

                ЗаписатьСоответствиеОбъектов(Родитель, РодительГУИД, РодительТип, БазаОтправитель, Задача);

            КонецЕсли;
        КонецЕсли;

        GUIDЭлемента = ПолучитьGUIDИзДанных(Данные.ГУИД);
        Элемент = НайтиЭлементПоГУИД(ТипИсточника, GUIDЭлемента);
        Если ЭлементНеНайден(Элемент) Тогда
            Элемент = НайтиЭлементПоКоду(ТипИсточника, Данные.Код);
        КонецЕсли;
        Если НЕ ЗначениеЗаполнено(Элемент) Тогда
            Элемент = НайтиЭлементПоНаименованию(ТипИсточника, Данные.Наименование);
        КонецЕсли;

        Если НЕ ЗначениеЗаполнено(Элемент) Тогда
            Элемент = Справочники[ТипИсточника].СоздатьЭлемент();
            Элемент.Наименование = Данные.Наименование;
            Элемент.Код = Данные.Код;

            Если Данные.Свойство("РодительГУИД") Тогда
                Элемент.Родитель = Родитель;
            КонецЕсли;

            Для Каждого Реквизит Из Данные Цикл
                Если Элемент.Метаданные().Реквизиты.Найти(Реквизит.Ключ) <> Неопределено Тогда
                    Элемент[Реквизит.Ключ] = ОбработатьРеквизит(Элемент, Реквизит.Ключ, Реквизит.Значение);
                КонецЕсли;
            КонецЦикла;
            ПодменнаяСсылка = Справочники[ТипИсточника].ПолучитьСсылку(GUIDЭлемента);
            Элемент.УстановитьСсылкуНового(ПодменнаяСсылка);
            Элемент.ОбменДанными.Загрузка = Истина;
            Элемент.Записать();

            ЗаписатьСоответствиеОбъектов(Элемент, GUIDЭлемента, ТипИсточника, БазаОтправитель, Задача);
        Иначе
            Элемент = Элемент.ПолучитьОбъект();
            Элемент.Наименование = Данные.Наименование;
            Элемент.Код = Данные.Код;

            Если Данные.Свойство("РодительГУИД") Тогда
                Элемент.Родитель = Родитель;
            КонецЕсли;

            Для Каждого Реквизит Из Данные Цикл
                Если Элемент.Метаданные().Реквизиты.Найти(Реквизит.Ключ) <> Неопределено Тогда
                    Элемент[Реквизит.Ключ] = ОбработатьРеквизит(Элемент, Реквизит.Ключ, Реквизит.Значение);
                КонецЕсли;
            КонецЦикла;
            Элемент.ОбменДанными.Загрузка = Истина;
            Элемент.Записать();

            ЗаписатьСоответствиеОбъектов(Элемент, GUIDЭлемента, ТипИсточника, БазаОтправитель, Задача);
        КонецЕсли;

        Задача.Статус = Перечисления.ОДМ_СтатусыЗадач.Выполнен;    
        Задача.МоментФиниша = ТекущаяДата();
    КонецЦикла;

    НаборЗадач.Записать();

КонецПроцедуры

Процедура ПолучитьГУИДИзВнешнейБазы() Экспорт

	////////НаборЗадач = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьНаборЗаписей();
	////////НаборЗадач.Отбор.Метод.Установить("Отправить");
	////////НаборЗадач.Прочитать();

	////////Если НаборЗадач.Количество() = 0 Тогда
	////////    Возврат;
	////////КонецЕсли;

	////////Для Каждого Задача Из НаборЗадач Цикл
	////////    
	////////    Если Задача.Статус <> Перечисления.ОДМ_СтатусыЗадач.Отправлен Тогда
	////////        Продолжить;
	////////    КонецЕсли;
	////////    
	////////    Параметры = Задача.Параметры.Получить();
	////////    БазаПолучатель = Параметры.recipient.base.name;
	////////    ВебСервер = Параметры.recipient.base.server;
	////////    Данные = Параметры.data;
	////////    
	////////    Если Данные.Свойство("РодительГУИД") Тогда
	////////        РодительГУИД = Данные.РодительГУИД;
	////////    КонецЕсли;
	////////    
	////////    GUIDЭлемента = Данные.ГУИД;
	////////    
	////////    ТиповойРегистрСопоставленияБазыПолучателя = ВернутьДополнительнуюКонстанту("ТиповойРегистрСопоставленияБазыПолучателя_" + БазаПолучатель);  
	////////    
	////////    ЗапросДляОтправки = ПолучитьЗапросОтправки(ТиповойРегистрСопоставленияБазыПолучателя, GUIDЭлемента, РодительГУИД);
	////////    
	////////    // Формируем массив задач для отправки
	////////	//МассивЗадач = Новый Массив;
	////////	//МассивЗадач.Добавить(ЗапросДляОтправки);
	////////    
	////////    // Отправляем запрос на сервер
	////////	ПараметрыПодключения = ОДМ_ОбменДанными.Конструктор_ПараметрыПодключенияВнешнейБазы();
	////////	ПараметрыПодключения
	////////	Результат = ПараметрыПодключения.ОтправитьЗапросНаСервер(ПараметрыПодключения, ЗапросДляОтправки);
	////////    
	////////    // Обрабатываем результат
	////////    Если Результат <> Неопределено Тогда
	////////		
	////////		Для каждого Строка из Результат Цикл
	////////			ТипИсточника = Данные.Тип;
	////////			СсылкаПоГУИД = НайтиЭлементПоГУИД(ТипИсточника, GUIDЭлемента);	
	////////			//>>>>>>>>>>>>>>>>>>>>>>>>>
	////////			//ЗаписатьСоответствиеОбъектов(СсылкаПоГУИД,Строка.ГУИДИсточника);
	////////			//ЗаписатьСоответствиеОбъектов(Элемент, GUIDЭлемента, ТипИсточника, БазаОтправитель, Задача);
	////////		КонецЦикла;
	////////		// Логика обработки результата
	////////    КонецЕсли;

	////////    Задача.Статус = Перечисления.ОДМ_СтатусыЗадач.Выполнен;    
	////////    Задача.МоментФиниша = ТекущаяДата();
	////////КонецЦикла;

	////////НаборЗадач.Записать();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиПодпискиНаСобытия

// Процедура: ОДМ_ОбменДанными
//  Назначение: Выполняет обмен данными, отправляя задачи и создавая элементы справочника.
//  Процедура регламентного задания ОДМ_ОбменДанными
//
Процедура ОДМ_ОбменДанными() Экспорт
	
	ОтправитьДанныеВБазыПолучателей();
	СоздатьЭлементыСправочникаИзЗадач();
	ПолучитьГУИДИзВнешнейБазы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПолучитьОбъектПоСвойству(Знач ОписаниеОбъекта)
	
	ОписаниеСсылки = ОписаниеОбъекта.Ссылка;
	ТипЗначения = ТипЗнч(ОписаниеСсылки);
	
	Если ТипЗначения = Тип("Структура") Тогда
		Если ПустаяСтрока(ОписаниеСсылки.Значение) Тогда
			ОписаниеСсылки.Значение = "00000000-0000-0000-0000-000000000000";
		КонецЕсли;
		
		ТипЗначения = Тип(ОписаниеСсылки.Тип);
		Ссылка = XMLЗначение(ТипЗначения, ОписаниеСсылки.Значение);
	Иначе
		Ссылка = ОписаниеСсылки;
	КонецЕсли;
	
	Если ОДМ_ОбщегоНазначения.СсылкаСуществует(Ссылка) Тогда
		Объект = Ссылка.ПолучитьОбъект();
	Иначе
		Менеджер = ОДМ_ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
		
		ВидОбъекта = ОДМ_ОбщегоНазначения.ВидОбъектаПоТипу(ТипЗначения);
		Если ВидОбъекта = "Справочник" Тогда
			#Если Сервер и Не Сервер Тогда
				Менеджер = Справочники.ОДМ_БазыДанных;
			#КонецЕсли
			
			Если ОписаниеОбъекта.Свойство("ЭтоГруппа")
			И (ОписаниеОбъекта.ЭтоГруппа = Истина
				ИЛИ ПрочитатьЗначениеСвойства(ОписаниеОбъекта.ЭтоГруппа) = Истина)
			Тогда
				Объект = Менеджер.СоздатьГруппу();
			Иначе
				Объект = Менеджер.СоздатьЭлемент();
			КонецЕсли;
			
			Попытка //FIXME: если стандартный реквизит отсутвует - исключение. переделать на проверку метаданных
				ОписаниеОбъекта.Свойство("Код", Объект.Код);
				Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
					Объект.УстановитьНовыйКод(Объект.Код);
				КонецЕсли;
			Исключение КонецПопытки;
			
		ИначеЕсли ВидОбъекта = "Документ" Тогда
			#Если Сервер и Не Сервер Тогда
				Менеджер = Документы.ОДМ_ХТТПЗапросы;
			#КонецЕсли
			
			Объект = Менеджер.СоздатьДокумент();
			
			Попытка //FIXME: если стандартный реквизит отсутвует - исключение. переделать на проверку метаданных
				ОписаниеОбъекта.Свойство("Номер", Объект.Номер);
				Если ЗначениеЗаполнено(Объект.Номер) Тогда
					Объект.УстановитьНовыйНомер();
				КонецЕсли;
			Исключение КонецПопытки;
			
		ИначеЕсли ВидОбъекта = "ПланВидовХарактеристик" Тогда
			
			Если ОписаниеОбъекта.Свойство("ЭтоГруппа")
			И (ОписаниеОбъекта.ЭтоГруппа = Истина
				ИЛИ ПрочитатьЗначениеСвойства(ОписаниеОбъекта.ЭтоГруппа) = Истина)
			Тогда
				Объект = Менеджер.СоздатьГруппу();
			Иначе
				Объект = Менеджер.СоздатьЭлемент();
			КонецЕсли;
			
			Попытка //FIXME: если стандартный реквизит отсутвует - исключение. переделать на проверку метаданных
				ОписаниеОбъекта.Свойство("Код", Объект.Код);
				Если НЕ ЗначениеЗаполнено(Объект.Код) Тогда
					Объект.УстановитьНовыйКод();
				КонецЕсли;
			Исключение КонецПопытки;
				
		Иначе
			ВызватьИсключение "пока поддерживаются только документы, справочники, ПВХ";
		КонецЕсли;
		
		УстановитьДополнительныеСвойстваОбъекту(Объект, ВидОбъекта);
		
		ИдентификаторСсылки = Ссылка.УникальныйИдентификатор();
		Если ЗначениеЗаполнено(ИдентификаторСсылки) Тогда
			СсылкаНового = Менеджер.ПолучитьСсылку(ИдентификаторСсылки);
			Объект.УстановитьСсылкуНового(СсылкаНового);
		КонецЕсли;
	КонецЕсли;
	
	Возврат Объект;
	
КонецФункции

Процедура УстановитьДополнительныеСвойстваОбъекту(Объект, Знач ВидОбъекта)
	
	//TODO: в доп параметры устанавливать реквизиты, которые не нужно ставить если они в коллекции
	//и тому подобное
	
КонецПроцедуры

Функция ПрочитатьЗначениеСвойства(Знач ОписаниеЗначения, КэшЗначений = Неопределено, ВызыватьИсключениеПустогоСсылочногоТипа = Ложь)
	
	РезультатМетода = Неопределено;
	
	Если КэшЗначений = Неопределено Тогда
		КэшЗначений = Новый Соответствие;
	КонецЕсли;
	
	РезультатМетода = КэшЗначений.Получить(ОписаниеЗначения);
	Если НЕ РезультатМетода = Неопределено Тогда
		Возврат РезультатМетода;
	КонецЕсли;
	
	РезультатМетода = ОписаниеЗначения;
	
	ТипОписания = ТипЗнч(ОписаниеЗначения);
	Если ЛОЖЬ
		ИЛИ ТипОписания = Тип("Неопределено")
		ИЛИ ТипОписания = Тип("Дата")
		ИЛИ ТипОписания = Тип("Булево")
		Или ТипОписания = Тип("Строка")
		Или ТипОписания = Тип("Число")
		Тогда
		Возврат РезультатМетода;
		
	ИначеЕсли ОДМ_ОбщегоНазначения.ЭтоСсылка(ТипОписания) Тогда
		КэшЗначений.Вставить(ОписаниеЗначения, РезультатМетода);
		Возврат РезультатМетода;
		
	ИначеЕсли ЛОЖЬ
		Или НЕ ТипОписания = Тип("Структура")
		Или НЕ ОписаниеЗначения.Свойство("Тип")
		Или НЕ ОписаниеЗначения.Свойство("Значение")
		Тогда
		ТекстСообщения = НСтр("ru='Невозможно обработать значение свойства: %1';
		|en='The property value cannot be processed: %1'");
		ВызватьИсключение СтрШаблон(ТекстСообщения, СериализоватьJSON(ОписаниеЗначения));
	КонецЕсли;
	
	Попытка
		ТипЗначения = Тип(ОписаниеЗначения.Тип);
		Если ТипЗначения = ТипЗнч(ОписаниеЗначения.Значение) Тогда
			Возврат ОписаниеЗначения.Значение;
		КонецЕсли;
		
		Если ТипЗначения = Тип("Null") Тогда
			Возврат Null;
		КонецЕсли;
		
		// Специальная обработка для планов счетов: поиск по коду вместо GUID
		Если ОписаниеЗначения.Тип = "ПланСчетовСсылка.Хозрасчетный" Тогда
			
			КодСчета = Строка(ОписаниеЗначения.Значение);
			Если ПустаяСтрока(КодСчета) Тогда
				РезультатМетода = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			Иначе
				РезультатМетода = ПланыСчетов.Хозрасчетный.НайтиПоКоду(КодСчета);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(РезультатМетода) Тогда
				РезультатМетода = ПланыСчетов.Хозрасчетный.ПустаяСсылка();
			КонецЕсли;
		//Поиск по наименованию, пока по типу
		ИначеЕсли ОписаниеЗначения.Тип = "СправочникСсылка.ВидыНалоговИПлатежейВБюджет" ИЛИ ОписаниеЗначения.Тип = "СправочникСсылка.ПрочиеДоходыИРасходы" 
																						ИЛИ ОписаниеЗначения.Тип = "СправочникСсылка.Пользователи" Тогда
			
			ИмяСправочника = СтрРазделить(ОписаниеЗначения.Тип, ".")[1];
			
			НаименованиеЗначение = Строка(ОписаниеЗначения.Значение);
			Если ПустаяСтрока(НаименованиеЗначение) Тогда
				РезультатМетода = Справочники[ИмяСправочника].ПустаяСсылка();
			Иначе
				РезультатМетода = Справочники[ИмяСправочника].НайтиПоНаименованию(НаименованиеЗначение);
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(РезультатМетода) Тогда
				РезультатМетода = Справочники[ИмяСправочника].ПустаяСсылка();
			КонецЕсли;
			
		Иначе
			
			Если ОДМ_ОбщегоНазначения.ЭтоСсылка(ТипЗначения) И НЕ ЗначениеЗаполнено(ОписаниеЗначения.Значение) Тогда
				ОписаниеЗначения.Значение = "00000000-0000-0000-0000-000000000000";
			КонецЕсли;
			
			ИмяПредопределенныхДанных = "";
			Если Истина
				И   ОписаниеЗначения.Свойство("ИмяПредопределенныхДанных", ИмяПредопределенныхДанных)
				И   НЕ ПустаяСтрока(ИмяПредопределенныхДанных)
				Тогда
				МенеджерОбъекта = ОДМ_ОбщегоНазначения.МенеджерОбъектаПоСсылке(Новый(ТипЗначения));
				РезультатМетода = МенеджерОбъекта[ИмяПредопределенныхДанных];
			Иначе
				РезультатМетода = XMLЗначение(ТипЗначения, ОписаниеЗначения.Значение);
				Если Истина
					И   ВызыватьИсключениеПустогоСсылочногоТипа = Истина
					И   ОДМ_ОбщегоНазначения.ЗначениеСсылочногоТипа(РезультатМетода)
					И   ОДМ_ОбщегоНазначения.СсылкаСуществует(РезультатМетода)
					Тогда
					ТекстСообщения = НСтр("ru='В базе данных отсутствует объект: %1';
					|en='The object is missing in the database: %1'");
					ВызватьИсключение СтрШаблон(ТекстСообщения, СериализоватьJSON(ОписаниеЗначения));
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
	Исключение
		ТекстСообщения = НСтр("ru='Невозможно обработать значение свойства: %1';
		|en='The property value cannot be processed: %1'");
		ВызватьИсключение СтрШаблон(ТекстСообщения, СериализоватьJSON(ОписаниеЗначения));
	КонецПопытки;
	
	КэшЗначений.Вставить(ОписаниеЗначения, РезультатМетода);
	
	Возврат РезультатМетода;
	
КонецФункции

// TODO: поглядеть как оно будет работать в модуле ПовтИсп. если плохо, тогда через кэшСоответствий реализовать
//       ибо на больших таблицах работа с метаданными и типами будет долгой
Функция ПреобразованиеJSON(Свойство, Значение, ДополнительныеПараметры, Отказ) Экспорт
	
	РезультатМетода = Значение;
	ТипЗначения = ТипЗнч(Значение);
	
	Если Ложь Тогда
		//заглушка
		
	ИначеЕсли ТипЗначения = Тип("УникальныйИдентификатор") Тогда
		РезультатМетода = УстановитьСвойство("УникальныйИдентификатор", Строка(Значение));
		
	ИначеЕсли ТипЗначения = Тип("ТаблицаЗначений") Тогда
		РезультатМетода = ОбщегоНазначения.ТаблицаЗначенийВМассив(Значение);
		
	ИначеЕсли Значение = Null Тогда
		РезультатМетода = УстановитьСвойство("Null", "<Null>");
		
	ИначеЕсли ТипЗначения = Тип("Тип") Тогда
		ОбъектМетаданных = Метаданные.НайтиПоТипу(Значение);
		Если ОбъектМетаданных = Неопределено Тогда
			РезультатМетода = Строка(Значение)
		Иначе
			ПредставлениеТипа = "<ВРАЗРАБОТКЕ>";
			Если Метаданные.Справочники.Содержит(Метаданные.НайтиПоТипу(Значение)) Тогда
				ПредставлениеТипа = "Справочник";
			ИначеЕсли Метаданные.Документы.Содержит(Метаданные.НайтиПоТипу(Значение)) Тогда
				ПредставлениеТипа = "Документ";
			ИначеЕсли Метаданные.ПланыСчетов.Содержит(Метаданные.НайтиПоТипу(Значение)) Тогда
				ПредставлениеТипа = "ПланСчетов";
			ИначеЕсли Метаданные.БизнесПроцессы.Содержит(Метаданные.НайтиПоТипу(Значение)) Тогда
				ПредставлениеТипа = "БизнесПроцесс";
			ИначеЕсли Метаданные.Задачи.Содержит(Метаданные.НайтиПоТипу(Значение)) Тогда
				ПредставлениеТипа = "Задача";
			КонецЕсли;
			
			//"e1cib/data/Документ.ПриобретениеТоваровУслуг"
			ШаблонПредставления = "e1cib/data/%1.%2";
			РезультатМетода = СтрШаблон(ШаблонПредставления, ПредставлениеТипа, ОбъектМетаданных.Имя);
			
		КонецЕсли;
		
	ИначеЕсли ОДМ_ОбщегоНазначения.ЭтоСсылка(ТипЗначения) Тогда
		РезультатМетода = XMLСтрока(Значение);
		
	Иначе
		РезультатМетода = УстановитьСвойство(Строка(ТипЗначения), Строка(Значение));
	КонецЕсли;
	
	Возврат РезультатМетода;
	
КонецФункции

Функция ВосстановлениеJSON(Свойство, Значение, ДополнительныеПараметры) Экспорт
	
	//FIXME: -> для преобразования примитивных типов - переделать под общую конструкцию
	Попытка
		_Значение = XMLЗначение(Тип("Дата"), Строка(Значение));
		Возврат _Значение;
	Исключение
		ТекстОшибки = ОписаниеОшибки(); //для отладки
	КонецПопытки;
	
	Попытка
		Если Значение = "0" или Значение = "1" или Значение = 0 или Значение = 1 Тогда
			ВызватьИсключение "XMLЗначение(Тип(""Булево""), Строка(1)) возвращает истину"; //FIXME: подумать и переписать
		КонецЕсли;
		Если ТипЗнч(Значение) = Тип("Булево") Тогда
			Возврат Значение;
		КонецЕсли;
		
		_Значение = XMLЗначение(Тип("Булево"), Строка(Значение));
		Возврат _Значение;
	Исключение
		ТекстОшибки = ОписаниеОшибки(); //для отладки
	КонецПопытки;
	//<-
	
	Если ТипЗнч(Значение) = Тип("Структура")
	И Значение.Свойство("Тип")
	И Значение.Свойство("Значение")
	ТОГДА
	
		Значение = ПрочитатьЗначениеСвойства(Значение);
	
	КонецЕсли;
	
	Возврат Значение;
	
КонецФункции

Функция ОписаниеТипаПоМассивуТипов(Знач МассивТипов) Экспорт
	
	КвСтроки = Новый КвалификаторыСтроки(250);
	КвЧисла = Новый КвалификаторыЧисла(20, 5, ДопустимыйЗнак.Любой);
	КвДаты = Новый КвалификаторыДаты(ЧастиДаты.ДатаВремя);
	
	ОписаниеТипов = Новый ОписаниеТипов(МассивТипов, КвЧисла, КвСтроки, КвДаты);
	
	Возврат ОписаниеТипов;
	
КонецФункции

// Рекурсивно ищет значение, которое не может быть сериализовано в JSON.
//
// Входные параметры:
//   Значение - Произвольный - Объект для проверки.
//   ПутьОшибки - Строка - Переменная для возврата пути к ошибочному значению.
//
// Возвращаемое значение:
//   Произвольный - Ошибочное значение или Неопределено, если ошибок нет
//
Функция ЗаписатьJSON_НайтиПутьОшибочногоЗначения(Знач Значение, ПутьОшибки)
	
	ТипЗначения = ТипЗнч(Значение);
	
	Если ТипЗначения = Тип("Соответствие") или ТипЗначения = Тип("Структура") Тогда
		
		Для Каждого КлючИЗначение Из Значение Цикл
			
			Если ТипЗначения = Тип("Соответствие") Тогда 
				ПутьОшибки = Неопределено;
				ЗначениеОшибки = ЗаписатьJSON_НайтиПутьОшибочногоЗначения(КлючИЗначение.Ключ, ПутьОшибки);
				Если ЗначениеОшибки <> Неопределено Тогда 
					ПутьОшибки = СтрШаблон("%1 (ключ).%2", КлючИЗначение.Ключ, ПутьОшибки);
					Возврат ЗначениеОшибки; 
				КонецЕсли;
			КонецЕсли;
			
			ПутьОшибки = Неопределено;
			ЗначениеОшибки = ЗаписатьJSON_НайтиПутьОшибочногоЗначения(КлючИЗначение.Значение, ПутьОшибки);
			Если ЗначениеОшибки <> Неопределено Тогда 
				ПутьОшибки = СтрШаблон("%1%2",
									КлючИЗначение.Ключ,
									?(ПутьОшибки<>Неопределено, ?(Лев(ПутьОшибки, 1) <> "[", ".", "") + ПутьОшибки, "")
				);
				Возврат ЗначениеОшибки;
			КонецЕсли;
		КонецЦикла;
		
		Возврат Неопределено;
		
	ИначеЕсли ТипЗначения = Тип("Массив") Тогда
		
		НомерСтроки = 0;
		Для Каждого ЭлементМассива Из Значение Цикл
			НомерСтроки = НомерСтроки + 1;
			ПутьОшибки = Неопределено;
			ЗначениеОшибки = ЗаписатьJSON_НайтиПутьОшибочногоЗначения(ЭлементМассива, ПутьОшибки);
			Если ЗначениеОшибки <> Неопределено Тогда 
				ПутьОшибки = СтрШаблон("[%1]%2",
									Формат(НомерСтроки, "ЧГ="),
									?(ПутьОшибки <> Неопределено, ?(Лев(ПутьОшибки, 1) <> "[", ".", "") + ПутьОшибки, "")
				);
				Возврат ЗначениеОшибки;
			КонецЕсли;
		КонецЦикла;
		Возврат Неопределено;
		
	КонецЕсли;
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	
	Попытка
		ЗаписатьJSON(ЗаписьJSON, Значение, , "ПреобразованиеJSON", Вычислить("ОДМ_ОбменДанными"));
	Исключение 
		Возврат Значение;
	КонецПопытки;
	
	Возврат Неопределено;
	
КонецФункции 

Процедура УстановитьМоментыДействий(Запись)
	
	#Если Сервер и Не Сервер Тогда
		Запись = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьМенеджерЗаписи();
	#КонецЕсли
	
	Если Запись.МоментСтарта = '0001-01-01' Тогда
		Запись.МоментСтарта = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Запись.Попытка >= 5 Тогда
		Запись.Статус = Перечисления.ОДМ_СтатусыЗадач.Ошибка;
	КонецЕсли;
	
	Если Запись.МоментФиниша = '0001-01-01' и Перечисления.ОДМ_СтатусыЗадач.ЭтоЗавершенныйСтатус(Запись.Статус) Тогда
		Запись.МоментФиниша = ТекущаяДатаСеанса();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // СлужебныеПроцедурыИФункции

#Область ВспомогательныеМетоды

// Устарела. Следует использовать РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач
// Создает задачи обмена на основе входящих данных.
// Входные параметры:
//   МассивЗадач - Массив - Массив задач, которые нужно добавить в регистр.
Функция СоздатьЗадачуОбменаВходящиеДанные(МассивЗадач) Экспорт
	
	//TODO: в регистр пишем через обертку РегистрыСведений.ОДМ_ЗадачиОбмена.ЗаписатьДанныеЗадач(ОписаниеЗадачи);
	
	НаборЗадач = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьНаборЗаписей();
	
	Для Каждого Задача Из МассивЗадач Цикл
		НоваяЗадача = НаборЗадач.Добавить();
		НоваяЗадача.Идентификатор = Новый УникальныйИдентификатор(Задача.TaskID);
		НоваяЗадача.ДатаСоздания = ТекущаяДата();
		НоваяЗадача.Инициатор = Задача.initiator.user;
		НоваяЗадача.Статус = Перечисления.ОДМ_СтатусыЗадач.Подготовлен;
		НоваяЗадача.Метод = "Записать";
		НоваяЗадача.Параметры = Новый ХранилищеЗначения(Задача);
	КонецЦикла;
	
	Если НаборЗадач.Количество() > 0 Тогда
		НаборЗадач.Записать();
	КонецЕсли;
	
КонецФункции

Процедура ЗаписатьСоответствиеОбъектов(Элемент, GUIDЭлемента, ТипИсточника, БазаОтправитель, Задача)
    
    Если Метаданные.РегистрыСведений.Найти("СоответствиеОбъектовТекущейИВнешнихИБ") <> Неопределено Тогда
       
        ИмяРегистра = "СоответствиеОбъектовТекущейИВнешнихИБ";
        ИмяИзмеренияБазы = "ИспользуемаяИБ";
        ИмяПоляГУИД = "ОбъектВнешнейИБ";
        ИмяПоляОбъекта = "ОбъектТекущейИБ";
        ИмяПоляНастройки = "НастройкиСоответствия";
    ИначеЕсли Метаданные.РегистрыСведений.Найти("СоответствияОбъектовИнформационныхБаз") <> Неопределено Тогда
        
        ИмяРегистра = "СоответствияОбъектовИнформационныхБаз";
        ИмяИзмеренияБазы = "УзелИнформационнойБазы";
        ИмяПоляГУИД = "УникальныйИдентификаторПриемника";
        ИмяПоляОбъекта = "УникальныйИдентификаторИсточника";
		ИмяПоляОбъектаГУИДСтрокой = "УникальныйИдентификаторИсточникаСтрокой";
        ИмяПоляТипаПриемника = "ТипПриемника";
        ИмяПоляТипаИсточника = "ТипИсточника";
    Иначе
        // Если ни одна из конфигураций не найдена, завершаем выполнение
        Возврат;
    КонецЕсли;

    НоваяЗапись = РегистрыСведений[ИмяРегистра].СоздатьМенеджерЗаписи();
    
    Если ИмяРегистра = "СоответствиеОбъектовТекущейИВнешнихИБ" Тогда
		
		НастройкиСоответствия = Справочники.СоответствиеВнешнимИБ.НайтиПоРеквизиту("ИмяОбъектаМетаданных", ТипИсточника,,БазаОтправитель.ТипБД);
		
		НоваяЗапись[ИмяПоляОбъекта] = Элемент.Ссылка;
        НоваяЗапись[ИмяПоляГУИД] = GUIDЭлемента;
        НоваяЗапись[ИмяИзмеренияБазы] = БазаОтправитель;
        НоваяЗапись[ИмяПоляНастройки] = НастройкиСоответствия;
	Иначе
        НоваяЗапись[ИмяПоляОбъекта] = Элемент.Ссылка;
		НоваяЗапись[ИмяПоляОбъектаГУИДСтрокой] = Строка(Элемент.Ссылка.УникальныйИдентификатор());
		НоваяЗапись[ИмяПоляГУИД] = GUIDЭлемента;
        НоваяЗапись[ИмяПоляТипаПриемника] = "СправочникСсылка." + ТипИсточника;
        НоваяЗапись[ИмяПоляТипаИсточника] = "СправочникСсылка." + ТипИсточника;
        НоваяЗапись[ИмяИзмеренияБазы] = БазаОтправитель;
    КонецЕсли;

    НоваяЗапись.Записать();

КонецПроцедуры

// Функция для обработки реквизитов (перечисления, ссылки и т.д.)
Функция ОбработатьРеквизит(Элемент, ИмяРеквизита, Знач Значение)
	
	МетаданныеРеквизита = Элемент.Метаданные().Реквизиты.Найти(ИмяРеквизита);
	//Если МетаданныеРеквизита = Неопределено Тогда
	//    Возврат Неопределено;
	//КонецЕсли;

	ТипРеквизита = ТипЗнч(Элемент[ИмяРеквизита]);
	
    Если Перечисления.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
        ТипПеречисления = Элемент[ИмяРеквизита].Метаданные().Имя;
		Попытка
			
			Для Каждого ЗначениеПеречисления ИЗ Перечисления[ТипПеречисления] Цикл
				Если Строка(ЗначениеПеречисления) = Значение Тогда
					 Возврат ЗначениеПеречисления;
				КонецЕсли;
			КонецЦикла;
		
			//Возврат Перечисления[Элемент[ИмяРеквизита].Метаданные().Имя][Значение];
        Исключение
            Возврат Неопределено;
        КонецПопытки;
	ИначеЕсли Справочники.ТипВсеСсылки().СодержитТип(ТипРеквизита) 
		ИЛИ Документы.ТипВсеСсылки().СодержитТип(ТипРеквизита) Тогда
        
        Попытка
            Возврат Справочники[МетаданныеРеквизита.ИмяСправочника].НайтиПоНаименованию(Значение);
        Исключение
            Возврат Неопределено;
        КонецПопытки;
    Иначе
        
        Возврат Значение;
		
	КонецЕсли;
	
КонецФункции

// Функция: НайтиЭлементПоГУИД
// Назначение: Функция для поиска элемента по GUID
Функция НайтиЭлементПоГУИД(ИмяСправочника, GUID)
    Попытка
        Возврат Справочники[ИмяСправочника].ПолучитьСсылку(GUID);
    Исключение
        Возврат Неопределено;
    КонецПопытки;
КонецФункции

// Функция: НайтиЭлементПоКоду
// Назначение:Функция для поиска элемента по коду
Функция НайтиЭлементПоКоду(ИмяСправочника, Код)
    Попытка
        Возврат Справочники[ИмяСправочника].НайтиПоКоду(Код);
    Исключение
        Возврат Неопределено;
    КонецПопытки;
КонецФункции

// Функция: НайтиЭлементПоНаименованию
// Назначение: Функция для поиска элемента по наименованию
Функция НайтиЭлементПоНаименованию(ИмяСправочника, Наименование)
    Попытка
        Возврат Справочники[ИмяСправочника].НайтиПоНаименованию(Наименование);
    Исключение
        Возврат Неопределено;
    КонецПопытки;
КонецФункции

// Функция: УстановитьGUIDДляЭлемента
// Назначение: Функция для установки GUID элемента
Функция УстановитьGUIDДляЭлемента(Элемент, GUID)
    Попытка
        Элемент.УстановитьСсылку(GUID);
        Элемент.Записать();
        Возврат Истина;
    Исключение
        Возврат Ложь;
    КонецПопытки;
КонецФункции

// Функция для получения соответствия "МестоИспользования - ИнформационнаяБаза"
Функция ПолучитьСоответствиеБазИспользования(МассивБазДанных)
    СоответствиеБаз = Новый Соответствие;
    
    Для Каждого МестоИспользования Из МассивБазДанных Цикл
        БазаИспользования = ВернутьДополнительнуюКонстанту("ОДМ_DataExchange_Base_" + МестоИспользования);
        СоответствиеБаз.Вставить(МестоИспользования, БазаИспользования);
    КонецЦикла;
    
    Возврат СоответствиеБаз;
КонецФункции

// Функция для получения ГУИД из регистра
Функция ПолучитьГУИДИзРегистра(СоответствиеОбъектов, Ссылка, МестоИспользования)
	
	Если СоответствиеОбъектов.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	
    Ключ = Строка(Ссылка) + "_" + МестоИспользования;
		
    Если СоответствиеОбъектов.Свойство(Ключ) Тогда
        Возврат СоответствиеОбъектов[Ключ];
    Иначе
        Возврат Неопределено;
	КонецЕсли;
	
КонецФункции

// Функция для получения данных из регистра СоответствиеОбъектовТекущейИВнешнихИБ
Функция ПолучитьСоответствиеОбъектовПоБазам(СоответствиеБаз,Источник)
	
	    СоответствиеОбъектов = Новый Соответствие;
    
    // Проверяем, какая конфигурация используется
    Если Метаданные.РегистрыСведений.Найти("СоответствиеОбъектовТекущейИВнешнихИБ") <> Неопределено Тогда
        // Конфигурация "Управление холдингом"
        ИмяРегистра = "СоответствиеОбъектовТекущейИВнешнихИБ";
        ИмяИзмеренияБазы = "ИспользуемаяИБ";
        ИмяПоляГУИД = "ГУИДВнешнейИБ";
        ИмяПоляОбъекта = "ОбъектТекущейИБ";
    ИначеЕсли Метаданные.РегистрыСведений.Найти("СоответствияОбъектовИнформационныхБаз") <> Неопределено Тогда
        // Конфигурация "1С:Бухгалтерия предприятия КОРП"
        ИмяРегистра = "СоответствияОбъектовИнформационныхБаз";
        ИмяИзмеренияБазы = "УзелИнформационнойБазы";
        ИмяПоляГУИД = "УникальныйИдентификаторПриемника";
        ИмяПоляОбъекта = "УникальныйИдентификаторИсточника";
    Иначе
        // Если ни одна из конфигураций не найдена, возвращаем пустое соответствие
        Возврат СоответствиеОбъектов;
    КонецЕсли;
	
	Для Каждого ЭлементСоответствия Из СоответствиеБаз Цикл
        МестоИспользования = ЭлементСоответствия.Ключ;
        БазаИспользования = ЭлементСоответствия.Значение;
        
        НаборЗаписей = РегистрыСведений[ИмяРегистра].СоздатьНаборЗаписей();
        
        НаборЗаписей.Отбор[ИмяИзмеренияБазы].Установить(БазаИспользования);
        НаборЗаписей.Отбор[ИмяПоляОбъекта].Установить(Источник);
        
        НаборЗаписей.Прочитать();
        
        Для Каждого Запись Из НаборЗаписей Цикл
            Если Запись[ИмяПоляОбъекта] = Источник Тогда
                Ключ = Строка(Запись[ИмяПоляОбъекта]) + "_" + МестоИспользования;
                СоответствиеОбъектов.Вставить(Ключ, Запись[ИмяПоляГУИД]);
            КонецЕсли;
        КонецЦикла;
    КонецЦикла;
    
    Возврат СоответствиеОбъектов;
	
КонецФункции

Функция ЭлементНеНайден(Элемент)
    Возврат Элемент = Неопределено ИЛИ Найти(Элемент, "<Объект не найден>") > 0;
КонецФункции

Функция ПолучитьЗапросОтправки(ИмяРегистра, GUIDЭлемента, РодительГУИД = Неопределено)
    
    Запрос = Конструктор_ОписаниеЗапросаВнешнейБазы();

    Если ИмяРегистра = "СоответствиеОбъектовТекущейИВнешнихИБ" Тогда
        Запрос.ТекстЗапроса = "
        | ВЫБРАТЬ
        |     СоответствиеОбъектовТекущейИВнешнихИБ.УникальныйИдентификаторИсточника КАК ГУИДИсточника
        | ИЗ
        |     РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
        | ГДЕ
        |     СоответствиеОбъектовТекущейИВнешнихИБ.УникальныйИдентификаторПриемника = &ГУИДСтрокой";
        Запрос.Параметры.Вставить("ГУИДСтрокой", GUIDЭлемента);

        Если РодительГУИД <> Неопределено Тогда
            Запрос.ТекстЗапроса = Запрос.ТекстЗапроса + "
            | ОБЪЕДИНИТЬ ВСЕ
            | ВЫБРАТЬ
            |     СоответствиеОбъектовТекущейИВнешнихИБ.УникальныйИдентификаторИсточника
            | ИЗ
            |     РегистрСведений.СоответствиеОбъектовТекущейИВнешнихИБ КАК СоответствиеОбъектовТекущейИВнешнихИБ
            | ГДЕ
            |     СоответствиеОбъектовТекущейИВнешнихИБ.УникальныйИдентификаторПриемника = &РодительГУИД";
            Запрос.Параметры.Вставить("РодительГУИД", РодительГУИД);
        КонецЕсли;

    ИначеЕсли ИмяРегистра = "СоответствияОбъектовИнформационныхБаз" Тогда
        Запрос.ТекстЗапроса = "
        | ВЫБРАТЬ
        |     СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточникаСтрокой КАК ГУИДИсточника
        | ИЗ
        |     РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
        | ГДЕ
        |     СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника = &ГУИДСтрокой";
        Запрос.Параметры.Вставить("ГУИДСтрокой", GUIDЭлемента);

        Если РодительГУИД <> Неопределено Тогда
            Запрос.ТекстЗапроса = Запрос.ТекстЗапроса + "
            | ОБЪЕДИНИТЬ ВСЕ
            | ВЫБРАТЬ
            |     СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторИсточникаСтрокой
            | ИЗ
            |     РегистрСведений.СоответствияОбъектовИнформационныхБаз КАК СоответствияОбъектовИнформационныхБаз
            | ГДЕ
            |     СоответствияОбъектовИнформационныхБаз.УникальныйИдентификаторПриемника = &РодительГУИД";
            Запрос.Параметры.Вставить("РодительГУИД", РодительГУИД);
        КонецЕсли;
    КонецЕсли;

    Возврат Запрос;

КонецФункции

Функция ВернутьДополнительнуюКонстанту(Имя) Экспорт 
	
	ЭтоМассивПараметров = Ложь;
	Результат = Неопределено;
	СтруктураРезультат = Новый Структура;
	
	Запрос = Новый Запрос;
	мТекст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПЛ_ДополнительныеКонстанты.Имя КАК Имя,
	|	ПЛ_ДополнительныеКонстанты.Значение КАК Значение
	|ИЗ
	|	РегистрСведений.ПЛ_ДополнительныеКонстанты КАК ПЛ_ДополнительныеКонстанты
	|ГДЕ
	|	ПЛ_ДополнительныеКонстанты.Имя =&Имя";
	
	Если ТипЗнч(Имя)=Тип("Массив") Тогда
		мТекст=СтрЗаменить(мТекст,"=&Имя"," в (&Имя)");
		ЭтоМассивПараметров=Истина;
		Для ффф=0 по Имя.ВГраница() Цикл
			СтруктураРезультат.Вставить(Имя[ффф],Неопределено);
		КонецЦикла; 
	КонецЕсли; 
	
	Запрос.Текст = мТекст;
	Запрос.УстановитьПараметр("Имя", Имя);
	РезультатЗапроса = Запрос.Выполнить().Выгрузить();
	
	Для каждого стр Из РезультатЗапроса Цикл
		Если ЭтоМассивПараметров Тогда
			СтруктураРезультат[стр.Имя]=стр.Значение;
		иначе	
			Результат = стр.Значение;
		КонецЕсли; 
	КонецЦикла;
		
	возврат ?(ЭтоМассивПараметров = Истина,СтруктураРезультат,Результат);
	
КонецФункции

#КонецОбласти

#Область TODO_КПереработке


#КонецОбласти // TODO_КПереработке
