#Область ОписаниеПеременных

&НаКлиенте
Перем ДоступныеОперацииИдентификаторПоследней Экспорт;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Подготовка доступных операций
	ОтборПоИнструменту = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "Инструмент");
	НавигационнаяСсылка = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "НавигационнаяСсылка");
	Формы = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "Формы", Новый Массив);
	Объекты = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "Объекты", Новый Массив);
	
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ДоступныеОперации);
	ДобавитьВДоступныеОперацииПоКонтексту(ДоступныеОперации, НавигационнаяСсылка, Формы, Объекты);
	ПрисутствуютДоступныеОперацииКонтекста = ЗначениеЗаполнено(ДоступныеОперации.ПолучитьЭлементы());
	
	ОбновитьЭлементыФормыПриСозданииНаСервере();
	ДобавитьВДоступныеОперацииИнструменты();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	Если ДоступныеОперации.ПолучитьЭлементы().Количество() = 1 Тогда
		
		Отказ = Истина;
		
		Строка = ДоступныеОперации.ПолучитьЭлементы()[0];
		ВыбраноЗначение(Строка);
		
	КонецЕсли;
	
	ИТК_ФормаКлиент.СортироватьСтрокиДерева(ДоступныеОперации.ПолучитьЭлементы(), "Порядок");
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДоступныеОперации

&НаКлиенте
Процедура ДоступныеОперацииВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбраноЗначение(Элемент.ТекущиеДанные, СтандартнаяОбработка);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбраноЗначение(Элементы.ДоступныеОперации.ТекущиеДанные);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ОбновитьЭлементыФормыПриСозданииНаСервере()
	
	Заголовок = Метаданные.Обработки.ИТК_ГлобальноеМеню.Представление();
	Элементы.ДоступныеОперацииГруппаОбъект.Видимость = ПрисутствуютДоступныеОперацииКонтекста;
	Элементы.ДоступныеОперацииСочетаниеКлавиш.Видимость = НЕ ЗначениеЗаполнено(ОтборПоИнструменту);
	
	Если НЕ ЗначениеЗаполнено(ОтборПоИнструменту) Тогда
		ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ДоступныеОперации, ПоложениеСтрокиПоиска.Верх);
	КонецЕсли;
	
	УстановитьУсловноеОформление();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();
	
	Оформление = Новый Структура("Видимость", Ложь);
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ДоступныеОперацииОбъектПояснение",
		Оформление, "ДоступныеОперации.ОбъектПояснение", Неопределено, ВидСравненияКомпоновкиДанных.НеЗаполнено);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВДоступныеОперацииИнструменты()
	
	ДобавлятьГруппуВсеИнструменты = ПрисутствуютДоступныеОперацииКонтекста
										И НЕ ЗначениеЗаполнено(ОтборПоИнструменту);
	Если ДобавлятьГруппуВсеИнструменты Тогда
		
		Инструмент = ИТК_Перечисления.Инструменты();
		ПорядокВСамомКонце = 1000000;
		СтрокаРодитель = ДобавитьСтрокуВДоступныеОперации(ДоступныеОперации, Инструмент, , , ПорядокВСамомКонце);
		
	Иначе
		СтрокаРодитель = ДоступныеОперации;
	КонецЕсли;
	
	ИнструментыИЗначения = Новый СписокЗначений;
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментКонсольЗапросов());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРедакторОбъекта());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментКонсольСхемКомпоновкиДанных());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментКонсольКода());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментАнализПравДоступа());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментМетаданные());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментМенеджерФормы());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПоискПоСтруктуреХранения());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРедакторКонстант());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРедакторПараметровСеанса());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРедакторЗаписиНезависимогоРегистраСведений());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПоискСсылокНаОбъект());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПоискИЗаменаСсылок());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПодпискиНаСобытия());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментСравнениеОбъектов());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПользователи());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментМониторЛицензий());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментЖурналРегистрации());
	
	Если ИТК_БСПКлиентСервер.ИспользуетсяБСП() Тогда
		
		ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментГрупповоеИзменениеРеквизитов());
		ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментПоискИУдалениеДублей());
		ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментУдалениеПомеченныхОбъектов());
		
	КонецЕсли;
	
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментФормаСпискаУниверсальная());
	ИнструментыИЗначения.Добавить( , ИТК_Перечисления.ИнструментОбслуживаниеСлужебные());
	
	ДобавитьДоступныеИнструментыПоЗначениям(СтрокаРодитель, ИнструментыИЗначения, "Представление");
	
КонецПроцедуры

&НаСервере
Функция ДобавитьСтрокуВДоступныеОперации(Родитель, Инструмент, ИдентификаторПредставления = "Представление", Объект = Неопределено, Порядок = Неопределено)
	
	Если НЕ ИТК_ТуллкитКлиентСервер.ДоступенИнструмент(Инструмент) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ОтборПоИнструменту)
			И Инструмент <> ОтборПоИнструменту Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	ОбъектОбработки = ИТК_Туллкит.ОбъектОбработкиИнструмента(Инструмент, Объект);
	Если ЗначениеЗаполнено(Объект) 
			И НЕ ЗначениеЗаполнено(ОбъектОбработки) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	СтрокаДублируется = Ложь;
	Для Каждого Строка Из Родитель.ПолучитьЭлементы() Цикл 
		
		Если Строка.Идентификатор = Инструмент
				И Строка.Объект = ОбъектОбработки Тогда
				
			СтрокаДублируется = Истина;
			Прервать;
			
		КонецЕсли;
				
	КонецЦикла;
	
	Если СтрокаДублируется Тогда
		Возврат Строка;
	КонецЕсли;
	
	НоваяСтрока = Родитель.ПолучитьЭлементы().Добавить();
	
	// Объект
	Если ТипЗнч(ОбъектОбработки) = Тип("Структура") Тогда
		
		ОбъектСписок = Новый СписокЗначений;
		ОбъектСписок.Добавить(ОбъектОбработки, ОбъектОбработки.Представление);
		
		НоваяСтрока.Объект = ОбъектОбработки.Значение;
		НоваяСтрока.ОбъектПредставление = ОбъектОбработки.Представление;
		
	Иначе
		
		НоваяСтрока.Объект = ОбъектОбработки;
		НоваяСтрока.ОбъектПредставление = ОбъектОбработки;
		
		ДобавлятьПояснение = ЗначениеЗаполнено(ОбъектОбработки)
								И ТипЗнч(ОбъектОбработки) <> Тип("СписокЗначений")
								И ТипЗнч(ОбъектОбработки) <> Тип("Строка");
		Если ДобавлятьПояснение Тогда
			
			ТипЗначенияОбъекта = ТипЗнч(ОбъектОбработки);
			НоваяСтрока.ОбъектКартинка = ИТК_Типы.Картинка(ТипЗначенияОбъекта);
			НоваяСтрока.ОбъектПояснение = ИТК_Типы.ПредставлениеТипа(ТипЗначенияОбъекта);
			
		КонецЕсли;
		
	КонецЕсли;
	
	// Инструмент
	ОписаниеИнструмента = ИТК_ТуллкитКлиентСервер.ОписаниеИнструмента(Инструмент);
	
	Если Порядок = Неопределено Тогда
		Порядок = ОписаниеИнструмента.Порядок;
	КонецЕсли;
	НоваяСтрока.Порядок = Порядок;
	
	НоваяСтрока.Идентификатор = Инструмент;
	НоваяСтрока.Картинка = ОписаниеИнструмента["Картинка"];
	
	ПредставлениеИнструмента = ОписаниеИнструмента[ИдентификаторПредставления];
	ПолноеПредставлениеИнструмента  = ПредставлениеИнструмента;
	Если ТипЗнч(ОбъектОбработки) = Тип("СписокЗначений") Тогда
		ПолноеПредставлениеИнструмента = ИТК_ФормаКлиентСервер.ЗаголовокСКоличеством(ПредставлениеИнструмента, ОбъектОбработки.Количество());
	КонецЕсли;
	НоваяСтрока.Представление = ПолноеПредставлениеИнструмента;
	НоваяСтрока.СочетаниеКлавиш = ИТК_ОбщийКлиентСервер.ПредставлениеСочетанияКлавиш(ОписаниеИнструмента.СочетаниеКлавиш);
	
	Возврат НоваяСтрока;
	
КонецФункции

&НаКлиенте
Процедура ВыбраноЗначение(Строка, СтандартнаяОбработка = Неопределено)
	
	Если Строка = Неопределено
			ИЛИ ЗначениеЗаполнено(Строка.ПолучитьЭлементы()) Тогда 
		Возврат;
	КонецЕсли;

	СтандартнаяОбработка = Ложь;
	Закрыть();
	
	ОткрытьФормуПоСтроке(Строка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПоСтроке(Строка)
	
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(Строка.Идентификатор, Строка.Объект);
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВДоступныеОперацииПоКонтексту(Родитель, НавигационнаяСсылка, Формы, Объекты)
	
	// Объект по навигационной ссылке
	Ссылка = ИТК_Общий.СсылкаПоНавигационнойСсылке(НавигационнаяСсылка);
	Если ЗначениеЗаполнено(Ссылка) Тогда
		ОбъектПоНавигационнойСсылке = Ссылка;
	Иначе
		ОбъектПоНавигационнойСсылке = ИТК_Метаданные.ОбъектПоНавигационнойСсылке(НавигационнаяСсылка);
	КонецЕсли;
	
	Если Объекты.Найти(ОбъектПоНавигационнойСсылке) = Неопределено Тогда
		Объекты.Добавить(ОбъектПоНавигационнойСсылке);
	КонецЕсли;
	
	// Активная форма
	ПорядокВСамомКонце = 100000;
	ИнструментМенеджерФорм = ИТК_Перечисления.ИнструментМенеджерФормы();
	Для Каждого ОписаниеФормы Из Формы Цикл 
		ДобавитьСтрокуВДоступныеОперации(ДоступныеОперации, ИнструментМенеджерФорм, , ОписаниеФормы, ПорядокВСамомКонце);
	КонецЦикла;
	
	// Другие объекты
	Для ИндексОбъекта = 0 По Объекты.ВГраница() Цикл 
		
		ПолеОбъекта = Объекты[ИндексОбъекта];
		Порядок = (ИндексОбъекта + 2) * 100;
		ОтдельнаяГруппаПоОбъекту = (Объекты.Количество() > 1) И НЕ ЗначениеЗаполнено(ОтборПоИнструменту);
		ДобавитьВДоступныеОперацииПоЗначению(Родитель, ПолеОбъекта, Истина, Порядок, ОтдельнаяГруппаПоОбъекту);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьВДоступныеОперацииПоЗначению(ОсновнойРодитель, Значение, ДоступноОткрытьЗначение = Ложь, Порядок = 0, ОтдельнаяГруппаПоОбъекту = Ложь)
	
	Если Значение = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТипЗначения = ТипЗнч(Значение);
	
	// Создание группы по объекту
	Если ОтдельнаяГруппаПоОбъекту Тогда
		
		Родитель = ОсновнойРодитель.ПолучитьЭлементы().Добавить();
		
		Если ТипЗначения = Тип("Массив") Тогда
			
			ПредставлениеГруппы = ИТК_ОбщийКлиентСервер.МассивВСписокЗначений(Значение);
			КартинкаГруппы = Новый Картинка;
			
		Иначе
			
			ПредставлениеГруппы = Значение;
			КартинкаГруппы = ИТК_Типы.Картинка(ТипЗначения);
			
		КонецЕсли;
		
		Родитель.Представление = ПредставлениеГруппы;
		Родитель.Картинка = КартинкаГруппы;
		Родитель.Порядок = Порядок;
		
	Иначе
		Родитель = ОсновнойРодитель;
	КонецЕсли;
	
	// Добавление доступных операций
	Если ТипЗначения = Тип("Массив") Тогда
		
		ЗначениеСписок = ИТК_ОбщийКлиентСервер.МассивВСписокЗначений(Значение);
		
		ИнструментыИЗначения = Новый СписокЗначений;
		ИнструментыИЗначения.Добавить(ЗначениеСписок, ИТК_Перечисления.ИнструментПоискИЗаменаСсылок());
		ИнструментыИЗначения.Добавить(ЗначениеСписок, ИТК_Перечисления.ИнструментСравнениеОбъектов());
		ИнструментыИЗначения.Добавить(ЗначениеСписок, ИТК_Перечисления.ИнструментЗафиксироватьИзмененияНаУзлах());
		ИнструментыИЗначения.Добавить(ЗначениеСписок, ИТК_Перечисления.ИнструментОбработкаВКонсолиКода());
		ИнструментыИЗначения.Добавить(ЗначениеСписок, ИТК_Перечисления.ИнструментЖурналРегистрации());
		
		ДобавитьДоступныеИнструментыПоЗначениям(Родитель, ИнструментыИЗначения, "ПредставленияДействияСписок", Порядок);
		
	Иначе
		
		ИнструментыИЗначения = Новый СписокЗначений;
		
		Если ТипЗначения = Тип("ОбъектМетаданных") Тогда
			
			ПолноеИмяОбъектаМетаданных = Значение.ПолноеИмя();
			
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментАнализПравДоступа(), ПолноеИмяОбъектаМетаданных);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментПодпискиНаСобытия(), ПолноеИмяОбъектаМетаданных);
			ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментМетаданные(), ПолноеИмяОбъектаМетаданных);
			
			ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(ПолноеИмяОбъектаМетаданных);
			Если НЕ (ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоОтчет(ИмяКоллекции)
						ИЛИ ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоОбработка(ИмяКоллекции)) Тогда
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментСтруктураХранения(), ПолноеИмяОбъектаМетаданных);
			КонецЕсли;
			
		Иначе
			
			Если ИТК_Метаданные.ЭтоКлючЗаписиНезависимогоРегистраСведений(Значение) Тогда
				
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментРедакторЗаписиНезависимогоРегистраСведений(),
					Неопределено, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментКопироватьНавигационнуюСсылку(),
					ПолноеИмяОбъектаМетаданных, Значение);
			Иначе
				
				ПолноеИмяОбъектаМетаданных = Значение.Метаданные().ПолноеИмя();
				
				ИмяКоллекцииМетаданных = ИТК_Метаданные.ИмяКоллекции(ПолноеИмяОбъектаМетаданных);
				ПолноеИмяЗначенияОбъектаМетаданных = ПолноеИмяОбъектаМетаданных;
				Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоПеречисление(ИмяКоллекцииМетаданных) Тогда
					ПолноеИмяЗначенияОбъектаМетаданных = ПолноеИмяОбъектаМетаданных + "." + XMLСтрока(Значение);
				КонецЕсли;
				
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментРедакторОбъекта(), ПолноеИмяОбъектаМетаданных, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментАнализПравДоступа(), ПолноеИмяОбъектаМетаданных);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментПоискСсылокНаОбъект(), ПолноеИмяОбъектаМетаданных, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментЗафиксироватьИзмененияНаУзлах(), ПолноеИмяОбъектаМетаданных, Значение);
				
				Если ДоступноОткрытьЗначение Тогда
					
					ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментОткрытьОбъект(),
						ПолноеИмяОбъектаМетаданных, Значение);
					
				КонецЕсли;	
				
				Если ИТК_БСПКлиентСервер.ЭтоСсылкаНаСправочникПользователи(Значение) Тогда
					ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментРедактированиеПользователяИБ(), ПолноеИмяОбъектаМетаданных, Значение);
				КонецЕсли;
				
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментЖурналРегистрации(), ПолноеИмяОбъектаМетаданных, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментОбработкаВКонсолиКода(), ПолноеИмяОбъектаМетаданных, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментПоискИЗаменаСсылок(), ПолноеИмяОбъектаМетаданных, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментПодпискиНаСобытия(), ПолноеИмяОбъектаМетаданных);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментМетаданные(), ПолноеИмяЗначенияОбъектаМетаданных);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментСтруктураХранения(), ПолноеИмяЗначенияОбъектаМетаданных);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментСравнениеОбъектов(), ПолноеИмяОбъектаМетаданных, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментФормаСписка(), ПолноеИмяОбъектаМетаданных, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментФормаСпискаУниверсальная(), ПолноеИмяОбъектаМетаданных, Значение);
				ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, ИТК_Перечисления.ИнструментКопироватьНавигационнуюСсылку(), ПолноеИмяОбъектаМетаданных, Значение);
				
			КонецЕсли;
		
		КонецЕсли;
		
		ДобавитьДоступныеИнструментыПоЗначениям(Родитель, ИнструментыИЗначения, "ПредставленияДействия", Порядок);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоступныеИнструментыПоЗначениям(Родитель, ИнструментыИЗначения, ИдентификаторПредставления, Порядок = Неопределено)
	
	Если Порядок = Неопределено Тогда
		Порядок = 1;
	КонецЕсли;
	
	Для Каждого ИнструментИЗначение Из ИнструментыИЗначения Цикл 
		
		Инструмент = ИнструментИЗначение.Представление;
		Значение = ИнструментИЗначение.Значение;
		
		ДобавитьСтрокуВДоступныеОперации(Родитель, Инструмент, ИдентификаторПредставления, Значение, Порядок);
		
		Порядок = Порядок + 1;
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ДобавитьДоступныйИнструментПоЗначению(ИнструментыИЗначения, Инструмент, ПолноеИмяОбъектаМетаданных, Значение = Неопределено);
	
	Если Значение = Неопределено Тогда
		
		Параметр = ПолноеИмяОбъектаМетаданных;
		ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(ПолноеИмяОбъектаМетаданных);
		
	Иначе
		
		Параметр = Значение;
		ИмяКоллекции = ИТК_Метаданные.ИмяКоллекции(ТипЗнч(Значение));
		
	КонецЕсли;
	
	ОписаниеИнструмента = ИТК_ТуллкитКлиентСервер.ОписаниеИнструмента(Инструмент);
	Если НЕ ОписаниеИнструмента["ДоступенДляПеречислений"] Тогда
		
		Если ИТК_МетаданныеКлиентСерверПовтИсп.ЭтоПеречисление(ИмяКоллекции) Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ИнструментыИЗначения.Добавить(Параметр, Инструмент);
	
КонецПроцедуры

#КонецОбласти
