#Область ОписаниеПеременных

&НаКлиенте
Перем ФоновыеЗаданияПоследнееВыделение;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьУсловноеОформление();
	ВидИнструмента = ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания();
	
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ДанныеРегламентныхЗаданий);
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ДанныеФоновыхЗаданий);
	
	Элементы.ГруппаБлокировкаРаботыСВнешнимиРесурсами.Видимость = ИТК_БСП.РаботаСВнешнимиРесурсамиЗаблокирована();
	
	ИТК_РегламентныеЗадания.ЗаполнитьСписокВыбора(Элементы.ОтборРегламентноеЗадание.СписокВыбора);
	ИТК_Перечисления.ЗаполнитьСписок(Элементы.ВидОтбораПоПериоду, ИТК_Перечисления.ВидыПериодовПолученияФоновыхЗаданий());
	
	ОтборПоказывать = 50;

	ОтборПоСостояниюЗавершено = Истина;
	ОтборПоСостояниюЗавершеноАварийно = Истина;
	ОтборПоСостояниюОтменено = Истина;
	ОтборПоСостояниюАктивно = Истина;

	Если Параметры.Свойство("Имя") Тогда
		РегламентныеЗаданияПоследнееВыделение = Новый Структура("Имя", Параметры.Имя);
	КонецЕсли;

	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭлементРодительКнопки", Элементы.РегламентныеЗаданияГруппаПрочиеДействия);
	ДополнительныеПараметры.Вставить("ГруппаКонтекстногоМеню", Элементы.ДанныеРегламентныхЗаданийКонтекстноеМенюГруппаИзбранное);
	ДополнительныеПараметры.Вставить("ЭлементВставкиКолонкиПеред", Элементы.ДанныеРегламентныхЗаданийСостояние);
	ИТК_Избранное.Инициализировать(ЭтотОбъект, "ДанныеРегламентныхЗаданий", ДополнительныеПараметры);
	
	ВидОтбораПоПериоду = ИТК_Перечисления.ВидПериодаПолученияФоновыхЗаданийВсеВремя();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтключитьТолькоИзбранные = ЗначениеЗаполнено(РегламентныеЗаданияПоследнееВыделение);
	ИТК_ИзбранноеКлиент.ПриОткрытии(ЭтотОбъект, Элементы.ДанныеРегламентныхЗаданий, ОтключитьТолькоИзбранные);
	
	ОбновитьРегламентныеЗадания();
	
	ПодключитьОбработчикОжидания("ПодключаемыйОбновлениеРегламентныхЗаданий", 60);
	ПодключитьОбработчикОжидания("ПодключаемыйОбновлениеФоновыхЗаданий", 60 * 5);
	ПодключитьОбработчикОжидания("ПодключаемыйОбновлениеДлительностиВыполняемыхРегламентныхЗаданий", 1);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "РазрешенаРаботаСВнешнимиРесурсами" Тогда
		
		Элементы.ГруппаБлокировкаРаботыСВнешнимиРесурсами.Видимость = Ложь;
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ИТК_Избранное.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	ИТК_Избранное.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура РасписаниеНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИзменитьРасписаниеРегламентногоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ПояснениеБлокировкаРаботыСВнешнимиРесурсамиОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ИТК_БСП.РазблокироватьРаботуСВнешнимиРесурсами();
	Оповестить("РазрешенаРаботаСВнешнимиРесурсами");
	
КонецПроцедуры

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если НЕ ЗначениеЗаполнено(КоличествоФоновыхЗаданий) Тогда
		ОбновитьФоновыеЗадания();
	КонецЕсли;
	
	Если ТекущаяСтраница = Элементы.СтраницаФоновыеЗадания Тогда 
		ТекущийЭлемент = Элементы.ДанныеФоновыхЗаданий;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОтборПоказыватьПриИзменении(Элемент)
	ОбновитьФоновыеЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	ОбновитьФоновыеЗадания();
КонецПроцедуры

&НаКлиенте
Процедура ОтборРегламентноеЗаданиеАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)
	ИТК_ФормаКлиент.ПоискПоСпискуВыбора(Элемент, Текст, ДанныеВыбора, СтандартнаяОбработка);
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораПоПериодуПриИзменении(Элемент)
	
	ТекущаяДатаСеанса = ИТК_ОбщийВызовСервера.ТекущаяДатаСервера();
	
	Если ВидОтбораПоПериоду = ИТК_Перечисления.ВидПериодаПолученияФоновыхЗаданийВсеВремя() Тогда
		
		ОтборПериодС  = Неопределено;
		ОтборПериодПо = Неопределено;
		
	ИначеЕсли ВидОтбораПоПериоду = ИТК_Перечисления.ВидПериодаПолученияФоновыхЗаданийПроизвольный() Тогда
		
		ОтборПериодС  = НачалоДня(ТекущаяДатаСеанса);
		ОтборПериодПо = КонецДня(ТекущаяДатаСеанса);
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	ОтборПриИзменении(Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура ВидОтбораПоПериодуОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеРегламентныхЗаданий

&НаКлиенте
Процедура ДанныеРегламентныхЗаданийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеРегламентныхЗаданий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		РегламентныеЗаданияПоследнееВыделение = Неопределено;
		Возврат;
		
	КонецЕсли;
	
	РегламентныеЗаданияПоследнееВыделение = Новый Структура("Идентификатор", ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРегламентныхЗаданийВыбор(Элемент, ИдентификаторВыбраннойСтроки, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ВыбраннаяСтрока = ДанныеРегламентныхЗаданий.НайтиПоИдентификатору(ИдентификаторВыбраннойСтроки);
	
	Обработано = ИТК_ИзбранноеКлиент.ОбработкаВыборВКоллекции(ВидИнструмента, ЭтотОбъект,
						"ДанныеРегламентныхЗаданий", Поле, ВыбраннаяСтрока, "Идентификатор");
	Если Обработано Тогда
		Возврат;	
	КонецЕсли;
	
	Если Поле = Элементы.ДанныеРегламентныхЗаданийРасписание Тогда
		ИзменитьРасписаниеРегламентногоЗадания(ВыбраннаяСтрока.Идентификатор);
	Иначе
		ДобавитьИзменитьРегламентноеЗадание(Ложь);
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ДанныеРегламентныхЗаданийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	ДобавитьИзменитьРегламентноеЗадание(Истина, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеРегламентныхЗаданийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	ДобавитьИзменитьРегламентноеЗадание(Ложь);

КонецПроцедуры

&НаКлиенте
Процедура ДанныеРегламентныхЗаданийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если Элемент.ТекущиеДанные.Предопределенное Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Невозможно удалить предопределенное регламентное задание';
									|en = 'Unable to delete predefined scheduled job'");
		ПоказатьПредупреждение(, ТекстПредупреждения, , ИТК_РегламентныеИФоновыеЗаданияКлиентСервер.Представление());
		Возврат;
		
	КонецЕсли;
	
	ТекстВопроса = НСтр("ru = 'Удалить регламентное задание?';
						|en = 'Delete scheduled job?'");
	Оповещение = Новый ОписаниеОповещения("УдалитьРегламентноеЗаданиеЗавершение", ЭтотОбъект);
	
	ПоказатьВопрос(Оповещение, ТекстВопроса, РежимДиалогаВопрос.ДаНет, , , ИТК_РегламентныеИФоновыеЗаданияКлиентСервер.Представление());
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыДанныеФоновыхЗаданий

&НаКлиенте
Процедура ДанныеФоновыхЗаданийПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ДанныеФоновыхЗаданий.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ФоновыеЗаданияПоследнееВыделение = Неопределено;
		Возврат;
		
	КонецЕсли;
	
	ФоновыеЗаданияПоследнееВыделение = Новый Структура("Идентификатор", ТекущиеДанные.Идентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ДанныеФоновыхЗаданийВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ОткрытьФоновоеЗадание();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ОбновитьРегламентныеЗадания(Команда = Неопределено)
	
	ДлительнаяОперацияРегламентныеЗадания = ОбновитьРегламентныеЗаданияНаСервере(УникальныйИдентификатор);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеРегламентныхЗаданий", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияРегламентныеЗадания, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ВключитьРегламентноеЗадание(Команда)
	
	УстановитьИспользованиеРегламентногоЗадания(Истина);
	ОбновитьРегламентныеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыключитьРегламентноеЗадание(Команда)
	
	УстановитьИспользованиеРегламентногоЗадания(Ложь);
	ОбновитьРегламентныеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗаданиеВФоне(Команда)
	
	ВыполнитьРегламентноеЗадание();
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьНеВФонеРегламентноеЗадание(Команда)
	
	ВыполнитьРегламентноеЗадание(Ложь);
		
КонецПроцедуры

&НаКлиенте
Процедура НастроитьРасписание(Команда)
	
	ИзменитьРасписаниеРегламентногоЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналРегистрацииПоРегламентномуЗаданию(Команда)
	
	ТекущиеДанные = Элементы.ДанныеРегламентныхЗаданий.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыЖурнала = Новый Структура;

	ОтборМетаданных = Новый СписокЗначений;
	ИмяРегламентногоЗадания = ИТК_РегламентныеЗадания.Имя(ТекущиеДанные.Идентификатор);
	ОтборМетаданных.Добавить("РегламентноеЗадание." + ИмяРегламентногоЗадания);
	
	ПараметрыЖурнала.Вставить("Метаданные", ОтборМетаданных);
	
	ИТК_ФормаКлиент.ОткрытьЖурналРегистрации(ПараметрыЖурнала);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТолькоИзбранные(Команда)
	
	ИТК_ИзбранноеКлиент.ОбработкаКомандыТолькоИзбранные(ЭтотОбъект, Элементы.ДанныеРегламентныхЗаданий);
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьВИзбранное(Команда)
	
	ИТК_ИзбранноеКлиент.ОбработкаКомандыДобавитьВИзбранное(ВидИнструмента, ЭтотОбъект,
							"ДанныеРегламентныхЗаданий", "Идентификатор");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьИзИзбранного(Команда)

	ИТК_ИзбранноеКлиент.ОбработкаКомандыУдалитьИзИзбранного(ВидИнструмента, ЭтотОбъект,
							"ДанныеРегламентныхЗаданий", "Идентификатор");
	
КонецПроцедуры

&НаКлиенте
Процедура ПерейтиКФоновымЗаданиям(Команда)
	
	ТекущиеДанные = Элементы.ДанныеРегламентныхЗаданий.ТекущиеДанные;
	Если Не ВыбраноРегламентноеЗадание(ТекущиеДанные) Тогда
		Возврат
	КонецЕсли;
	
	ТекущийЭлемент = Элементы.ДанныеФоновыхЗаданий;
	ОтборРегламентноеЗадание = ТекущиеДанные.Идентификатор;
	ОбновитьФоновыеЗадания();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФоновыеЗадания(Команда = Неопределено)
	
	Отбор = ОтборФоновыхЗаданий();
	ДлительнаяОперацияФоновыеЗадания = ОбновитьФоновыеЗаданияНаСервере(Отбор, УникальныйИдентификатор);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеФоновыхЗаданий", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияФоновыеЗадания, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФоновоеЗадание(Команда = Неопределено)

	ТекущиеДанные = Элементы.ДанныеФоновыхЗаданий.ТекущиеДанные;
	Если Не ВыбраноФоновоеЗадание(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Идентификатор", ТекущиеДанные.Идентификатор);
	
	ОткрытьФорму("Обработка.ИТК_РегламентныеИФоновыеЗадания.Форма.ФоновоеЗадание", ПараметрыФормы, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтменитьФоновоеЗадание(Команда)
	
	ТекущиеДанные = Элементы.ДанныеФоновыхЗаданий.ТекущиеДанные;
	Если Не ВыбраноФоновоеЗадание(ТекущиеДанные) Тогда
		Возврат;
	КонецЕсли;
	
	ОтмененоУспешно = ИТК_ФоновыеЗадания.Отменить(ТекущиеДанные.Идентификатор);
	
	Если ОтмененоУспешно Тогда
		ОбновитьФоновыеЗадания();
	КонецЕсли;
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ОбновитьРегламентныеЗаданияНаСервере(УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_РегламентныеЗадания.Данные", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеРегламентныхЗаданий(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперацияРегламентныеЗадания = Результат;
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьРегламентныеЗаданияНаФорме(Результат.АдресРезультата);
		ИТК_ФормаКлиент.ВосстановитьВыделениеТаблицы(ЭтотОбъект, "ДанныеРегламентныхЗаданий", РегламентныеЗаданияПоследнееВыделение);
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьРегламентныеЗаданияНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "ДанныеРегламентныхЗаданий");
	КоличествоРегламентныхЗаданий = ДанныеРегламентныхЗаданий.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	ИТК_ДлительныеОперацииКлиент.ОбновитьЭлементыОтображенияСостояния(ДлительнаяОперацияРегламентныеЗадания,
		Элементы.ДанныеРегламентныхЗаданий, Элементы.ОтображениеСостоянияПолученияРегламентныхЗаданий,
		НСтр("ru = 'Получение списка регламентных заданий...';
					|en = 'Getting a list of scheduled jobs...'"));
	
	ИТК_ДлительныеОперацииКлиент.ОбновитьЭлементыОтображенияСостояния(ДлительнаяОперацияФоновыеЗадания,
		Элементы.ДанныеФоновыхЗаданий, Элементы.ОтображениеСостоянияПолученияФоновыхЗаданий,
		НСтр("ru = 'Получение списка фоновых заданий...';
					|en = 'Getting a list of background jobs ...'"));
	
	ВидОтбораПериодПроизвольный = (ВидОтбораПоПериоду = ИТК_Перечисления.ВидПериодаПолученияФоновыхЗаданийПроизвольный());
	Элементы.УстановкаПроизвольногоПериода.Видимость = ВидОтбораПериодПроизвольный;
	
	ИспользуетсяБСП = ИТК_БСПКлиентСервер.ИспользуетсяБСП();
	Элементы.ДанныеРегламентныхЗаданийРаботаетСВнешнимиРесурсами.Видимость = ИспользуетсяБСП;
	Элементы.ДанныеРегламентныхЗаданийФункциональнаяОпция.Видимость = ИспользуетсяБСП;
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	ОформлениеЗаданиеЗавершеноСОшибками = Новый Структура;
	ОформлениеЗаданиеЗавершеноСОшибками.Вставить("ЦветТекста", ИТК_ОбщийКлиентСервер.ЦветТекстаВажнойГиперссылки());
	
	ОформлениеЗаданиеВыполняется = Новый Структура;
	ОформлениеЗаданиеВыполняется.Вставить("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	
	// РЕГЛАМЕНТНЫЕ ЗАДАНИЯ --------------------------------------------------------------
	
	// Выделение серым цветом и текстом Неопределено Состояние, ДатаНачала, ДатаОкончания, Длительность когда состояние неопределено
	Состояние = ИТК_Строки.ТекстНеопределено();
	
	ОформлениеНеопределено = Новый Структура;
	ОформлениеНеопределено.Вставить("ЦветТекста", ИТК_ОбщийКлиентСервер.ЦветТекстаНедоступно());
	ОформлениеНеопределено.Вставить("Текст", Состояние);
	
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийСостояние");
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийДатаНачала");
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийДатаОкончания");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, ОформлениеНеопределено, "ДанныеРегламентныхЗаданий.Состояние", Состояние);
	
	// Выделение серым цветом и текстом Неопределено ДатаОкончания, Длительность когда дата окончания пустая
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийДатаОкончания");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, ОформлениеНеопределено, "ДанныеРегламентныхЗаданий.ДатаОкончания", ИТК_ОбщийКлиентСервер.ПустаяДата());
	
	// Выделение красным Представления и Состояния когда задание завершено с ошибками
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийСостояние");
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийПредставление");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, ОформлениеЗаданиеЗавершеноСОшибками, "ДанныеРегламентныхЗаданий.Состояние", ИТК_Строки.ТекстЗаданиеЗавершеноСОшибками());
	
	// Выделение жирным Представление, ДатаОкончания, Состояние когда задание завершено выполняется
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийСостояние");
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийПредставление");
	ОформляемыеПоля.Добавить("ДанныеРегламентныхЗаданийДатаОкончания");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, ОформлениеЗаданиеВыполняется, "ДанныеРегламентныхЗаданий.Состояние", ИТК_Строки.ТекстЗаданиеВыполняется());
	
	// ФОНОВЫЕ ЗАДАНИЯ --------------------------------------------------------------
	
	// Выделение красным Представления и Состояния когда задание завершено с ошибками
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ДанныеФоновыхЗаданийСостояние");
	ОформляемыеПоля.Добавить("ДанныеФоновыхЗаданийПредставление");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, ОформлениеЗаданиеЗавершеноСОшибками, "ДанныеФоновыхЗаданий.Состояние", ИТК_Строки.ТекстЗаданиеЗавершеноСОшибками());
	
	// Выделение жирным Представление, ДатаОкончания, Состояние когда задание завершено выполняется
	ОформляемыеПоля = Новый Массив;
	ОформляемыеПоля.Добавить("ДанныеФоновыхЗаданийСостояние");
	ОформляемыеПоля.Добавить("ДанныеФоновыхЗаданийПредставление");
	ОформляемыеПоля.Добавить("ДанныеФоновыхЗаданийДатаОкончания");
	
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, ОформляемыеПоля, ОформлениеЗаданиеВыполняется, "ДанныеФоновыхЗаданий.Состояние", ИТК_Строки.ТекстЗаданиеВыполняется());
	
КонецПроцедуры

&НаСервере
Процедура УстановитьИспользованиеРегламентногоЗадания(Использование)
	
	Для Каждого ИдентификаторВыделеннойСтроки Из Элементы.ДанныеРегламентныхЗаданий.ВыделенныеСтроки Цикл
		
		ВыделеннаяСтрока = ДанныеРегламентныхЗаданий.НайтиПоИдентификатору(ИдентификаторВыделеннойСтроки);
		
		Свойства = Новый Структура;
		Свойства.Вставить("Идентификатор", ВыделеннаяСтрока.Идентификатор);
		Свойства.Вставить("Использование", Использование);
		ИТК_РегламентныеЗадания.Записать(Свойства);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыполнитьРегламентноеЗадание(ВыполнениеВФоне = Истина)
	
	ТекущиеДанные = Элементы.ДанныеРегламентныхЗаданий.ТекущиеДанные;
	Если Не ВыбраноРегламентноеЗадание(ТекущиеДанные) Тогда
		Возврат
	КонецЕсли;
	
	Если ТекущиеДанные.Параметризуемое Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Выбранное регламентное задание (параметрезуемое) нельзя выполнить вручную';
									|en = 'The selected scheduled task (parameterizable) cannot be executed manually'");
		ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_РегламентныеИФоновыеЗаданияКлиентСервер.Представление());
		Возврат;
		
	КонецЕсли;
	
	// Запуск на выполнение
	Идентификатор = ТекущиеДанные.Идентификатор;
	Результат = ЗапуститьРегламентноеЗадание(Идентификатор, ВыполнениеВФоне);
	
	Если ВыполнениеВФоне 
			И Результат.УжеВыполняется Тогда
		
		ШаблонПредупреждения = НСтр("ru = 'Процедура регламентного задания ""%1""
                                     |уже выполняется в фоновом задании';
                                     |en = 'Scheduled job procedure ''%1''
                                     |already running in background job'"); 
		ТекстПредупреждения = СтрШаблон(ШаблонПредупреждения, ТекущиеДанные.Предопределенное, Результат.ПредставлениеФоновогоЗадания, Результат.МоментЗапуска);
		ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_РегламентныеИФоновыеЗаданияКлиентСервер.Представление());
		Возврат;
		
	КонецЕсли;

	// Заполнение данных строке задание выполняется
	Если ВыполнениеВФоне И Результат.ЗапускВыполнен Тогда
		
		ТекущиеДанные.ДатаНачала = Результат.МоментЗапуска;
		ТекущиеДанные.ДатаОкончания = Неопределено;
		ТекущиеДанные.Состояние = ИТК_Строки.ТекстЗаданиеВыполняется();
		
	КонецЕсли;
	
	// Оповещение пользователю
	Если ВыполнениеВФоне Тогда
		ДополнениеПояснения = НСтр("ru = 'в фоновом задании';
									|en = 'in background job'");
	Иначе 
		ДополнениеПояснения = НСтр("ru = 'без фонового задания';
									|en = ' without background job'");
	КонецЕсли;
	ШаблонПояснения = НСтр("ru = '%1
                          |Процедура запущена %2';
                          |en = '%1
                          |Procedure started %2'");
	ТекстПояснения = СтрШаблон(ШаблонПояснения, ТекущиеДанные.Представление, ДополнениеПояснения);
	
	ТекстОповещения = НСтр("ru = 'Выполнена процедура регламентного задания'");
	ПоказатьОповещениеПользователя(ТекстОповещения, , ТекстПояснения);
	
КонецПроцедуры

&НаСервере
Функция ЗапуститьРегламентноеЗадание(Идентификатор, ВыполнениеВФоне)
	
	Результат = Неопределено;
	
	Если ВыполнениеВФоне Тогда
		Результат = ИТК_РегламентныеЗадания.ВыполнитьВручную(Идентификатор);
	Иначе
		
		УстановитьПривилегированныйРежим(Истина);
		
		РегламентноеЗадание = ИТК_РегламентныеЗадания.Получить(Идентификатор);
		ИмяМетода = РегламентноеЗадание.Метаданные.ИмяМетода;
		
		УстановитьПривилегированныйРежим(Ложь);
		
		ИТК_Общий.ВыполнитьПроцедуру(ИмяМетода, РегламентноеЗадание.Параметры, Ложь);
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ИзменитьРасписаниеРегламентногоЗадания(Знач Идентификатор = Неопределено)
	
	Если Идентификатор = Неопределено Тогда
		
		ТекущиеДанные = Элементы.ДанныеРегламентныхЗаданий.ТекущиеДанные;
		Идентификатор = ТекущиеДанные.Идентификатор;
		
	КонецЕсли;
	
	Расписание = ИТК_РегламентныеЗадания.Расписание(Идентификатор);
	ДиалогРасписанияРегламентногоЗадания = Новый ДиалогРасписанияРегламентногоЗадания(Расписание);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("Идентификатор", Идентификатор);
	Оповещение = Новый ОписаниеОповещения("ЗавершеноРедактированиеРасписания", ЭтотОбъект, ДополнительныеПараметры);
	
	ДиалогРасписанияРегламентногоЗадания.Показать(Оповещение);    	
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершеноРедактированиеРасписания(Расписание, ДополнительныеПараметры)Экспорт
	
	Если Расписание = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ДополнительныеПараметры.Идентификатор;
	Свойства = Новый Структура;
	Свойства.Вставить("Идентификатор", Идентификатор);
	Свойства.Вставить("Расписание", Расписание);
	ИТК_РегламентныеЗадания.Записать(Свойства);
	
	НайденнаяСтрока = НайтиСтрокуРегламентногоЗадания(Идентификатор);
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	НайденнаяСтрока.Расписание = ИТК_РегламентныеИФоновыеЗаданияКлиентСервер.ПредставлениеРасписания(Расписание);
	
КонецПроцедуры

&НаКлиенте
Процедура УдалитьРегламентноеЗаданиеЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат <> КодВозвратаДиалога.Да Тогда
		Возврат;
	КонецЕсли;
	
	ТекущиеДанные = Элементы.ДанныеРегламентныхЗаданий.ТекущиеДанные;
	Идентификатор = ТекущиеДанные.Идентификатор;
	
	ИТК_РегламентныеЗадания.Удалить(Идентификатор);
	
	// Ищем и удаляем строку
	НайденнаяСтрока = НайтиСтрокуРегламентногоЗадания(Идентификатор);
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ДанныеРегламентныхЗаданий.Удалить(НайденнаяСтрока);
	КоличествоРегламентныхЗаданий = ДанныеРегламентныхЗаданий.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ДобавитьИзменитьРегламентноеЗадание(Новое, Копирование = Ложь)
	
	ТекущиеДанные = Элементы.ДанныеРегламентныхЗаданий.ТекущиеДанные;
	СозданиеНового = Новое И Не Копирование;
	
	Если НЕ (СозданиеНового 
				ИЛИ ВыбраноРегламентноеЗадание(ТекущиеДанные)) Тогда
		Возврат;
	КонецЕсли;
	
	// Подготовка параметров
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Новое", Новое);
	ПараметрыФормы.Вставить("Копирование", Копирование);
	
	Идентификатор = Неопределено;
	Если ТекущиеДанные <> Неопределено Тогда
		Идентификатор = ТекущиеДанные.Идентификатор;
	КонецЕсли;
	ПараметрыФормы.Вставить("Идентификатор", Идентификатор);
	
	// Открытие формы
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершенаЗаписьРегламентногоЗадания", ЭтотОбъект);
	ОткрытьФорму("Обработка.ИТК_РегламентныеИФоновыеЗадания.Форма.РегламентноеЗадание", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершенаЗаписьРегламентногоЗадания(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Идентификатор = ИТК_ОбщийКлиентСервер.Свойство(Результат, "Идентификатор");
	
	НайденнаяСтрока = НайтиСтрокуРегламентногоЗадания(Идентификатор);
	Если НайденнаяСтрока = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_РегламентныеЗадания.Записать(Результат);
	
	// Определяем требуется ли полное обновление списка
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		ТребуетсяПолноеОбновление = (НайденнаяСтрока.Представление <> Результат.Наименование);
	Иначе
		ТребуетсяПолноеОбновление = Истина;
	КонецЕсли;
	
	Если ТребуетсяПолноеОбновление Тогда
		ОбновитьРегламентныеЗадания();
	Иначе
		ЗаполнитьЗначенияСвойств(НайденнаяСтрока, Результат);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция НайтиСтрокуРегламентногоЗадания(Идентификатор)
	
	Фильтр = Новый Структура("Идентификатор", Идентификатор);
	НайденныеСтроки = ДанныеРегламентныхЗаданий.НайтиСтроки(Фильтр);
	
	Если ЗначениеЗаполнено(НайденныеСтроки) Тогда
		
		Результат = НайденныеСтроки[0];
		
	Иначе
		
		Результат = Неопределено;
		
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ПодключаемыйОбновлениеРегламентныхЗаданий()
	
	ОбновитьРегламентныеЗадания();
	
КонецПроцедуры

&НаКлиенте
Функция ВыбраноРегламентноеЗадание(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Выберите регламентное задание';
									|en = 'Select a scheduled job'");
		ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_РегламентныеИФоновыеЗаданияКлиентСервер.Представление());
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаСервереБезКонтекста
Функция ОбновитьФоновыеЗаданияНаСервере(Отбор, УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыПроцедуры = Новый Структура;
	ПараметрыПроцедуры.Вставить("Отбор", Отбор);

	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_ФоновыеЗадания.Данные", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеФоновыхЗаданий(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперацияФоновыеЗадания = Результат;
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьФоновыеЗаданияНаФорме(Результат.АдресРезультата);
		ИТК_ФормаКлиент.ВосстановитьВыделениеТаблицы(ЭтотОбъект, "ДанныеФоновыхЗаданий", ФоновыеЗаданияПоследнееВыделение);
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьФоновыеЗаданияНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "ДанныеФоновыхЗаданий");
	КоличествоФоновыхЗаданий = ДанныеФоновыхЗаданий.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбновлениеФоновыхЗаданий()
	
	ОбновитьФоновыеЗадания();
	
КонецПроцедуры

&НаКлиенте
Функция ОтборФоновыхЗаданий()
	
	Результат = Новый Структура;
	
	Результат.Вставить("Показывать", ОтборПоказывать);
	
	Результат.Вставить("СостояниеЗавершено", ОтборПоСостояниюЗавершено);
	Результат.Вставить("СостояниеЗавершеноАварийно", ОтборПоСостояниюЗавершеноАварийно);
	Результат.Вставить("СостояниеОтменено", ОтборПоСостояниюОтменено);
	Результат.Вставить("СостояниеАктивно", ОтборПоСостояниюАктивно);
	
	Результат.Вставить("Период", ВидОтбораПоПериоду);
	Результат.Вставить("ПериодС", ОтборПериодС);
	Результат.Вставить("ПериодПо", ОтборПериодПо);
	
	Результат.Вставить("РегламентноеЗадание", ОтборРегламентноеЗадание);
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Функция ВыбраноФоновоеЗадание(ТекущиеДанные)
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ТекстПредупреждения = НСтр("ru = 'Выберите фоновое задание';
									|en = 'Select a background job'");
		ПоказатьПредупреждение( , ТекстПредупреждения, , ИТК_РегламентныеИФоновыеЗаданияКлиентСервер.Представление());
		Возврат Ложь;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

&НаКлиенте
Процедура ПодключаемыйОбновлениеДлительностиВыполняемыхРегламентныхЗаданий()
	
	ТекущаяДатаСеанса = ИТК_ОбщийВызовСервера.ТекущаяДатаСервера();
	Для Каждого СтрокаРегламентноеЗадание Из ДанныеРегламентныхЗаданий Цикл 
		
		Если ЗначениеЗаполнено(СтрокаРегламентноеЗадание.ДатаНачала)
				И НЕ ЗначениеЗаполнено(СтрокаРегламентноеЗадание.ДатаОкончания) Тогда
		
			ПериодВремени = ТекущаяДатаСеанса - СтрокаРегламентноеЗадание.ДатаНачала;
			СтрокаРегламентноеЗадание.Длительность = ИТК_ДатаВремя.ПредставлениеПериодаВремени(ПериодВремени);
		
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти
