#Область ПрограммныйИнтерфейс

Процедура Данные(Параметры, АдресРезультата) Экспорт
	
	Результат = Новый ТаблицаЗначений;
	
	Колонки = Результат.Колонки;
	Колонки.Добавить("Имя", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Колонки.Добавить("Идентификатор", ИТК_ТипыКлиентСервер.ОписаниеУникальныйИдентификатор());
	Колонки.Добавить("Использование", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("Представление", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Колонки.Добавить("Состояние", ИТК_ТипыКлиентСервер.ОписаниеСтрока(50));
	Колонки.Добавить("Расписание", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Колонки.Добавить("ДатаНачала", ИТК_ТипыКлиентСервер.ОписаниеДата());
	Колонки.Добавить("ДатаОкончания", ИТК_ТипыКлиентСервер.ОписаниеДата());
	Колонки.Добавить("Длительность", ИТК_ТипыКлиентСервер.ОписаниеСтрока(20));
	
	Колонки.Добавить("Предопределенное", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("Параметризуемое", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("Ключ", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Колонки.Добавить("ИмяПользователя", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	
	Колонки.Добавить("РаботаетСВнешнимиРесурсами", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Колонки.Добавить("ФункциональнаяОпция", ИТК_ТипыКлиентСервер.ОписаниеИмяМетаданных());
	
	ИТК_Избранное.ДополнитьКолонкиТаблицыЗначений(Результат);
	ВидИнструмента = ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания();
	ИзбранныеОбъекты = ИТК_Избранное.КоллекцияИзбранныеОбъекты(ВидИнструмента);
	
	ВсеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	Для Каждого РегламентноеЗадание Из ВсеРегламентныеЗадания Цикл 
		
		ОбъектМетаданных = РегламентноеЗадание.Метаданные;
		
		ДополнительнаяИнформацияБСП = ИТК_БСП.ДополнительнаяИнформацияПоРегламентномуЗаданию(ОбъектМетаданных);
		
		СкрываемоеРегламентноеЗадание = Не ДополнительнаяИнформацияБСП.ДоступноПоФункциональнымОпциям ИЛИ ДополнительнаяИнформацияБСП.ЗаданиеВМоделиСервиса;
		Если СкрываемоеРегламентноеЗадание Тогда
			Продолжить;
		КонецЕсли;
		
		НоваяСтрока = Результат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, РегламентноеЗадание);
		
		НоваяСтрока.Имя = ОбъектМетаданных.Имя;
		НоваяСтрока.Идентификатор = РегламентноеЗадание.УникальныйИдентификатор;
		НоваяСтрока.Представление = Представление(РегламентноеЗадание);
		НоваяСтрока.Расписание = ИТК_РегламентныеИФоновыеЗаданияКлиентСервер.ПредставлениеРасписания(РегламентноеЗадание.Расписание);
		
		ПоследнееФоновоеЗадание = ИТК_ФоновыеЗадания.Последнее(РегламентноеЗадание);
		Если ПоследнееФоновоеЗадание = Неопределено Тогда
			
			Состояние = ИТК_Строки.ТекстНеопределено();
			ДатаНачала = Неопределено;
			ДатаОкончания = Неопределено;
			Длительность = ИТК_Строки.ТекстНеопределено();
			
		Иначе
			
			Состояние = ПоследнееФоновоеЗадание.Состояние;
			ДатаНачала = ПоследнееФоновоеЗадание.Начало;
			ДатаОкончания = ПоследнееФоновоеЗадание.Конец;
			
			Если ДатаОкончания = Неопределено Тогда
				
				Длительность = ИТК_Строки.ТекстНеопределено();
				
			Иначе
				
				ДлительностьСекунд = ДатаОкончания - ДатаНачала;
				Длительность = ИТК_ДатаВремя.ПредставлениеПериодаВремени(ДлительностьСекунд);
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока.Состояние = Состояние;
		
		НоваяСтрока.ДатаНачала = ДатаНачала;
		НоваяСтрока.ДатаОкончания = ДатаОкончания;
		НоваяСтрока.Длительность = Длительность;
		
		// БСП
		НоваяСтрока.РаботаетСВнешнимиРесурсами = ДополнительнаяИнформацияБСП.РаботаетСВнешнимиРесурсами;
		НоваяСтрока.ФункциональнаяОпция = ДополнительнаяИнформацияБСП.ФункциональнаяОпция;
		
		ИТК_Избранное.ЗаполнитьСтрокуТаблицыЗначений(ИзбранныеОбъекты, НоваяСтрока, РегламентноеЗадание.УникальныйИдентификатор);
		
	КонецЦикла;
	
	Результат.Сортировать("Представление");
	ПоместитьВоВременноеХранилище(Результат, АдресРезультата);
	
КонецПроцедуры

// Возвращает РегламентноеЗадание из информационной базы.
// Не предназначена для использования в модели сервиса.
//
// Параметры:
//  РегламентноеЗадание - ОбъектМетаданных - объект метаданных регламентного задания для поиска
//  		                предопределенного регламентного задания.
//      		          - УникальныйИдентификатор - идентификатор регламентного задания.
//          		      - Строка - строка уникального идентификатора регламентного задания.
//              		  - РегламентноеЗадание - регламентное задание из которого нужно получить
//                  		уникальный идентификатор для получения свежей копии регламентного задания.
// 
// Возвращаемое значение:
//  РегламентноеЗадание - прочитано из базы данных.
//
Функция Получить(Знач Задание) Экспорт
	
	Если ТипЗнч(Задание) = Тип("РегламентноеЗадание") Тогда
		Идентификатор = Задание.УникальныйИдентификатор;
	ИначеЕсли ТипЗнч(Задание) = Тип("Строка") Тогда
		Идентификатор = Новый УникальныйИдентификатор(Задание);
	Иначе
		Идентификатор = Задание;
	КонецЕсли;
	
	
	Если ТипЗнч(Задание) = Тип("ОбъектМетаданных") Тогда
		Результат = РегламентныеЗадания.НайтиПредопределенное(Идентификатор);
	Иначе
		Результат = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(Идентификатор);
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		ВызватьИсключение(НСтр("ru = 'Регламентное задание не найдено.
		                              |Возможно, оно удалено другим пользователем.'") );
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция Представление(Задание) Экспорт
	
	Если Задание = Неопределено Тогда 
		Возврат ИТК_Строки.ТекстНеопределено();
	КонецЕсли;
	
		Результат = Задание.Наименование;
		Если НЕ ЗначениеЗаполнено(Результат) Тогда
			Результат = Задание.Метаданные.Представление();
		КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ВыполнитьВручную(Знач РегламентноеЗадание) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Задание = Получить(РегламентноеЗадание);
	ФоновоеЗадание = Задание.ПоследнееЗадание;
	
	ЗапускВыполнен = Ложь;
	УжеВыполняется = Ложь;
	Если ФоновоеЗадание <> Неопределено
	   		И ФоновоеЗадание.Состояние = СостояниеФоновогоЗадания.Активно Тогда
		
		УжеВыполняется = Истина;
		
	Иначе
		
		НаименованиеФоновогоЗадания = СтрШаблон(НСтр("ru = 'Запуск вручную: %1'"), Представление(Задание));
		КлючФоновогоЗадания = Строка(Задание.УникальныйИдентификатор);
		ФоновоеЗадание = ФоновыеЗадания.Выполнить(Задание.Метаданные.ИмяМетода, Задание.Параметры, КлючФоновогоЗадания, НаименованиеФоновогоЗадания);
		ЗапускВыполнен = Истина;
		
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Ложь);
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапускВыполнен", ЗапускВыполнен);
	Результат.Вставить("МоментЗапуска", ФоновоеЗадание.Начало);
	Результат.Вставить("УжеВыполняется", УжеВыполняется);
	
	Если ЗначениеЗаполнено(ФоновоеЗадание.Наименование) Тогда
		ПредставлениеФоновогоЗадания = ФоновоеЗадание.Наименование;
	Иначе
		ПредставлениеФоновогоЗадания = Представление(Задание);
	КонецЕсли;
	Результат.Вставить("ПредставлениеФоновогоЗадания", ПредставлениеФоновогоЗадания);
	
	Возврат Результат;
	
КонецФункции

Функция Расписание(Идентификатор) Экспорт
	
	Задание = Получить(Идентификатор);
	Возврат Задание.Расписание;
	
КонецФункции 

Функция Имя(Идентификатор) Экспорт
	
	Задание = Получить(Идентификатор);
	Возврат Задание.Метаданные.Имя;
	
КонецФункции 

Процедура Удалить(Идентификатор) Экспорт
	
	Задание = Получить(Идентификатор);
	Задание.Удалить();
	
КонецПроцедуры

Функция СообщенияИОписанияОшибок(РегламентноеЗадание) Экспорт

	ПоследнееЗадание = ИТК_ФоновыеЗадания.Последнее(РегламентноеЗадание);	
	Возврат ИТК_ФоновыеЗадания.СообщенияИОписанияОшибок(ПоследнееЗадание);
	
КонецФункции

Процедура Записать(Описание) Экспорт
	
	Идентификатор = ИТК_ОбщийКлиентСервер.Свойство(Описание, "Идентификатор");
	Если ЗначениеЗаполнено(Идентификатор) Тогда
		РегламентноеЗадание = Получить(Идентификатор);
	Иначе
		РегламентноеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(Описание.Метаданные);
	КонецЕсли;
	
	Если Описание.Свойство("Метаданные")
			И Описание.Свойство("Избранное") Тогда
			
		ВидИнструмента = ИТК_Перечисления.ИнструментРегламентныеИФоновыеЗадания();
		ИТК_Избранное.ЗаписатьВИзбранное(ВидИнструмента, Описание.Метаданные, Описание.Избранное);
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РегламентноеЗадание, Описание);
	РегламентноеЗадание.Записать();
	
КонецПроцедуры

Процедура ЗаполнитьСписокВыбора(Список) Экспорт
	
	Список.Очистить();
	
	ВсеРегламентныеЗадания = РегламентныеЗадания.ПолучитьРегламентныеЗадания();
	Для Каждого РегламентноеЗадание Из ВсеРегламентныеЗадания Цикл 
		
		Идентификатор = Строка(РегламентноеЗадание.УникальныйИдентификатор);
		Список.Добавить(Идентификатор, Представление(РегламентноеЗадание));
		
	КонецЦикла;
	
	Список.СортироватьПоПредставлению();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
