#Область ПрограммныйИнтерфейс

Функция РазрешеноРедактированиеОбъекта() Экспорт 
	
	ИменаРолейРазрешеноРедактирование = Новый Массив;
	ИменаРолейРазрешеноРедактирование.Добавить("ИТК_ПолныеПрава");
	ИменаРолейРазрешеноРедактирование.Добавить("ИТК_РедакторОбъекта");
	
	ИмяРоли = "АдминистраторСистемы";
	Если Метаданные.Роли.Найти(ИмяРоли) <> Неопределено Тогда
		ИменаРолейРазрешеноРедактирование.Добавить(ИмяРоли);
	КонецЕсли;
	
	ИмяРоли = "SystemAdministrator";
	Если Метаданные.Роли.Найти(ИмяРоли) <> Неопределено Тогда
		ИменаРолейРазрешеноРедактирование.Добавить(ИмяРоли);
	КонецЕсли;
	
	Для Каждого ИмяРолиРазрешеноРедактирование Из ИменаРолейРазрешеноРедактирование Цикл 
		
		Если РольДоступна(ИмяРолиРазрешеноРедактирование) Тогда
			Возврат Истина;
		КонецЕсли;
		
	КонецЦикла;

	Возврат Ложь;
	
КонецФункции

#КонецОбласти
