#Область ОписаниеПеременных

&НаКлиенте
Перем ТаймерЗакрытия;

&НаКлиенте
Перем ДанныеАвторизации;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Автозакрытие = 30;
	ИмяПользователя = Параметры.ИмяПользователя;
	УникальныйИдентификаторПользователя = Параметры.УникальныйИдентификаторПользователя;
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	ЗапуститьПриОткрытии = Параметры.ЗапуститьПриОткрытии;
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	Если ЗапуститьПриОткрытии Тогда
		Запуск(Неопределено);
	КонецЕсли;
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++

	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(ДанныеАвторизации) Тогда
		
		Отказ = Истина;
		ВернутьДанныеАвторизации();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Запуск(Команда)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ЗавершеноПолучениеРабочегоКаталогаДанныхПользователя", ЭтотОбъект);
	НачатьПолучениеРабочегоКаталогаДанныхПользователя(ОписаниеОповещения);
	
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	ЗапускНачался = Истина;
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
КонецПроцедуры

&НаКлиенте
Процедура АвтозакрытиеОтключено(Команда)
	
	Автозакрытие = 0;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Автозакрытие30(Команда)
	
	Автозакрытие = 30;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура Автозакрытие60(Команда)
	
	Автозакрытие = 60;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПодключаемыйВернутьДанныеАвторизации()
	
	Если ТаймерЗакрытия = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТаймерЗакрытия = ТаймерЗакрытия - 1;
	ОбновитьЭлементыФормы();
	
	Если ЗначениеЗаполнено(ТаймерЗакрытия) Тогда
		Возврат;
	КонецЕсли;
	
	Закрыть();
	
КонецПроцедуры

&НаКлиенте
Процедура ВернутьДанныеАвторизации()
	
	Если ЗначениеЗаполнено(ДанныеАвторизации) Тогда
		
		ВернутьДанныеАвторизацииПользователя(ДанныеАвторизации);
		ДанныеАвторизации = Неопределено;
		
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПодключаемыйЗакрытьПослеОжидания", 0.1, Истина);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ВернутьДанныеАвторизацииПользователя(ДанныеАвторизации)
	
	ПроверкаСложности = ПолучитьПроверкуСложностиПаролейПользователей();
	МинимальнаяДлинна = ПолучитьМинимальнуюДлинуПаролейПользователей();
	
	Попытка
		
		// Сама функция доступна с платформы 8.3.17, но
		// Пришлось сделать через попытку https://github.com/infostart-hub/toolkit/issues/1057
		ОграничениеПовторенияПаролей = Вычислить("ПолучитьОграничениеПовторенияПаролейПользователейСредиПоследних()");
		ПоддерживаетсяОграничениеПовторенияПаролей = Истина;
		
	Исключение
		ПоддерживаетсяОграничениеПовторенияПаролей = Ложь;
	КонецПопытки;
	
	Попытка
		
		УстановитьПроверкуСложностиПаролейПользователей(Ложь);
		УстановитьМинимальнуюДлинуПаролейПользователей(0);
		Если ПоддерживаетсяОграничениеПовторенияПаролей Тогда
			Выполнить("УстановитьОграничениеПовторенияПаролейПользователейСредиПоследних(0)");
		КонецЕсли;
		
		ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(ДанныеАвторизации.УникальныйИдентификатор);
		ЗаполнитьЗначенияСвойств(ПользовательИБ, ДанныеАвторизации, , "УникальныйИдентификатор");
		
		ПользовательИБ.Записать();
		
	Исключение
		
		Сообщить(НСтр("ru = 'Внимание! Не удалось вернуть данные авторизации пользователя.';
					|en = 'Attention! Failed to return user authorization data.'"));
		
	КонецПопытки;
	
	Если ПоддерживаетсяОграничениеПовторенияПаролей Тогда
		Выполнить("УстановитьОграничениеПовторенияПаролейПользователейСредиПоследних(ОграничениеПовторенияПаролей)");
	КонецЕсли;
	
	УстановитьМинимальнуюДлинуПаролейПользователей(МинимальнаяДлинна);
	УстановитьПроверкуСложностиПаролейПользователей(ПроверкаСложности);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйЗакрытьПослеОжидания()
	
	Закрыть();

КонецПроцедуры

&НаСервереБезКонтекста
Функция ПодменитьДанныеАвторизации(УникальныйИдентификаторПользователя)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УникальныйИдентификаторПользователя);
	
	Результат = Новый Структура;
	Результат.Вставить("УникальныйИдентификатор", ПользовательИБ.УникальныйИдентификатор);
	Результат.Вставить("АутентификацияСтандартная", ПользовательИБ.АутентификацияСтандартная);
	Результат.Вставить("ЗапрещеноИзменятьПароль", ПользовательИБ.ЗапрещеноИзменятьПароль);
	Результат.Вставить("СохраняемоеЗначениеПароля", ПользовательИБ.СохраняемоеЗначениеПароля);
	
	ПользовательИБ.АутентификацияСтандартная = Истина;
	ПользовательИБ.ЗапрещеноИзменятьПароль = Истина;
	
	СохраняемоеЗначениеПароля = "UFsxOq/KlPH4n3Txbhh6F6hgG+A=,aQp2yfJ4uMWBrAqjri9wVyXy/M4="; //Это хэш-функция строки "Qwerty123456789!"
	ПользовательИБ.СохраняемоеЗначениеПароля = СохраняемоеЗначениеПароля;
	
	ПользовательИБ.Записать();
	
	Возврат Результат;
	
КонецФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	Если ЗапускНачался Тогда
		ФормаЗапуск_Заголовок = НСтр(
			"ru = 'Запускается...';
			|en = 'Is running...'");
	Иначе
		ФормаЗапуск_Заголовок = НСтр(
			"ru = 'Запуск'
			|; en = 'Run'");
	КонецЕсли;
	Элементы.ФормаЗапуск.Заголовок = ФормаЗапуск_Заголовок;
	Элементы.ФормаЗапуск.Доступность = НЕ ЗапускНачался;

	Если ЗапускНачался Тогда
		ФормаЗакрыть_Заголовок = НСтр(
			"ru = 'Закрыть и восстановить пароль';
			|en = 'Close and restore password'");
	Иначе
		ФормаЗакрыть_Заголовок = НСтр(
			"ru = 'Закрыть'
			|; en = 'Close'");
	КонецЕсли;
	Элементы.ФормаЗакрыть.Заголовок = ИТК_ФормаКлиентСервер.ЗаголовокСКоличеством(ФормаЗакрыть_Заголовок, ТаймерЗакрытия);
	Элементы.ФормаЗакрыть.КнопкаПоУмолчанию = ЗапускНачался;
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
	Элементы.ФормаАвтозакрытиеОтключено.Пометка = (Автозакрытие = 0);
	Элементы.ФормаАвтозакрытие30.Пометка = (Автозакрытие = 30);
	Элементы.ФормаАвтозакрытие60.Пометка = (Автозакрытие = 60);
	
КонецПроцедуры

&НаКлиенте
Функция КомандаЗапуска(КаталогДанныхПользователя)
	
	ПараметрыКоманды = Новый Массив;
	
	ПараметрКоманды = СтрШаблон("/N""%1""", ИмяПользователя);
	ПараметрыКоманды.Добавить(ПараметрКоманды);
	
	// BSLLS:UsingHardcodeSecretInformation-off
	Пароль = "Qwerty123456789!";
	// BSLLS:UsingHardcodeSecretInformation-on
	ПараметрКоманды = СтрШаблон("/P""%1""", Пароль);
	ПараметрыКоманды.Добавить(ПараметрКоманды);
	
	Если ПодключитьКОтладке Тогда
		
		ПротоколОтладки = ПротоколОтладки(КаталогДанныхПользователя);
		ПараметрКоманды = СтрШаблон("/Debug -%1 -attach", ПротоколОтладки);
		ПараметрыКоманды.Добавить(ПараметрКоманды);
		
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ДополнительныеКлючи) Тогда
		ПараметрыКоманды.Добавить(ДополнительныеКлючи);
	КонецЕсли;
	
	Возврат СтрСоединить(ПараметрыКоманды, " ");
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноПолучениеРабочегоКаталогаДанныхПользователя(КаталогДанныхПользователя, ДополнительныеПараметры) Экспорт
	
	Если ЗначениеЗаполнено(Автозакрытие) Тогда
		ТаймерЗакрытия = Автозакрытие;
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПодключаемыйВернутьДанныеАвторизации", 1);
	Элементы.ГруппаДополнительныеКлючи.Доступность = Ложь;
	
	ДанныеАвторизации = ПодменитьДанныеАвторизации(УникальныйИдентификаторПользователя);
	
	// Запуск команды системы
	Команда = КомандаЗапуска(КаталогДанныхПользователя);
	#Если НЕ ВебКлиент Тогда
		ЗапуститьСистему(Команда);
	#КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Функция ПротоколОтладки(КаталогДанныхПользователя) Экспорт
	
	КаталогНастроекИБ = КаталогНастроекИнформационнойБазы(КаталогДанныхПользователя);
	ИмяФайлаНастроек = КаталогНастроекИБ + ПолучитьРазделительПути() + "1cv8.pfl";
	
	ЧтениеТекста = Новый ЧтениеТекста(ИмяФайлаНастроек);
	ТекстНастроек = ЧтениеТекста.Прочитать();
	ЧтениеТекста.Закрыть();
	
	СтрокаПоиска = "{""debuggerType"",
	|{""S"",""http""}";
	Если СтрНайти(ТекстНастроек, СтрокаПоиска) > 0 Тогда
		Результат = "http";
	Иначе
		Результат = "tcp";
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

&НаКлиенте
Функция КаталогНастроекИнформационнойБазы(КаталогДанныхПользователя) Экспорт
	
	РазделительПути = ПолучитьРазделительПути();
	
	ЧастиРезультата = Новый Массив;
	ЧастиПути = СтрРазделить(КаталогДанныхПользователя, РазделительПути, Ложь);
	Для Каждого ЧастьПути Из ЧастиПути Цикл
		
		ЧастиРезультата.Добавить(ЧастьПути);
		
		Если ИТК_Строки.ЭтоUID(ЧастьПути) Тогда
			Прервать;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтрСоединить(ЧастиРезультата, РазделительПути);
	
КонецФункции

#КонецОбласти
