#Область СлужебныйПрограммныйИнтерфейс

Функция ЗначениеНеопределено() Экспорт
	Возврат Новый ХранилищеЗначения(Неопределено);
КонецФункции

Функция ОписаниеЗначения(ПроизвольноеЗначение) Экспорт
	
	Если ТипЗнч(ПроизвольноеЗначение) = Тип("ХранилищеЗначения") Тогда
		Значение = ПроизвольноеЗначение.Получить();
	Иначе
		Значение = ПроизвольноеЗначение;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("Заполнено", (Значение <> Неопределено));
	
	Тип = ТипЗнч(Значение);
	ТипЗначения = ИТК_ТипыКлиентСервер.ОписаниеТиповПоТипу(Тип);
	Результат.Вставить("ТипЗначенияВКонтейнере", Новый ХранилищеЗначения(ТипЗначения));
	
	Результат.Вставить("ТипЗначения", ТипЗначения);
	
	РедактируетсяВПоле = ТипЗначенияРедактируетсяВПоле(Тип);
	Результат.Вставить("РедактируетсяВПоле", РедактируетсяВПоле);
	Если РедактируетсяВПоле Тогда
		Результат.Вставить("Значение", Значение);
	Иначе
		Результат.Вставить("Значение", ПредставлениеЗначения(Значение));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ПредставлениеЗначения(Значение) Экспорт
	
	Если ТипЗнч(Значение) = Тип("ХранилищеЗначения") Тогда
		
		ЗначенияХранилища = Значение.Получить();
		Шаблон = НСтр("ru = 'Хранилище значения (%1)'; en = 'Value storage (%1)'");
		Результат = СтрШаблон(Шаблон, ПредставлениеЗначения(ЗначенияХранилища));
		
	Иначе
		Результат = Строка(ТипЗнч(Значение));
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

Функция ТипЗначенияРедактируетсяВПоле(Тип) Экспорт
	
	ТипыРедактируемыеВОтдельномОкне = Новый Соответствие;
	
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("Массив"), Истина);
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("ФиксированныйМассив"), Истина);
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("Структура"), Истина);
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("ФиксированнаяСтруктура"), Истина);
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("Соответствие"), Истина);
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("ФиксированноеСоответствие"), Истина);
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("СписокЗначений"), Истина);
	
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("Картинка"), Истина);
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("ТаблицаЗначений"), Истина);
	ТипыРедактируемыеВОтдельномОкне.Вставить(Тип("ДвоичныеДанные"), Истина);
	
	Возврат (ТипыРедактируемыеВОтдельномОкне.Получить(Тип) = Неопределено);
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

