#Область ПрограммныйИнтерфейс

Функция ЗначенияСвойств(ЗначенияСвойствФормы, СортироватьПоАлфавиту) Экспорт
	
	Результат = Новый ДеревоЗначений;
	Результат.Колонки.Добавить("Имя", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Представление", ИТК_ТипыКлиентСервер.ОписаниеСтрока());
	Результат.Колонки.Добавить("Значение");
	Результат.Колонки.Добавить("Порядок", ИТК_ТипыКлиентСервер.ОписаниеЧисло(10));
	Результат.Колонки.Добавить("ТолькоПросмотр", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	Результат.Колонки.Добавить("ЭтоГруппа", ИТК_ТипыКлиентСервер.ОписаниеБулево());
	
	СтрокиГруппСвойст = Новый Соответствие;
	СвойстваФормы = ИТК_СвойстваФормыКлиентСервер.СоответствиеОписаниеСвойств();
	Для Каждого Свойство Из СвойстваФормы Цикл
		
		ОписаниеСвойства = Свойство.Значение;
		
		Если СортироватьПоАлфавиту Тогда
			СтрокаРодитель = Результат;
		Иначе
			
			СтрокаРодитель = СтрокиГруппСвойст.Получить(ОписаниеСвойства.Группа);
			Если СтрокаРодитель = Неопределено Тогда
				
				СтрокаРодитель = Результат.Строки.Добавить();
				СтрокаРодитель.Имя = Свойство.Ключ;
				СтрокаРодитель.Представление = ОписаниеСвойства.Группа;
				СтрокаРодитель.Порядок = ОписаниеСвойства.ГруппаПорядок;
				СтрокаРодитель.ЭтоГруппа = Истина;
				СтрокаРодитель.ТолькоПросмотр = Истина;
				
				СтрокиГруппСвойст.Вставить(ОписаниеСвойства.Группа, СтрокаРодитель);
				
			КонецЕсли;
			
		КонецЕсли;
		
		НоваяСтрока = СтрокаРодитель.Строки.Добавить();
		НоваяСтрока.Имя = Свойство.Ключ;
		НоваяСтрока.Представление = ОписаниеСвойства.Представление;
		НоваяСтрока.Порядок = ОписаниеСвойства.Порядок;
		НоваяСтрока.ТолькоПросмотр = ОписаниеСвойства.ТолькоПросмотр;
		НоваяСтрока.Значение = ЗначенияСвойствФормы.Получить(Свойство.Ключ);
		
	КонецЦикла;
	
	Если СортироватьПоАлфавиту Тогда
		Результат.Строки.Сортировать("Имя");
	Иначе
		Результат.Строки.Сортировать("Порядок", Истина);
	КонецЕсли;
	Результат.Колонки.Удалить("Порядок");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
