#Если ТонкийКлиент ИЛИ ТолстыйКлиентОбычноеПриложение ИЛИ ТолстыйКлиентУправляемоеПриложение ИЛИ ВебКлиент Тогда

#Область ОписаниеПеременных

Перем ИТК_глФормаВсеФункции Экспорт;

#КонецОбласти

#Область ОбработчикиСобытий

&Перед("ПриГлобальномПоиске")
Процедура ИТК_ПриГлобальномПоиске(СтрокаПоиска, ПланПоиска)
	
	Если НЕ ИТК_ГлобальныйПоискВызовСервера.ДоступноРасширениеПоиска() Тогда
		Возврат;
	КонецЕсли;
	
	// Поиск по гиперссылке
	Если ИТК_ГлобальныйПоискКлиентСервер.ПереопределяемыйПоискПоНавигационнойСсылке(СтрокаПоиска) Тогда
		
		ЭлементПланаДанные = ПланПоиска.Найти(ИТК_ГлобальныйПоискКлиентСервер.СтандартныйВидПоискаНавигационнаяСсылка());
		ПланПоиска.Удалить(ЭлементПланаДанные);
		
		ПланПоиска.Добавить("ПереопределениеСтандартногоПоискаНавигационнаяСсылка", "ИТК_ГлобальныйПоиск", Истина, , 10);
		
	КонецЕсли;
	
	// Поиск по ГУИД
	Если ИТК_Строки.ЭтоUID(СтрокаПоиска) Тогда
		ПланПоиска.Добавить("ПоискОбъектаПоГУИД", "ИТК_ГлобальныйПоиск", Истина);
	КонецЕсли;
	
	// Полнотекстовый поиск
	ЭлементПланаДанные = ПланПоиска.Найти(ИТК_ГлобальныйПоискКлиентСервер.СтандартныйВидПоискаДанные());
	ПланПоиска.Удалить(ЭлементПланаДанные);
	
	ВыполнятьВФоне = Истина;
	ПланПоиска.Добавить("ПереопределениеСтандартногоПоискаДанные", "ИТК_ГлобальныйПоиск", Истина, ВыполнятьВФоне, 90);
	
КонецПроцедуры

&После("ПриВыбореДействияРезультатаГлобальногоПоиска")
Процедура ИТК_ПриВыбореДействияРезультатаГлобальногоПоиска(ЭлементРезультата, Действие)
	
	ИТК_ГлобальныйПоискКлиент.ОбработчикПриВыбореДействия(ЭлементРезультата, Действие);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти

#КонецЕсли