#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.СформироватьПриОткрытии = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "НастройкиИзменены" Тогда
		
		// Обновить отчет
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура НастройкаПодключения(Команда)
	
	ИТК_ОбщийКлиент.ОткрытьНастройки(ЭтотОбъект, , "ПодключениеККластерам");
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНовоеОкно(Команда)
	
	ИТК_ФормаКлиент.ОткрытьНовую(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#КонецОбласти
