
#Область ПрограммныйИнтерфейс

Функция ИнициализацияРедактораJSON_ПриОткрытииФормы(Форма) Экспорт
	
	Для Каждого элК Из Форма._ОДМ_РедакторыJSON Цикл
		Форма[элК.Значение] = ОДМ_УправлениеФормами_Клиент_ПовтИсп.БазовыйФайлРедакторJSON();
	КонецЦикла;
	
	Форма.ПодключитьОбработчикОжидания("ИнициализацияРедактораJSON_ПриОткрытииФормы_Подключаемый", 0.1, Истина); //FIXME: надо форме дать полностью открыться
	
КонецФункции

Процедура ИнициализацияРедактораJSON_ПриОткрытииФормы_Подключаемый(Форма) Экспорт
	
	Для Каждого элК из Форма._ОДМ_РедакторыJSON Цикл
		РедакторJSON = Форма.Элементы[элК.Значение].Документ.defaultView.Init();
		РедакторJSON.menu.style.backgroundColor = "#617BE2";
		РедакторJSON.setText(Форма[элК.Представление]);
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти // ПрограммныйИнтерфейс
