
#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		ДатаСоздания = ТекущаяДатаСеанса();
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		Если ПустаяСтрока(Наименование) и ТехническиеПараметры.Количество() > 0 Тогда
			Наименование = ТехническиеПараметры[0].СтрокаПодключения;
		КонецЕсли;
		
		Для Каждого элКоллекции Из ТехническиеПараметры Цикл
			
			//TODO: парсим сервер, имя базы, может чего еще нужно
			
			элКоллекции.СтрокаПодключения = НРег(элКоллекции.СтрокаПодключения);
		КонецЦикла;
		
		Для Каждого элКоллекции Из Разрешения Цикл
			элКоллекции.Сервис = НРег(элКоллекции.Сервис);
		КонецЦикла;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти // ОбработчикиСобытий
