
#Область СобытияФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПрочитатьДанныеЗаписи();
	
	ОДМ_УправлениеФормами_Сервер.ИнициализацияРедактораJSON_ПриСозданииНаСервере(ЭтотОбъект, РеквизитыJSON());
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОДМ_УправлениеФормами_Клиент.ИнициализацияРедактораJSON_ПриОткрытииФормы(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // СобытияФормы

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура ИнициализацияРедактораJSON_ПриОткрытииФормы_Подключаемый()
	
	ОДМ_УправлениеФормами_Клиент.ИнициализацияРедактораJSON_ПриОткрытииФормы_Подключаемый(ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти // ПодключаемыеКоманды

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ПрочитатьДанныеЗаписи()
	
	ДанныеЗадачи = РегистрыСведений.ОДМ_ЗадачиОбмена.ДанныеЗадачи(Запись.Идентификатор);
	ПараметрыJSON = ОДМ_ОбменДанными.СериализоватьJSON(ДанныеЗадачи.Параметры);
	РезультатJSON = ОДМ_ОбменДанными.СериализоватьJSON(ДанныеЗадачи.Результат);
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция РеквизитыJSON()
	
	РезультатМетода = Новый Массив;
	РезультатМетода.Добавить("ПараметрыJSON");
	РезультатМетода.Добавить("РезультатJSON");
	
	Возврат РезультатМетода;
	
КонецФункции

#КонецОбласти // СлужебныеПроцедурыИФункции
