
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Записывает данные задач
//
// Входные параметры:
//   ДанныеЗадач - Массив из Структура, Структура - описание задач см. ОДМ_ОбменДанными.Конструктор_ОписаниеЗадачи()
Процедура ЗаписатьДанныеЗадач(Знач ДанныеЗадач) Экспорт
	
	Если ТипЗнч(ДанныеЗадач) = Тип("Структура") Тогда
		ДанныеЗадач = ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДанныеЗадач); //TODO: ОбщегоНазначенияКлиентСервер скопипастить в ОДМ_ОбщегоНазначенияКлиентСервер
	КонецЕсли;
	
	Для Каждого Задача Из ДанныеЗадач Цикл
		НаборЗадач = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьНаборЗаписей();
		НаборЗадач.Отбор.Идентификатор.Установить(Задача.Идентификатор);
		НоваяЗадача = НаборЗадач.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяЗадача, Задача, , "Параметры, Результат");
		
		НоваяЗадача.Параметры = Новый ХранилищеЗначения(Задача.Параметры);
		НоваяЗадача.Результат = Новый ХранилищеЗначения(Задача.Результат);
		
		НаборЗадач.Записать(Истина);
	КонецЦикла;
	
КонецПроцедуры

Функция ДанныеЗадачи(Знач Идентификатор) Экспорт
	
	РезультатМетода = ОДМ_ОбменДанными.Конструктор_ОписаниеЗадачи();
	
	Задача = РегистрыСведений.ОДМ_ЗадачиОбмена.СоздатьМенеджерЗаписи();
	Задача.Идентификатор = Идентификатор;
	Задача.Прочитать();
	
	ЗаполнитьЗначенияСвойств(РезультатМетода, Задача, , "Параметры, Результат");
	РезультатМетода.Параметры = Задача.Параметры.Получить();
	РезультатМетода.Результат = Задача.Результат.Получить();
	
	Возврат РезультатМетода;
	
КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс

#КонецЕсли