#Область ПрограммныйИнтерфейс

Процедура ДополнитьВидыКоманд(Результат) Экспорт
	
	Если НЕ ИТК_ИнтеграцияВКонфигурацию.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	// Добавляем наше подменю
	ПолеВидГруппыФормы = "ВидГруппыФормы";
	ПолеИмя = "Имя";
	ПолеИмяПодменю = "ИмяПодменю";
	ПолеЗаголовок = "Заголовок";
	ПолеКартинка = "Картинка";
	ПолеОтображение = "Отображение";
	ПолеПолеИмяПодменю = "Порядок";

	Если ИТК_БСППовтИсп.АнглийскаяБСП() Тогда
		
		ПолеВидГруппыФормы = "FormGroupType";
		ПолеИмя = "Name";
		ПолеИмяПодменю = "SubmenuName";
		ПолеЗаголовок = "Title";
		ПолеКартинка = "Picture";
		ПолеОтображение = "Representation";
		ПолеПолеИмяПодменю = "Order";
		
	КонецЕсли;
	
	НовыйВидКоманды = Результат.Добавить();
	Попытка
		НовыйВидКоманды[ПолеВидГруппыФормы] = ВидГруппыФормы.Подменю;
	Исключение
		// Ошибка на БСП 2.3 при открытии документа Анкета
	КонецПопытки;
	
	ИдентификаторПодменю = ИТК_ИнтеграцияВКонфигурациюКлиентСервер.ИдентификаторПодменю();
	НовыйВидКоманды[ПолеИмя] = ИдентификаторПодменю;
	НовыйВидКоманды[ПолеИмяПодменю] = ИдентификаторПодменю;
	
	НовыйВидКоманды[ПолеЗаголовок] = ИТК_ТуллкитКлиентСервер.Представление();
	НовыйВидКоманды[ПолеКартинка] = БиблиотекаКартинок.ИТК_Подсистема;
	НовыйВидКоманды[ПолеОтображение] = ОтображениеКнопки.Картинка;
	НовыйВидКоманды[ПолеПолеИмяПодменю] = 1000;
	
КонецПроцедуры

Процедура ДополнитьКоманды(Команды) Экспорт
	
	Если НЕ ИТК_ИнтеграцияВКонфигурацию.Используется() Тогда
		Возврат;
	КонецЕсли;
	
	// Добавляем наши команды
	ИдентификаторПодменю = ИТК_ИнтеграцияВКонфигурациюКлиентСервер.ИдентификаторПодменю();
	
	ОписаниеИнструментов = ИТК_ТуллкитПовтИсп.СоответствиеОписаниеИнструментов();
	Для Каждого КлючЗначение Из ОписаниеИнструментов Цикл 
		
		ОписаниеИнструмента = КлючЗначение.Значение;
		
		Если НЕ (ОписаниеИнструмента["Доступ"]
					И ЗначениеЗаполнено(ОписаниеИнструмента["БСПИнтеграцияОбработчик"])) Тогда
			Продолжить;
		КонецЕсли;
		
		ПараметрыКоманды = Новый Структура;
		ПараметрыКоманды.Вставить("Представление", ОписаниеИнструмента["Представление"]);
		ПараметрыКоманды.Вставить("Обработчик", ОписаниеИнструмента["БСПИнтеграцияОбработчик"]);
		ПараметрыКоманды.Вставить("Порядок", ОписаниеИнструмента["Порядок"]);
		ПараметрыКоманды.Вставить("Картинка", ОписаниеИнструмента["Картинка"]);
		ПараметрыКоманды.Вставить("МножественныйВыбор", ОписаниеИнструмента["Множественный"]);
		ПараметрыКоманды.Вставить("ТребуетсяЗапись", ОписаниеИнструмента["БСПИнтеграцияОбработчикТребуетсяЗапись"]);
		
		ДобавитьКоманду(Команды, ИдентификаторПодменю, ПараметрыКоманды);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ДобавитьКоманду(Команды, ИдентификаторПодменю, ПараметрыКоманды)
	
	ПолеВид = "Вид";
	ПолеПредставление = "Представление";
	ПолеОбработчик = "Обработчик";
	ПолеКартинка = "Картинка";
	ПолеМножественныйВыбор = "МножественныйВыбор";
	ПолеРежимЗаписи = "РежимЗаписи";
	ПолеИзменяетВыбранныеОбъекты = "ИзменяетВыбранныеОбъекты";
	ПолеПорядок = "Порядок";
	
	Если ИТК_БСППовтИсп.АнглийскаяБСП() Тогда
		
		ПолеВид = "Kind";
		ПолеПредставление = "Presentation";
		ПолеОбработчик = "Handler";
		ПолеКартинка = "Picture";
		ПолеМножественныйВыбор = "MultipleChoice";
		ПолеРежимЗаписи = "WriteMode";
		ПолеИзменяетВыбранныеОбъекты = "ChangesSelectedObjects";
		ПолеПорядок = "Order";
		
	КонецЕсли;
	
	НоваяКоманда = Команды.Добавить();
	НоваяКоманда[ПолеВид] = ИдентификаторПодменю;
	НоваяКоманда[ПолеПредставление] = ПараметрыКоманды.Представление;
	НоваяКоманда[ПолеОбработчик] = ПараметрыКоманды.Обработчик;
	НоваяКоманда[ПолеКартинка] = ПараметрыКоманды.Картинка;
	НоваяКоманда[ПолеМножественныйВыбор] = ПараметрыКоманды.МножественныйВыбор;
	НоваяКоманда[ПолеИзменяетВыбранныеОбъекты] = Ложь;
	НоваяКоманда[ПолеПорядок] = ПараметрыКоманды.Порядок;
	
	Если ПараметрыКоманды.ТребуетсяЗапись Тогда
		РежимЗаписи = Неопределено;
	Иначе
		
		РежимЗаписи = "ЗаписыватьТолькоНовые";
		Если ИТК_БСППовтИсп.АнглийскаяБСП() Тогда
			РежимЗаписи = "WriteNewOnly";
		КонецЕсли;
		
	КонецЕсли;
	НоваяКоманда[ПолеРежимЗаписи] = РежимЗаписи;
	
КонецПроцедуры

#КонецОбласти
