#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.Пользователи);

	ПользователиИБ = ПользователиИнформационнойБазы.ПолучитьПользователей();
	ВыбранныеПользователи = Параметры.Выбранные;
	Для Каждого ПользовательИБ Из ПользователиИБ Цикл
		
		НоваяСтрока = Пользователи.Добавить();
		НоваяСтрока.Пометка = НЕ ЗначениеЗаполнено(ВыбранныеПользователи)
								ИЛИ ВыбранныеПользователи.НайтиПоЗначению(ПользовательИБ.УникальныйИдентификатор) <> Неопределено;
		
		ЗаполнитьЗначенияСвойств(НоваяСтрока, ПользовательИБ);

	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Выбрать(Команда)
	
	ВыбранныеПользователи = ВыбранныеПользователи();
	КоличествоВыбранных = ВыбранныеПользователи.Количество(); 

	Если КоличествоВыбранных = 0 Тогда
		
		ПоказатьПредупреждение( , НСтр("ru = 'Необходимо выбрать пользователей'; en = 'Users must be selected'"));
		Возврат;
		
	КонецЕсли;
	
	Результат = Новый СписокЗначений;
	Если КоличествоВыбранных <> Пользователи.Количество() Тогда
		
		Для Каждого СтрокаПользователь Из ВыбранныеПользователи Цикл 
			Результат.Добавить(СтрокаПользователь.УникальныйИдентификатор, СтрокаПользователь.ПолноеИмя);
		КонецЦикла;
		
	КонецЕсли;
	
	Закрыть(Результат);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьВсе(Команда)
	УстановитьПометки();
КонецПроцедуры

&НаКлиенте
Процедура СнятьВсе(Команда)
	УстановитьПометки(Ложь);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	ЗаголовокВыбрать = НСтр("ru = 'Выбрать'; en = 'Select'");
	КоличествоВыбранных = ВыбранныеПользователи().Количество(); 
	Элементы.ФормаВыбрать.Заголовок = ИТК_ФормаКлиентСервер.ЗаголовокСКоличеством(ЗаголовокВыбрать, КоличествоВыбранных);
	
КонецПроцедуры

&НаКлиенте
Процедура УстановитьПометки(Пометка = Истина)
	
	Модифицированность = Истина;
	ИТК_ФормаКлиент.УстановитьПометки(Пользователи, Пометка);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Функция ВыбранныеПользователи()
	
	Результат = Новый Массив;
	Для Каждого СтрокаПользователь Из Пользователи Цикл 
		
		Если НЕ СтрокаПользователь.Пометка Тогда
			Продолжить;
		КонецЕсли;
		
		Результат.Добавить(СтрокаПользователь);
		
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти
