#Область ОписаниеПеременных

&НаКлиенте
Перем ПользователиПоследнееВыделение;

&НаКлиенте
Перем ВнешниеПользователиПоследнееВыделение;

&НаКлиенте
Перем АктивныеПользователиПоследнееВыделение;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ЭлементРодительКнопки", Элементы.ПользователиИБГруппаОтбор);
	ДополнительныеПараметры.Вставить("ГруппаКонтекстногоМеню", Элементы.ПользователиИБКонтекстноеМенюГруппаИзбранное);
	ДополнительныеПараметры.Вставить("ЭлементВставкиКолонкиПеред", Элементы.ПользователиИБПользователь);
	ИТК_Избранное.Инициализировать(ЭтотОбъект, "ПользователиИБ", ДополнительныеПараметры);
	
	ОтображатьОтключенных = Истина;
	ОтображатьНедействительныхВнешнихПользователей = Истина;
	ВидИнструмента = ИТК_Перечисления.ИнструментПользователи();
	
	НачальнаяСтраница = ИТК_ОбщийКлиентСервер.Свойство(Параметры, "НачальнаяСтраница");
	Если ЗначениеЗаполнено(НачальнаяСтраница) Тогда
		Элементы.Страницы.ТекущаяСтраница = Элементы["Страница" + НачальнаяСтраница];
	КонецЕсли;
	
	ОбновитьЭлементыФормыПриСозданииНаСервере();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ИТК_ОбщийКлиент.ОбработчикПриОткрытии(Отказ);
	
	ИТК_ИзбранноеКлиент.ПриОткрытии(ЭтотОбъект, Элементы.ПользователиИБ);
	
	ОбновитьПользователей();
	ОбновитьВнешнихПользователей();

	Если Элементы.Страницы.ТекущаяСтраница = Элементы.СтраницаАктивныеПользователи Тогда
		ОбновитьАктивныхПользователейИБ();
	КонецЕсли;
	
	ПодключитьОбработчикОжидания("ПодключаемыйОбновлениеПользователей", 60);
	ПодключитьОбработчикОжидания("ПодключаемыйОбновлениеВнешнихПользователей", 120);
	ПодключитьОбработчикОжидания("ПодключаемыйОбновлениеАктивныхПользователей", 60);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "ИТК_ПользовательИБ_Записан" Тогда
		ОбновитьПользователей();
	ИначеЕсли ИмяСобытия = "Запись_ВнешниеПользователи" Тогда
		ОбновитьВнешнихПользователей();
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеДанныхИзНастроекНаСервере(Настройки)
	
	ИТК_Избранное.ПриЗагрузкеДанныхИзНастроекНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииДанныхВНастройкахНаСервере(Настройки)
	
	ИТК_Избранное.ПриСохраненииДанныхВНастройкахНаСервере(ЭтотОбъект, Настройки);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтраницыПриСменеСтраницы(Элемент, ТекущаяСтраница)
	
	Если Не ЗначениеЗаполнено(КоличествоАктивныхПользователей) Тогда
		ОбновитьАктивныхПользователейИБ();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПользователиИБ

&НаКлиенте
Процедура ПользователиИБПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ПользователиИБ.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ПользователиПоследнееВыделение = Неопределено;
		Возврат;

	КонецЕсли;          	
	
	ПользователиПоследнееВыделение = Новый Структура("Пользователь", ТекущиеДанные.Пользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура ПользователиИБВыбор(Элемент, ИдентификаторВыбраннойСтроки, Поле, СтандартнаяОбработка)

	ВыбраннаяСтрока = ПользователиИБ.НайтиПоИдентификатору(ИдентификаторВыбраннойСтроки);
	
	Обработано = ИТК_ИзбранноеКлиент.ОбработкаВыборВКоллекции(ВидИнструмента, ЭтотОбъект,
						"ПользователиИБ", Поле, ВыбраннаяСтрока, "УникальныйИдентификатор");
	Если Обработано Тогда
		Возврат;	
	КонецЕсли;
	
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(ИТК_Перечисления.ИнструментРедактированиеПользователяИБ(),
												ВыбраннаяСтрока.УникальныйИдентификатор, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормынешниеПользователи

&НаКлиенте
Процедура ВнешниеПользователиВыбор(Элемент, ИдентификаторВыбраннойСтроки, Поле, СтандартнаяОбработка)
	
	ВыбраннаяСтрока = ВнешниеПользователи.НайтиПоИдентификатору(ИдентификаторВыбраннойСтроки);
	ПоказатьЗначение( , ВыбраннаяСтрока.Ссылка);

КонецПроцедуры

&НаКлиенте
Процедура ВнешниеПользователиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.ВнешниеПользователи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		ВнешниеПользователиПоследнееВыделение = Неопределено;
		Возврат;
		
	КонецЕсли;
	
	ВнешниеПользователиПоследнееВыделение = Новый Структура("Ссылка", ТекущиеДанные.Ссылка);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыАктивныеПользователи

&НаКлиенте
Процедура АктивныеПользователиПриАктивизацииСтроки(Элемент)
	
	ТекущиеДанные = Элементы.АктивныеПользователи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		
		АктивныеПользователиПоследнееВыделение = Неопределено;
		Возврат;
		
	КонецЕсли;
	
	АктивныеПользователиПоследнееВыделение = Новый Структура("Пользователь", ТекущиеДанные.Пользователь);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивныеПользователиВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ВыбранныеДанные = АктивныеПользователи.НайтиПоИдентификатору(ВыбраннаяСтрока);
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(ИТК_Перечисления.ИнструментРедактированиеПользователяИБ(),
											ВыбранныеДанные.УникальныйИдентификатор, ЭтотОбъект);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Обновить(Команда)
	
	ОбновитьПользователей();
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьОтключенных(Команда)
	
	ОтображатьОтключенных = НЕ ОтображатьОтключенных;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьВнешнихПользователей(Команда = Неопределено)
	
	Если НЕ ИспользуютсяВнешниеПользователи Тогда
		Возврат;
	КонецЕсли;
	
	ДлительнаяОперацияВнешниеПользователи = ОбновитьВнешнихПользователейНаСервере(УникальныйИдентификатор);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеВнешнихПользователей", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияВнешниеПользователи, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПодВнешнимПользователем(Команда)
	
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	ЗапуститьПодПользователемУниверсальная(Элементы.ВнешниеПользователи);
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПодВнешнимПользователемСНастройками(Команда)
	
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	ЗапуститьПодПользователемУниверсальная(Элементы.ВнешниеПользователи, Ложь);
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналРегистрацииПоВнешнемуПользователю(Команда)
	
	ТекущиеДанные = Элементы.ВнешниеПользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	
	ИмяПользователяИБ = ИмяПользователяИБПоУникальномуИдентификатору(ТекущиеДанные.ИдентификаторПользователяИБ);
	ПараметрыФормы.Вставить("Пользователь", ИмяПользователяИБ);
	
	ИТК_ФормаКлиент.ОткрытьЖурналРегистрации(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтображатьНедействительныхВнешнихПользователей(Команда)
	
	ОтображатьНедействительныхВнешнихПользователей = НЕ ОтображатьНедействительныхВнешнихПользователей;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьВнешнегоПользователя(Команда)
	
	ТекущиеДанные = Элементы.ВнешниеПользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение( , ТекущиеДанные.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьОбъектАвторизацииВнешнегоПользователя(Команда)
	
	ТекущиеДанные = Элементы.ВнешниеПользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПоказатьЗначение( , ТекущиеДанные.ОбъектАвторизации);
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьПользователиИБВнешнегоПользователя(Команда)
	
	ТекущиеДанные = Элементы.ВнешниеПользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_ТуллкитКлиент.ОткрытьИнструмент(ИТК_Перечисления.ИнструментРедактированиеПользователяИБ(),
											ТекущиеДанные.ИдентификаторПользователяИБ, ЭтотОбъект);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАктивныхПользователей(Команда)
	
	ОбновитьАктивныхПользователейИБ();
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналРегистрацииПоПользователю(Команда)
	
	ТекущиеДанные = Элементы.ПользователиИБ.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователь", ТекущиеДанные.Пользователь);
	
	ИТК_ФормаКлиент.ОткрытьЖурналРегистрации(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура ЖурналРегистрацииПоАктивномуПользователю(Команда)
	
	ТекущиеДанные = Элементы.АктивныеПользователи.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("Пользователь", ТекущиеДанные.Пользователь);
	
	ИТК_ФормаКлиент.ОткрытьЖурналРегистрации(ПараметрыФормы);
	
КонецПроцедуры

&НаКлиенте
Процедура Пользователи_ОткрытьПользователяБСП(Команда)
	
	ТекущиеДанные = Элементы.ПользователиИБ.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_БСПКлиент.ОткрытьПользователяБСП(ТекущиеДанные.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура АктивныеПользователи_ОткрытьПользователяБСП1(Команда)
	
	ТекущиеДанные = Элементы.АктивныеПользователи.ТекущиеДанные;
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ИТК_БСПКлиент.ОткрытьПользователяБСП(ТекущиеДанные.УникальныйИдентификатор);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПодПользователем(Команда)
	
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	ЗапуститьПодПользователемУниверсальная(Элементы.ПользователиИБ);
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПодПользователемСНастройками(Команда)

	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	ЗапуститьПодПользователемУниверсальная(Элементы.ПользователиИБ, Ложь);
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ТолькоИзбранные(Команда)
	
	ИТК_ИзбранноеКлиент.ОбработкаКомандыТолькоИзбранные(ЭтотОбъект, Элементы.ПользователиИБ);
	ОбновитьЭлементыФормы();

КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДобавитьВИзбранное(Команда)
	
	ИТК_ИзбранноеКлиент.ОбработкаКомандыДобавитьВИзбранное(ВидИнструмента, ЭтотОбъект,
							"ПользователиИБ", "УникальныйИдентификатор");
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_УдалитьИзИзбранного(Команда)

	ИТК_ИзбранноеКлиент.ОбработкаКомандыУдалитьИзИзбранного(ВидИнструмента, ЭтотОбъект,
							"ПользователиИБ", "УникальныйИдентификатор");
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ОбновитьПользователей()
	
	ДлительнаяОперация = ОбновитьПользователейНаСервере(УникальныйИдентификатор);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеПользователей", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьПользователейНаСервере(УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_Пользователи.ДанныеПользователей", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеПользователей(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперация = Результат;
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьПользователейНаФорме(Результат.АдресРезультата);
		ИТК_ФормаКлиент.ВосстановитьВыделениеТаблицы(ЭтотОбъект, "ПользователиИБ", ПользователиПоследнееВыделение);
		
	КонецЕсли;
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьПользователейНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "ПользователиИБ");
	КоличествоПользователей = ПользователиИБ.Количество();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьВнешнихПользователейНаСервере(УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_Пользователи.ДанныеВнешнихПользователей", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеВнешнихПользователей(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперацияВнешниеПользователи = Результат;
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьВнешнихПользователейНаФорме(Результат.АдресРезультата);
		ИТК_ФормаКлиент.ВосстановитьВыделениеТаблицы(ЭтотОбъект, "ВнешниеПользователи", ВнешниеПользователиПоследнееВыделение);
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьВнешнихПользователейНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "ВнешниеПользователи");
	КоличествоВнешнихПользователей = ВнешниеПользователи.Количество();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьАктивныхПользователейИБ()
	
	ДлительнаяОперацияАктивныеПользователи = ОбновитьАктивныхПользователейНаСервере(УникальныйИдентификатор);
	
	ПараметрыОжидания = ИТК_ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ЗавершеноОбновлениеАктивныхПользователей", ЭтотОбъект);
	ИТК_ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперацияАктивныеПользователи, ОповещениеОЗавершении, ПараметрыОжидания);
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ОбновитьАктивныхПользователейНаСервере(УникальныйИдентификатор)
	
	ПараметрыВыполнения = ИТК_ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыПроцедуры = Новый Структура;
	
	Возврат ИТК_ДлительныеОперации.ВыполнитьВФоне("ИТК_Пользователи.ДанныеАктивныхПользователей", ПараметрыПроцедуры, ПараметрыВыполнения);
	
КонецФункции

&НаКлиенте
Процедура ЗавершеноОбновлениеАктивныхПользователей(Результат, ДополнительныеПараметры) Экспорт
	
	ДлительнаяОперацияАктивныеПользователи = Результат;
	ИТК_ДлительныеОперацииКлиент.ПодготовитьРезультатВыполнения(Результат);
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Статус = "Выполнено" Тогда
		
		ОбновитьАктивныхПользователейНаФорме(Результат.АдресРезультата);
		ИТК_ФормаКлиент.ВосстановитьВыделениеТаблицы(ЭтотОбъект, "АктивныеПользователи", АктивныеПользователиПоследнееВыделение);
		
	КонецЕсли;
	
	ОбновитьЭлементыФормы();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьАктивныхПользователейНаФорме(АдресРезультата)
	
	Результат = ПолучитьИзВременногоХранилища(АдресРезультата);
	ЗначениеВРеквизитФормы(Результат, "АктивныеПользователи");
	КоличествоАктивныхПользователей = АктивныеПользователи.Количество();
	
КонецПроцедуры

&НаСервере
Процедура УстановитьУсловноеОформление()
	
	Оформление = Новый Структура("ЦветТекста", ИТК_ОбщийКлиентСервер.ЦветТекстаНедоступно());
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ПользователиИБ", Оформление, "ПользователиИБ.Отключен", Истина);
	
	Оформление = Новый Структура("ЦветТекста", ИТК_ОбщийКлиентСервер.ЦветТекстаНедоступно());
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "ВнешниеПользователи", Оформление, "ВнешниеПользователи.Недействителен", Истина);

	Оформление = Новый Структура("Шрифт", ИТК_ОбщийКлиентСервер.ШрифтЖирный());
	ИТК_Форма.ДобавитьУсловноеОформление(УсловноеОформление, "АктивныеПользователи", Оформление, "АктивныеПользователи.Конфигуратор", Истина);

КонецПроцедуры

&НаСервере
Процедура ОбновитьЭлементыФормыПриСозданииНаСервере()
	
	УстановитьУсловноеОформление();
	
	ИспользуютсяВнешниеПользователи = ИТК_БСП.ИспользуютсяВнешниеПользователи();
	Элементы.ГруппаВнешниеПользователи.Видимость = ИспользуютсяВнешниеПользователи;
	
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ПользователиИБ);
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.ВнешниеПользователи);
	ИТК_ФормаКлиентСервер.ОтображатьСтрокуПоискаТаблицыФормы(Элементы.АктивныеПользователи);
	
	Элементы.ПользователиИБАдресЭлектроннойПочты.Видимость = ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.15");
	Элементы.ПользователиИБЗапрещеноВосстанавливатьПароль.Видимость = ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.15");
	
	Элементы.ПользователиИБАутентификацияOpenIDConnect.Видимость = ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.19");
	Элементы.ПользователиИБАутентификацияТокеномДоступа.Видимость = ИТК_ОбщийКлиентСервер.ПоддерживаетсяПлатформой("8.3.21");
	
	ИспользуетсяБСП = ИТК_БСПКлиентСервер.ИспользуетсяБСП();
	Элементы.ПользователиИБПользователи_ОткрытьПользователяБСП.Видимость = ИспользуетсяБСП;
	Элементы.ПользователиИБКонтекстноеМенюПользователи_ОткрытьПользователяБСП.Видимость = ИспользуетсяБСП;
	Элементы.АктивныеПользователи_ОткрытьПользователяБСП.Видимость = ИспользуетсяБСП;
	Элементы.АктивныеПользователиКонтекстноеМеню_ОткрытьПользователяБСП.Видимость = ИспользуетсяБСП;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЭлементыФормы()
	
	ИТК_ДлительныеОперацииКлиент.ОбновитьЭлементыОтображенияСостояния(ДлительнаяОперация,
		Элементы.ПользователиИБ, Элементы.ИдетПолучениеПользователейТабличныйДокумент,
		НСтр("ru = 'Получение списка пользователей...';
					|en = 'Getting a list of users...'"));
	
	Элементы.ПользователиИБОтображатьОтключенных.Пометка = ОтображатьОтключенных;
	ОтборИспользуется = НЕ ОтображатьОтключенных;
	ИТК_ФормаКлиент.ДополнитьОтборСтрок(Элементы.ПользователиИБ, ОтборИспользуется, "Отключен", Ложь);
	
	ИТК_ДлительныеОперацииКлиент.ОбновитьЭлементыОтображенияСостояния(ДлительнаяОперацияВнешниеПользователи,
		Элементы.ВнешниеПользователи, Элементы.ИдетПолучениеВнешнихПользователейТабличныйДокумент,
		НСтр("ru = 'Получение списка внешних пользователей...';
					|en = 'Getting a list of external users...'"));
	
	Элементы.ВнешниеПользователиОтображатьНедействительныхВнешнихПользователей.Пометка = ОтображатьНедействительныхВнешнихПользователей;
	ОтборИспользуется = НЕ ОтображатьНедействительныхВнешнихПользователей;
	ИТК_ФормаКлиент.ДополнитьОтборСтрок(Элементы.ВнешниеПользователи, ОтборИспользуется, "Недействителен", Ложь);
	
	#Если ВебКлиент Тогда
		ДоступенЗапускПодПользователем = Ложь;
	#Иначе
		ДоступенЗапускПодПользователем = Истина;
	#КонецЕсли
	Элементы.ПользователиИБЗапуститьПодПользователем.Видимость = ДоступенЗапускПодПользователем;
	
	ИТК_ДлительныеОперацииКлиент.ОбновитьЭлементыОтображенияСостояния(ДлительнаяОперация,
		Элементы.АктивныеПользователи, Элементы.ИдетПолучениеАктивныхПользователейТабличныйДокумент,
		НСтр("ru = 'Получение списка активных пользователей...';
					|en = 'Getting a list of active users...'"));
	
КонецПроцедуры

&НаКлиенте
Процедура ЗапуститьПодПользователемУниверсальная(ТаблицаФормы, ЗапуститьПриОткрытии = Истина)

	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	ТекущиеДанные = ТаблицаФормы.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
		
	Если ТаблицаФормы = Элементы.ВнешниеПользователи Тогда
		ИмяПользователя 					= ИмяПользователяИБПоУникальномуИдентификатору(ТекущиеДанные.ИдентификаторПользователяИБ);
		УникальныйИдентификаторПользователя = ТекущиеДанные.ИдентификаторПользователяИБ;
	Иначе
		ИмяПользователя 					= ТекущиеДанные.Пользователь;
		УникальныйИдентификаторПользователя	= ТекущиеДанные.УникальныйИдентификатор;
	КонецЕсли;
	
	ОткрытьЗапускПодПользователем(ИмяПользователя, УникальныйИдентификаторПользователя, ЗапуститьПриОткрытии);
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьЗапускПодПользователем(ИмяПользователя, УникальныйИдентификаторПользователя, ЗапуститьПриОткрытии)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ИмяПользователя", ИмяПользователя);
	ПараметрыФормы.Вставить("УникальныйИдентификаторПользователя", УникальныйИдентификаторПользователя);
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 ++
	ПараметрыФормы.Вставить("ЗапуститьПриОткрытии", ЗапуститьПриОткрытии);
	// [ⒼⓋ] g.o.vasilyev@gmail.com №1061 28.03.2025 —-
	
	ОткрытьФорму("Обработка.ИТК_Пользователи.Форма.ЗапускПодПользователем", ПараметрыФормы, ЭтотОбъект, , , , , РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбновлениеПользователей()
	ОбновитьПользователей();
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбновлениеВнешнихПользователей()
	ОбновитьВнешнихПользователей();
КонецПроцедуры

&НаКлиенте
Процедура ПодключаемыйОбновлениеАктивныхПользователей()
	ОбновитьАктивныхПользователейИБ();
КонецПроцедуры

&НаСервереБезКонтекста
Функция ИмяПользователяИБПоУникальномуИдентификатору(УникальныйИдентификатор)
	
	ПользовательИБ = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(УникальныйИдентификатор);
	Возврат ПользовательИБ.Имя;
	
КонецФункции

#КонецОбласти

