
#Область ПрограммныйИнтерфейс

Функция РазмерХранилищаЗначений(Знач ХранилищеЗначений) Экспорт
	
	РезультатМетода = 0;
	
	Значение = ХранилищеЗначений.Получить();
	
	Если ТипЗнч(Значение) = Тип("ДвоичныеДанные") Тогда
		#Если Сервер И Не Сервер Тогда
			Значение = Новый ДвоичныеДанные;
		#КонецЕсли
		РезультатМетода = Значение.Размер();
	Иначе
		РезультатМетода = СтрДлина(ЗначениеВСтрокуВнутр(Новый ХранилищеЗначения(Значение, Новый СжатиеДанных(0))));
	КонецЕсли;
	
	Возврат РезультатМетода;

КонецФункции

#КонецОбласти // ПрограммныйИнтерфейс